{"analysis_store/data": {"dede9b20-c46d-435c-b17c-41212225c26a": {"__data__": {"id_": "dede9b20-c46d-435c-b17c-41212225c26a", "metadata": {}, "relationships": {}, "hash": "", "story_scenario_context": "### 第一步：提取关键信息\n1. **研究方向相关**：社交媒体中的爱情表现、卢曼爱情语义学在电视电影中的应用、深入研究卢曼理论及其在社会学研究中的潜在应用、探讨卢曼理论和社会学的交叉点。\n2. **关联因素相关**：与社会学研究中的情感因素密切相关、与媒体中的语义信息有关、卢曼爱情语义学与社交媒体内容密切相联、卢曼理论和社会学研究的靠近度、卢曼理论如何接近社交媒体中的爱情表现、卢曼爱情语义学与社会学观点相交、社交媒体中的爱情表现与卢曼理论存在重叠 。\n\n### 第二步：总结突出特点\n1. **研究建议多元**：提出对社交媒体爱情表现、卢曼爱情语义学在影视应用等多方面的研究建议。\n2. **理论关联紧密**：强调卢曼爱情语义学与社会学研究、社交媒体内容、媒体语义信息等存在紧密关联。\n3. **聚焦交叉研究**：注重探讨卢曼理论与社会学的交叉点以及在相关领域的应用 。  ", "scene_monologue_context": "今天我深入研究了计算机科学相关研究领域的技术框架与方法论，收获颇丰。  \n\n我着重探讨了近几年Transformer、GAN、BERT等框架在提升性能方面的具体方式，它们围绕有效处理数据特征和优化模型结构做了很多努力。像Transformer作为一种序列到序列模型，大量运用自注意力概念，之后众多基于Transformer的模型不断涌现，在自然语言处理和计算机视觉任务中表现卓越。BERT通过对未标记文本进行深度双向表示预训练，取得了强大性能，后续还有RoBERTa、DeBERTa等改进版本。GPT系列则基于Transformer解码器块开发，同样在不同任务中展现出优势。不过，这些预训练模型参数众多，微调时计算成本过高，这是一个亟待解决的问题。  \n\n在模型压缩方面，我了解到剪枝和低秩分解是常用技术。剪枝能减少模型参数，提高训练和推理效率，有多种标准用于选择要修剪的不重要权重。低秩近似也备受关注，一些研究在训练中明确施加低秩约束，还有研究利用低秩分解缩小模型规模。参数高效适应方法旨在微调模型时减少可训练参数数量，通过插入适配器、利用正则化、引入高效提示调整等方式实现，但这些方法生成的微调模型权重数量与预训练模型相同，未提高最终模型的资源效率。  \n\n另外，我还研究了Transformer与CNN在不同任务中的应用和对比。Transformer在NLP和CV领域取得了显著成果，但CNN在效率方面有其独特优势。在卷积核方面，许多知名模型已经开始使用大内核，为提高效率也有各种改进方法。我还接触到了MetaNeXt相关内容，它对ConvNeXt块进行了抽象和改进，与MetaFormer块有相似之处但又有区别，通过简化架构提高了速度。  \n\n关于将Transformer推广到图数据的研究也很有意思，主要集中在为节点设计专用位置编码和缓解计算复杂性以扩展到大型图这两个问题上。同时，稀疏Transformer在降低计算复杂性方面也有诸多尝试，而图神经网络在处理大型图时面临可扩展性问题，有多种节点采样算法被提出。  \n\n今天的学习让我对这些领域的知识有了更全面、深入的理解，为后续的研究和工作打下了坚实基础。  ", "user_id": "此来访者", "scene_content": "角色    内容    分镜\n", "story_board_summary_context": "8da2e2af-46ef-4ee5-8766-c77589af9874:「分析近几年研究领域的技术框架与方法论」\n8da2e2af-46ef-4ee5-8766-c77589af9874:「近几年在计算机科学相关研究领域，Transformer、GAN、BERT 等框架是如何具体围绕有效处理数据特征和优化模型结构来提升性能的？ 」\n8da2e2af-46ef-4ee5-8766-c77589af9874:「ref_ids: 454847723981641856, chunk_ids: 1, Score: 0.4590, Text: # 2 RELATED WORK\nPre-trained language models. Transformer (Vaswani et al., 2017) is a sequence-to-sequence model that heavily uses the concept of self-attention. Later on, numerous transformer-based models have been proposed and show overwhelming performance on natural language processing (NLP) and on computer vision (CV) tasks. Devlin et al. (2019) designed BERT that pre-train deep bidirectional representations from unlabeled text and reached powerful performance. Liu et al. (2019) found that BERT were terribly undertrained and proposed RoBERTa, an enhanced training recipe for BERT which can greatly boost the performance. He et al. (2020) proposed decoding-enhanced BERT with disentangled attention (DeBERTa) that incorporates the disentangled attention mechanism and an improved mask encoder to enhance BERT and RoBERTa. More variants like XL-Net, Albert, and Electra have also been proposed in recent years (Yang et al., 2019; Lan et al., 2019; Clark et al., 2019). The series of GPT models (Radford et al., 2019; Brown et al., 2020) are later developed based on transformers decoder blocks rather than encoder blocks like BERT, which again have shown superior performance on different tasks. These large models pretrained on a large amount of unlabelled texts would need to be further fine-tuned on downstream tasks for better performance.  \n\nOne of the accompanying disadvantages of these pre-training models with tremendous parameter counts (e.g., 175 B in GPT-3) is the unaffordable computational cost for further fine-tuning.  \n\nPruning and Low-rank decomposition. Pruning is a widely-used model compression technique. It can reduce the number of parameters inside models, which possibly brings training and inference efficiency. Along with weight pruning method (Han et al., 2015b) being one of the most effective methods (Gordon et al., 2020), various criterion have been proposed to select insignifi- cant weights for pruning, such as Taylor approximation (Molchanov et al., 2019), Hessian score approximation (Hassibi & Stork, 1993), and other saliency scores such as SNIP (Lee et al., 2018), GraSP (Wang et al., 2019) and SynFlow (Tanaka et al., 2020). Several pruning methods have been commonly adapted to compress language models (McCarley et al., 2019; Gordon et al., 2020; Sanh et al., 2020; Wang et al., 2020; Chen et al., 2021). Specifically, McCarley et al. (2019) proposed to prune attention heads that had less contribution to the model. Wang et al. (2020) pruned BERT models by involving low-rank factorization and $\\\\ell_{0}$ regularization. Sanh et al. (2020) invented an improved version of magnitude pruning ( i.e. , pruning based on the weight change) that can better suit the transfer learning. Chen et al. (2021) performed structured pruning on BERT via $\\\\ell_{1}$ sparse regularization, which reduced a large portion of parameters and decreased the training cost.  \n\nLow-rank approximation (Ye, 2005) is also vastly studied. One classical scenario is robust principle component analysis (Cand\\\\`es et al., 2011), which decomposes a matrix into a low-rank plus a sparse component. Existing literature shows that in deep learning, the learned over-parameterized models often naturally bear approximate low-rank weight structures (Oymak et al., 2019; Yu et al., 2017). Some (Jaderberg et al., 2014; Povey et al., 2018; Sainath et al., 2013; Zhang et al., 2014; Zhao et al., 2016) have explicitly imposed the low-rank constraint during training. Wang et al. (2020); Hu et al. (2021) utilized low-rank decomposition to shrink the model size and trim down the trainable parameters during fine-tuning. However, to our best knowledge, integrating sparsity and low-rank structures has never been studied before for efficient fine-tuning of pre-trained language models.  \n\nParameter-efficient adaptation. Parameter-efficient adaptation aims at reducing the number of trainable parameters when fine-tuning the models across different downstream domains. Unlike pruning, it generates sparse updates instead of building sparse models. Various approaches are invented to achieve the goal. Rebuffiet al. (2017); Houlsby et al. (2019) inserted and only trained adapters between existing layers, whose parameters are much less compared to the pretrained models. Guo et al. (2020) leveraged $\\\\ell_{0}$ regularization to limit the number of non-zero elements in the update vectors. Lester et al. (2021); Li & Liang (2021) introduced efficient prompt tuning which optimizes only a small continuous task-specific vector. Hu et al. (2021) proposed a low-rank decomposition-based method that can also significantly reduce the number of trainable parameters. However, fine-tuned models yielded by these methods work have the same amount of weights as the pre-trained starting point; hence they contribute no resource efficiency of the final model.\n\n# 3 METHODOLOGY\nIn this section, we begin by describing our notations and definitions of sparsity generation and parameter-efficient fine-tuning in Section 3.1. Then, we introduce the (dually) sparsity-embedded efficient fine-tuning algorithms in Sections 3.2 and 3.3.\n\n# 3.1 PRELIMINARIES\nSparsity generation and resource-efficient fine-tuning. We adopt both unstructured and structured pruning methods to produce sparsity. They can lead to resource-efficiency including memory and computation savings.  \n\n$\\\\boldsymbol{\\\\mathscr{W}}\\\\,\\\\in\\\\,\\\\mathbb{R}^{m\\\\times n}$ denote a weight matrix. The goal of ning is to fi a binary mas $s\\\\ \\\\in$ $\\\\{0,1\\\\}^{\\\\|\\\\mathcal{W}\\\\|_{0}}$ {results in a sparse weight structured pruning, it helps save computational cost since the sparse weights can be smaller in size }, where $\\\\|\\\\mathcal{W}\\\\|_{0}$ W ⊙S . For unstructured pruning, only memory cost is saved; but for umber of parameters in W. The mask Sis applied to Wand by wiping out all-zero columns or rows. However, the performance of networks after structured pruning is often shown to be inferior compared with the unstructured pruning counterpart.  \n\nParameter-efficient fine-tuning. stream rn task ific weight update To leverage $\\\\Delta{\\\\mathcal{W}}$ knowledge in pre-trained weights via fine-tuning and generate predictions with $\\\\mathcal{W}$ , downweights massive resources as the size of the pre-trained model increases. Parameter-efficient fine-tuning try W$\\\\mathcal{W}\\\\!+\\\\!\\\\Delta\\\\mathcal{W}$ W. Since $\\\\Delta{\\\\mathcal{W}}$ Whas the same size of W, learning the update matrices usually requires to solve this problem by using as few trainable parameters as possible to represent $\\\\Delta{\\\\mathcal{W}}$ , while maintaining competitive downstream fine-tuning performance. Previous literature reaches the goal via either sparsifying weigh a matrices $\\\\Delta{\\\\mathcal{W}}$ (Guo et al., 2020) or leveraging low-rank decomposed matrices to compute $\\\\Delta{\\\\mathcal{W}}$ W(Hu et al., 2021).  \n\n  \nFigure 1: The overview of our proposals. The sparse masks can have unstructured or structured patterns, hich leads to training and erence efficiency. During the fine-tuning, we only train decomposed matrices $\\\\mathcal{U}$ ,Vand non-zero elements in S$S_{2}$ 2 .  \n\n<html><body><table><tr><td>Algorithm 1: Sparsity-Embedded Low- Rank Decomposition</td></tr><tr><td>Input: Pretrained weights W, number of non-zero elements N Output: Sparse matrices S2 Initialize S2 to be an empty set. foreachself-attentionprojectionweights w inW do */</td></tr><tr><td>/+ Decomposition Perform matrix decomposition: w; ≈ UV + S' by solving the optimization problem in Eqn.1. /* Identify important</td></tr><tr><td>elements to form S2 */ Perform thresholding on S': Keep N elements in S' with top magnitudes, and set the rest 0. Append S' into S2. end</td></tr></table></body></html>  \n\n<html><body><table><tr><td>Algorithm2:DSEE</td></tr><tr><td>Input: Pretrained weights W, number of non-zero elements N, desired sparsity s, loss function Output: Sparse mask S1, matrices U,V, S2 Decompose W into U,V and S2</td></tr><tr><td>(Re-)Initialization: U = 0, V ~ N(0,0.02),Ω = indexes of non-zero elements in S2, S = 0 /﹢ I:train before pruning * Train U,V, S with respect to L under the</td></tr><tr><td>constraint of Poc (S) = 0. / II: pruning the model */</td></tr><tr><td>Prune (1-s%) parameters in W globally by sorting the magnitude of W + UV + S,</td></tr><tr><td>deriving the sparsity mask S1 /+ III:tuning after pruning * Tune U, V, S2 for E epochs for recovering the performance.</td></tr></table></body></html>」\n8da2e2af-46ef-4ee5-8766-c77589af9874:「ref_ids: 454847724073130116, chunk_ids: 3, Score: 0.4023, Text: # 2. Related work\n\n# 2.1. Transformer v.s. CNN\nTransformer [ 63 ] was introduced in 2017 for NLP tasks. Compared with LSTM, Transformer can not only train in parallel but also achieve better performance. Then many famous NLP models are built on Transformer, including GPT series [ 44 ,45 ,3 ,42 ], BERT [ 12 ], T5 [ 47 ], and OPT [80 ]. For the application of the Transformer in vision tasks, Vision Transformer (ViT) is definitely the seminal work, showing that Transformer can achieve impressive performance after large-scale supervised training. Followup works [ 61 ,76 ,65 ,66 ,18 ] like Swin [ 37 ] continually improve model performance, achieving new state-of-the-art on various vision tasks. These results seem to tell us “Attention is all you need” [ 63 ].  \n\nBut it is not that simple. ViT variants like DeiT usually adopt modern training procedures including various advanced techniques of data augmentation [ 10 ,9 ,79 ,77 ,83 ], regularization [ 57 ,25 ] and optimizers [ 28 ,39 ]. Wightman et al. find that with similar training procedures, the performance of ResNet can be largely improved. Besides, Yu et al. [74 ] argue that the general architecture instead of attention plays a key role in model performance. Han et al. [19 ] find by replacing attention in Swin with regular or dynamic depthwise convolution, the model can also obtain comparable performance. ConvNeXt [ 38 ], a remarkable work, modernizes ResNet into an advanced version with some designs from ViTs, and the resulting models consistently outperform Swin [ 37 ]. Other works like RepLKNet [13 ], VAN [ 17 ], FocalNets [ 72 ], HorNet [ 49 ], SLKNet [ 36 ], ConvFormer [ 75 ], Conv2Former [ 22 ], and InternImage [ 64 ]constantly improve performance of CNNs. Despite the high performance obtained, these models neglect efficiency, exhibiting lower speed than ConvNeXt. Actually, ConvNeXt is also not an efficient model compared with ResNet. We argue that CNN models should keep the original advantage of efficiency. Thus, in this paper, we aim to improve the model efficiency of CNNs while maintaining high performance.\n\n# 2.2. Convolution with large kernels.\nWell-known works, like AlexNet [ 30 ] and Inception v1 [56 ] already utilize large kernels up to $11\\\\times11$ and $7\\\\times7$ , respectively. To improve the efficiency of large kernels, VGG [53 ] proposes to heavily s $3\\\\times3$ convolutions e In$k\\\\times1$ $k\\\\times k$ tant for semantic segmentation and they decompose large ××on v3 [ staking sequentially. For depthwise convoluti [. Besides, Peng 60 ] splits kernels into several groups from 57 ] factorizes et al. $k\\\\times k$ find that large kernels are impor×convolution into $1\\\\times k$ $3\\\\times3$ ××and ixto kernels similar to Inception v3 [ 57 ]. Witnessing the success of Transformer in vision tasks [ 16 ,65 ,37 ], large-kernel convolution is more emphasized since it can offer a large receptive field to imitate attention [ 19 ,38 ]. For example, ConvNeXt adopts kernel size of $7\\\\times7$ for depthwise convolution by default. To employ larger kernels, RepLKNet [ 13 ]proposes to utilize structural re-parameterization techniques [78 ,14 ] to scale up kernel size to $31\\\\times31$ ; VAN [ 17 ] sequentially stacks large-kernel depth-wise convolution (DWConv) and depth-wise dilation convolution to obtain $21\\\\!\\\\times\\\\!21$ receptive filed; FocalNets employs a gating mechanism to fuse multi-level features from stacking depthwise convolutions; Recently, SLaK [ 36 ] fac es la ernel $k\\\\times k$ two small non-square kernels ( Different from these works, we do not aim to scale up larger $k\\\\!\\\\times\\\\!s$ ×and $s\\\\!\\\\times\\\\!k$ ×, where $s<k$ ). kernels. Instead, we target efficiency and decompose large kernels in a simple and speed-friendly way while keeping comparable performance.\n\n# 3. Method\n\n# 3.1. MetaNeXt\nFormulation of MetaNeXt Block. ConvNeXt [ 38 ] is a modern CNN model with simple architecture. For each ConvNeXt block, the input $X$ is first processed by a depthwise convolutioin to propagate information along spatial dimensions. We follow MetaFormer [ 74 ] to abstract the depthwise convolution as a token mixer which is responsible for spatial information interaction. Accordingly, as shown in the second subfigure in Figure 2 , the ConvNeXt is abstracted as MetaNeXt block. Formally, in a MetaNeXt block, its input $X$ is firstly processed as  \n\n$$\nX^{\\\\prime}=\\\\operatorname{TokenMixer}(X)\n$$  \n\nimport torch.nn as nn  \n\nAlgorithm 1 Inception Depthwise Convolution (PyTorchlike Code)   \n\n\n<html><body><table><tr><td>def</td><td>class InceptionDwConv2d(nn.Module): init__(self， in_channels,</td></tr><tr><td></td><td>square_kernel_size=3, band_kernel_size=11, branch_ratio=1/8): super().—init()</td></tr><tr><td></td><td>gc = int(in_channels * branch_ratio) # channel number of a convolutionbranch</td></tr><tr><td></td><td>self.dwconv_hw = nn.Conv2d(gc, gc, square_kernel_size, padding= square_kernel_size//2, groups=gc)</td></tr><tr><td></td><td>self.dwconv_w = nn.Conv2d(gc, gc, kernel_size =(l, band_kernel_size), padding=(0,</td></tr><tr><td></td><td>band_kernel_size//2), groups=gc) self.dwconv_h = nn.Conv2d(gc, gc,. kernel_size =(band_kernel_size, l), padding=(</td></tr><tr><td></td><td>band_kernel_size//2, 0)， groups=gc) self.split_indexes = (gc, gc, gc, in_channels -\"3*gc)</td></tr><tr><td></td><td>def forward(self，x): # B， C， H,， W = x.shape</td></tr><tr><td></td><td>x_hw， x_w， x_h, x_id = torch.split(x， self.</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td>split_indexes, dim=l)</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td>return torch.cat(</td></tr><tr><td></td><td></td></tr><tr><td></td><td>(self.dwconv_hw(x_hw）,</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td>self.dwconv_w(x_w),</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td>x_id),</td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td>self.dwconv_h(x_h),</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td>dim=1)</td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr></table></body></html>  \n\nwhere $X,X^{\\\\prime}\\\\in\\\\mathbb{R}^{B\\\\times C\\\\times H\\\\times W}$ with $B,C,H$ and $W$ denoting batch size, channel number, height and width, respectively. Then the output from the token mixer is normalized,  \n\n$$\nY=\\\\operatorname{Norm}(X^{\\\\prime})\n$$  \n\nAfter normalization [ 27 ,1 ], the resulting features are inputted into an MLP module consisting of two fullyconnected layers with an activation function sandwiched between them, the same as feed-forward network in Transformer [ 63 ]. The two fully-connected layers can also be implemented by $1\\\\times1$ convolutions. Also, shortcut connection [ 20 ,54 ] is adopted. This process can be expressed by  \n\n$$\nY=\\\\mathrm{Conv}_{1\\\\times1}^{r C\\\\to C}\\\\{\\\\sigma[\\\\mathrm{Conv}_{1\\\\times1}^{C\\\\to r C}(Y)]\\\\}+X,\n$$  \n\nwhere $\\\\mathrm{Conv}_{k\\\\times k}^{C_{i}\\\\rightarrow C_{o}}$ means convolution with kernel size of $k\\\\times k$ , input channels o ×$C_{i}$ and output channels of $C_{o};r$ is the expansion ratio and σdenotes activation function.  \n\nComparison to MetaFormer block. As shown in Figure 2 , it can be found that MetaNeXt block shares similar modules with MetaFormer block [ 74 ], e.g. token mixer and MLP. Nevertheless, a critical differentiation between the two models lies in the number of shortcut connections [20 ,54 ]. MetaNeXt block implements a single shortcut connection, whereas the MetaFormer block incorporates two, one for the token mixer and the other for the MLP. From this aspect, MetaNeXt block can be regarded as a result of merging two residual sub-blocks from MetaFormer, thereby simplifying the overall architecture. As a result, the MetaNeXt architecture exhibits a higher speed compared to MetaFormer. However, this simpler design comes with a limitation: the token mixer component in MetaNeXt cannot be complicated ( e.g. , Attention) as shown in our experiments (Table 3 ).  \n\nInstantiation to ConvNeXt. As shown in Figure 2 , in ConvNeXt, the token mixer is simply implemented by a depthwise convolution,  \n\n$$\nX^{\\\\prime}=\\\\operatorname{TokenMixer}(X)=\\\\operatorname{DWConv}_{k\\\\times k}^{C\\\\to C}(X)\n$$  \n\nkernel size of where $\\\\mathrm{DWConv}_{k\\\\times k}^{C\\\\rightarrow C}$ $k\\\\times k$ ×. In ConvNeXt, denotes depthwise convolution with $k$ is set as 7 by default.」\n8da2e2af-46ef-4ee5-8766-c77589af9874:「ref_ids: 454845616393828768, chunk_ids: 2, Score: 0.3945, Text: # 2 Related Work\n\n# 2.1 Transformers for Graph\nRecently, Transformer [ 33 ] has shown its superiority in an increasing number of domains [ 7 ,8 ,40 ], e.g. Bert [ 7 ] in NLP and ViT [ 8 ] in CV. Existing works attempting to generalize Transformer to graph data mainly focus on two problems: (1) How to design dedicated positional encoding for the nodes; (2) How to alleviate the quadratic computational complexity of the vanilla Transformer and scale the Graph Transformer to large graphs. As for the positional encoding, GT [ 9 ] firstly uses Laplacian eigenvectors to enhance node features. Graph-Bert [ 41 ] studies employing Weisfeiler-Lehman code to encode structural information. Graphormer [ 38 ] utilizes centrality encoding to enhance node features while incorporating edge information with spatial (SPD-indexed attention bias) and edge encoding. SAN [ 21 ] further replaces the static Laplacian eigenvectors with learnable positional encodings and designs an attention mechanism that distinguishes local connectivity. For the scalability issue, one immediate idea is to restrict the number of attending nodes. For example, GAT [ 34 ] and GT-Sparse [9 ] only consider the 1-hop neighboring nodes; Gophormer [ 46 ] uses GraphSAGE [ 11 ] sampling to uniformly sample ego-graphs with pre-defined maximum depth; Graph-Bert [ 41 ] restricts the receptive field of each node to the nodes with top$\\\\cdot\\\\mathbf{k}$ intimacy scores (e.g., Katz and PPR). However, these fixed node sampling strategies sacrifice the advantage of the Transformer architecture. SAC [22 ] tries to use an LSTM edge predictor to predict edges for self-attention operations. However, the fact that LSTM can hardly be parallelized reduces the computational efficiency of the Transformer.\n\n# 2.2 Sparse Transformers\nIn parallel, many efforts have been devoted to reducing the computational complexity of the Transformer in the field of NLP [ 23 ] and CV [ 32 ]. In the domain of NLP, Longformer [ 2 ] applies block-wise or strode patterns while only fixing on fixed neighbors. Reformer [ 19 ] replaces dot-product attention by using approximate attention computation based on locality-sensitive hashing. Routing Transformer [30] employs online $\\\\mathbf{k}$ -means clustering on the tokens. Linformer [35] demonstrates that the self-attention mechanism can be approximated by a low-rank matrix and reduces the complexity from ${\\\\mathcal{O}}(n^{2})$ scheme which brings greater efficiency by limiting self-attention computation to non-overlapping to $\\\\mathcal{O}(n)$ . As for vision transformers, Swin Transformer [ 24 ] proposes the shifted windowing local windows while also allowing for cross-window connection. Focal Transformer [ 37 ] presents a new mechanism incorporating both fine-grained local and coarse-grained global attention to capture short- and long-range visual dependencies efficiently. However, these sparse transformers do not take the unique graph properties into consideration.\n\n# 2.3 Graph Neural Networks and Node Sampling\nGraph neural networks (GNNs) [ 18 ,11 ,12 ,44 ,43 ,31 ,45 ,42 ] follow a message-passing schema that iteratively updates the representation of a node by aggregating representations from neighboring nodes. When generalizing to large graphs, Graph Neural Networks face a similar scalability issue. This is mainly due to the uncontrollable neighborhood expansion in the aggregation stage of GNN. Several node sampling algorithms have been proposed to limit the neighborhood expansion, which mainly falls into node-wise sampling methods and layer-wise sampling methods. In node-wise sampling, each node samples $k$ neighbors from its sampling distribution, then the total number of nodes in the $l$ -th layer becomes $\\\\mathcal{O}(\\\\breve{k}^{l})$ . GraphSage [ 11 ] is one of the most well-known node-wise sampling methods with the uniform sampling distribution. GCN-BS [ 25 ] introduces a variance reduced sampler based on multi-armed bandits. To alleviate the exponential neighbor expansion $\\\\mathcal{O}(k^{l})$ of the node-wise samplers, layer-wise samplers define the sampling distribution as a probability of sampling nodes given a set of nodes in the upper layer [ 4 ,16 ,49 ]. From another perspective, these sampling methods can also be categorized into fixed sampling strategies [ 11 ,4 ,49 ] and adaptive strategies [ 25 ,39 ]. However, none of the above sampling methods in GNNs can be directly applied in Graph Transformer as Graph Transformer does not follow the message passing schema.\n\n# 3 Preliminaries\n\n# 3.1 Problem Definition\nLet $G=(A,X)$ denote t ted graph where $A\\\\in\\\\mathbb{R}^{n\\\\times n}$ represents the symmetric adjac matrix with nnodes, and $X\\\\in\\\\mathbb{R}^{n\\\\times p}$ ∈is the attribute matrix of pattributes r node. The element $A_{i j}$ in the adjacency matrix equals to 1 if there exists an edge between node $v_{i}$ and node $v_{j}$ , otherwise $A_{i j}~=~0$ . The label of node $v_{i}$ is $y_{i}$ . In the node classification problem, the classifier has the knowledge of the labels of a subset of nodes $V_{L}$ . The goal of semi-supervised node classification is to infer the labels of nodes in $V\\\\backslash V_{L}$ by learning a classification function.\n\n# 3.2 Transformer Architecture\nThe Transformer architecture consists of a series of Transformer layers [ 33 ]. Each Transformer layer has two parts: a multi-head self-attention (MHA) module and a position-wise feed-forward network (FFN). Let $\\\\mathbf{H}=\\\\left[h_{1},\\\\cdot\\\\cdot\\\\cdot\\\\mathbf{\\\\Phi},h_{m}\\\\right]^{\\\\top}\\\\in\\\\mathbb{R}^{m\\\\times d}$ denote the input to the self-attention module where $d$ is  \n\nthe hidden dimension, $h_{i}\\\\in\\\\mathbb{R}^{d\\\\times1}$ is the hidden represe ation at position $i$ , and $m$ is the number of positions. The MHA module firstly projects the input Hto query-, key-, value-spaces, denoted as $\\\\mathbf{Q},\\\\mathbf{K},\\\\mathbf{V}$ , using three matrices $\\\\mathbf{W}_{Q}\\\\in\\\\mathbb{R}^{d\\\\times d_{K}}$ ,$\\\\mathbf{W}_{K}\\\\in\\\\mathbb{R}^{d\\\\times d_{K}^{\\\\textbf{\\\\texttt{L}}}}$ and $\\\\dot{\\\\mathbf{W}_{V}}\\\\in\\\\mathbb{R}^{d\\\\times d_{V}}$ :  \n\n$$\n\\\\mathbf{Q}=\\\\mathbf{H}\\\\mathbf{W}_{Q},\\\\quad\\\\mathbf{K}=\\\\mathbf{H}\\\\mathbf{W}_{K},\\\\quad\\\\mathbf{V}=\\\\mathbf{H}\\\\mathbf{W}_{V}.\n$$  \n\nThen, in each head $i\\\\,\\\\in\\\\,\\\\{1,2,\\\\dots,B\\\\}$ ($B$ is the to heads), the scaled dot-product attention mechanism is applied to the corresponding {$\\\\{\\\\mathbf{Q}_{i},\\\\mathbf{K}_{i},\\\\mathbf{V}_{i}\\\\}$ }:  \n\n$$\n\\\\mathrm{head}_{i}=\\\\mathrm{Softmax}\\\\left(\\\\frac{\\\\mathbf{Q}_{i}\\\\mathbf{K}_{i}^{T}}{\\\\sqrt{d_{K}}}\\\\right)\\\\mathbf{V}_{i}.\n$$  \n\nFinally, the outputs from different heads are further concatenated and transformed to obtain the final output of MHA:  \n\n$$\n\\\\mathrm{MHA}(\\\\mathbf{H})=\\\\mathrm{Concat}\\\\left(\\\\mathbf{\\\\Pi}_{\\\\mathrm{head}_{1},\\\\mathbf{\\\\Pi}_{\\\\cdot}\\\\mathbf{\\\\Pi}_{\\\\cdot},\\\\mathrm{...},\\\\mathrm{head}_{B}}\\\\right)\\\\mathbf{W}_{O},\n$$  \n\nwhere $\\\\mathbf{W}_{O}\\\\in\\\\mathbb{R}^{d\\\\times d}$ . In this work, we employ $d_{K}=d_{V}=d/B$ .」\n", "dreams_guidance_context": "### Step 1: 确定研究的关键问题和目标\n - **关键问题**：\n    - Transformer、GAN、BERT等框架如何围绕有效处理数据特征和优化模型结构来提升性能？\n    - 预训练模型参数众多导致微调计算成本过高的问题如何解决？\n    - 如何在提升模型性能的同时，兼顾模型效率（如CNN的效率优势）？\n    - 将Transformer推广到图数据面临的为节点设计专用位置编码和缓解计算复杂性以扩展到大型图的问题如何解决？\n - **研究目标**：\n    - 分析近几年相关框架提升性能的具体方式。\n    - 探索解决预训练模型微调计算成本高的方法。\n    - 改进模型以在保持高性能的同时提高效率，如针对CNN模型。\n    - 找到将Transformer推广到图数据的有效解决方案，以及解决图神经网络处理大型图时的可扩展性问题。\n\n### Step 2: 梳理算法和方法\n - **提升模型性能的算法和方法**：\n    - Transformer大量运用自注意力概念，众多基于Transformer的模型不断发展，如BERT预训练深度双向表示、GPT系列基于Transformer解码器块开发。\n    - 对BERT进行改进，出现RoBERTa、DeBERTa等版本。\n - **模型压缩的算法和方法**：\n    - **剪枝**：通过多种标准（如Taylor近似、Hessian score approximation、SNIP、GraSP、SynFlow等）选择不重要权重进行修剪，有多种剪枝方法应用于压缩语言模型。\n    - **低秩分解**：一些研究在训练中明确施加低秩约束，部分研究利用低秩分解在微调时缩小模型规模。\n - **参数高效适应的算法和方法**：通过插入适配器（Rebuffi等、Houlsby等）、利用正则化（Guo等）、引入高效提示调整（Lester等、Li & Liang）等方式减少微调时的可训练参数数量。\n - **改进模型效率的算法和方法**：MetaNeXt对ConvNeXt块进行抽象和改进，简化架构提高速度，与MetaFormer块有相似和不同之处。\n - **Transformer推广到图数据的算法和方法**：针对为节点设计专用位置编码（如GT用Laplacian eigenvectors、Graph - Bert用Weisfeiler - Lehman code、Graphormer用centrality encoding等）和缓解计算复杂性（如GAT、GT - Sparse限制关注节点数量，Gophormer用GraphSAGE采样等）提出多种方法。\n - **稀疏Transformer降低计算复杂性的算法和方法**：Longformer应用block - wise或stride模式，Reformer用近似注意力计算，Routing Transformer用online k - means聚类，Linformer用低秩矩阵近似自注意力机制等。\n - **图神经网络处理大型图可扩展性问题的算法和方法**：有节点-wise采样方法（如GraphSage）和layer - wise采样方法，以及固定采样策略和自适应策略。\n\n### Step 3: 分析实验设计和结果\n - **实验设计**：\n    - 在模型性能提升方面，通过在自然语言处理和计算机视觉任务中测试基于Transformer的各种模型，对比不同模型的性能表现。\n    - 在模型压缩方面，针对不同的剪枝标准和低秩分解方法，设计实验对比模型参数减少后的训练和推理效率，以及模型性能变化。\n    - 在参数高效适应方面，对插入适配器、利用正则化、引入高效提示调整等方法，通过实验评估微调时可训练参数减少的效果以及对模型性能的影响。\n    - 在改进模型效率方面，对比MetaNeXt与MetaFormer在速度和性能上的差异，通过实验验证MetaNeXt简化架构后的效果。\n    - 在Transformer推广到图数据方面，针对为节点设计的不同位置编码方法和缓解计算复杂性的方法，在图数据的节点分类等任务中进行实验测试。\n    - 在稀疏Transformer降低计算复杂性方面，通过实验对比不同稀疏Transformer方法在减少计算量的同时对模型性能的影响。\n    - 在图神经网络处理大型图可扩展性方面，通过实验评估不同节点采样算法对限制邻域扩展和模型性能的影响。\n - **实验结果**：\n    - 基于Transformer的模型在自然语言处理和计算机视觉任务中表现卓越，但预训练模型微调计算成本高。\n    - 不同的模型压缩方法在减少参数、提高效率的同时，对模型性能有不同程度的影响。\n    - 参数高效适应方法能减少可训练参数数量，但生成的微调模型权重数量与预训练模型相同，未提高最终模型的资源效率。\n    - MetaNeXt通过简化架构提高了速度，但在某些方面存在一定局限性（如token mixer组件不能过于复杂）。\n    - 各种将Transformer推广到图数据的方法和稀疏Transformer方法在解决相应问题的同时，也存在一些不足（如固定节点采样策略牺牲Transformer架构优势等）。\n    - 不同的图神经网络节点采样算法在限制邻域扩展方面有不同效果，但都不能直接应用于Graph Transformer。\n\n### Step 4: 评估研究的局限性和未来方向\n - **局限性**：\n    - 预训练模型参数众多导致微调计算成本过高。\n    - 结构化剪枝后的网络性能常不如非结构化剪枝。\n    - 参数高效适应方法生成的微调模型未提高最终模型的资源效率。\n    - MetaNeXt中token mixer组件不能过于复杂。\n    - 将Transformer推广到图数据的固定节点采样策略牺牲了Transformer架构优势，SAC中LSTM难以并行化降低计算效率。\n    - 图神经网络的节点采样方法不能直接应用于Graph Transformer。\n - **未来方向**：\n    - 探索更有效的方法解决预训练模型微调计算成本高的问题。\n    - 研究如何在结构化剪枝中更好地平衡模型性能和效率。\n    - 寻找能真正提高最终模型资源效率的参数高效适应方法。\n    - 进一步改进MetaNeXt，突破token mixer组件的限制。\n    - 研究更优的方法将Transformer推广到图数据，兼顾架构优势和计算效率。\n    - 探索适用于Graph Transformer的节点采样方法。  ", "evolutionary_step": "这段对话主要围绕计算机科学研究领域展开，涉及技术框架、方法论以及多个模型的研究和应用，与给定的计算机科学研究相关步骤有一定关联，从不同模型处理数据、优化结构以及探索新方法等方面体现了对语义信息、算法表现、反馈机制以及算法和数据结构关系的研究。具体总结如下：\n1. **分析技术框架与方法论**：探讨近几年计算机科学研究领域的技术框架与方法论，关注Transformer、GAN、BERT等框架如何通过有效处理数据特征和优化模型结构提升性能。\n2. **预训练语言模型**：Transformer广泛应用于自然语言处理和计算机视觉任务，基于它衍生出众多模型，如BERT及其变体、GPT系列等。这些大模型预训练后需微调，但其参数多，微调计算成本高。\n3. **模型压缩技术**：\n    - **剪枝**：广泛用于模型压缩，通过减少模型参数提高训练和推理效率，有多种选择不重要权重的标准，多种剪枝方法用于压缩语言模型。\n    - **低秩分解**：在深度学习中被大量研究，一些工作在训练中施加低秩约束或利用其缩小模型规模、减少可训练参数，但整合稀疏性和低秩结构用于预训练语言模型高效微调的研究较少。\n4. **参数高效适配**：旨在微调模型时减少可训练参数，有多种方法实现，如插入并训练适配器、利用正则化限制更新向量非零元素数量、引入高效提示调整等，但这些方法微调后的模型权重数量与预训练模型相同，未提高最终模型资源效率 。\n5. **Transformer与CNN对比**：Transformer在NLP和视觉任务中表现出色，许多著名模型基于此构建。但研究发现，通过改进训练程序，ResNet性能可提升，模型架构对性能起关键作用，部分工作用卷积替代注意力也能取得可比性能。ConvNeXt将ResNet现代化，性能优于Swin，但一些改进的CNN模型效率较低，研究旨在提高CNN模型效率同时保持高性能。\n6. **大核卷积**：一些知名模型已使用大核卷积，为提高效率，有工作提出堆叠小卷积、分解大核等方法。受Transformer在视觉任务成功的影响，大核卷积更受重视，一些模型采用更大核或新方法，而本次研究目标是在保持性能的同时以简单快速的方式分解大核 。\n7. **MetaNeXt**：以ConvNeXt为基础，将深度卷积抽象为负责空间信息交互的Token Mixer，依此抽象出MetaNeXt块。该块与MetaFormer块有相似模块，但快捷连接数量不同，MetaNeXt块简化了架构，速度更快，但Token Mixer组件不能过于复杂。ConvNeXt中Token Mixer由深度卷积实现，默认核大小为7。 \n8. **Transformer在图数据中的应用**：现有工作主要关注为节点设计专用位置编码和缓解Transformer二次计算复杂度以扩展到大型图这两个问题，不同模型提出了多种解决方案，但各有局限性。 \n9. **稀疏Transformer**：在自然语言处理和计算机视觉领域，众多工作致力于降低Transformer计算复杂度，不同模型提出了多种方法，但这些方法未考虑图的独特属性。 \n10. **图神经网络与节点采样**：图神经网络在扩展到大型图时面临可扩展性问题，提出了多种节点采样算法，主要分为节点级采样和层级采样方法，也可分为固定采样策略和自适应策略，但这些方法不能直接应用于图Transformer。  ", "dreams_personality_context": "这段内容并没有直接体现人物性格相关信息。如果非要从侧面推测，可能体现出以下性格特点：\n1. **求知欲强**：对计算机科学多个前沿领域的技术和研究方向都有深入探索，不断追寻新的知识和方法，展现出强烈的求知欲望。\n2. **严谨细致**：在研究各种模型、算法以及技术细节时，能够详细分析不同方法的优缺点、适用场景等，体现出严谨细致的性格特质，注重研究的准确性和全面性。\n3. **勇于创新**：关注到现有研究的不足，如整合稀疏性和低秩结构用于预训练语言模型高效微调研究较少等情况，积极探索新的方法和途径，表现出勇于突破传统、敢于创新的性格。 \n4. **坚韧执着**：面对计算机科学研究中复杂的技术问题，如模型压缩、参数高效适配、图数据处理等难题，持续深入研究，不轻易放弃，反映出坚韧执着的性格特点。  ", "ref_analysis_id": ""}, "__type__": "dreams_node"}}, "analysis_store/ref_analysis_info": {"": {"node_ids": ["dede9b20-c46d-435c-b17c-41212225c26a"], "metadata": {}}}, "analysis_store/metadata": {"dede9b20-c46d-435c-b17c-41212225c26a": {"analysis_hash": "", "ref_analysis_id": ""}}}