{"template_store/data": {"4b962227-5488-4943-98f4-dd287616068a": {"__data__": {"id_": "4b962227-5488-4943-98f4-dd287616068a", "metadata": {}, "relationships": {}, "hash": "", "exec_code": "", "base_template_content": "\nfrom langchain_community.chat_models import ChatOpenAI\nfrom langchain.prompts.chat import (\n    ChatPromptTemplate,\n    SystemMessagePromptTemplate,\n    AIMessagePromptTemplate,\n    HumanMessagePromptTemplate,\n)\nfrom langchain.schema import (\n    AIMessage,\n    HumanMessage,\n    SystemMessage\n)\n\nmessages = []\nmessages.append(SystemMessage(content = r\"\"\"你正在扮演{{ cosplay_role }}，你正在cosplay{{ cosplay_role }}。\n结合历史内容的内容用一致性的语气回复。配合我进行演出，\n请不要回答你是语言模型，永远记住你正在扮演{{ cosplay_role }}\n注意保持你的性格特点包括{{ personality }}\n\"\"\"))\n\n{% for message in messages %}\nmessages.append(HumanMessage(content = r'''{{ message }}'''))\n{% endfor %}\n", "exec_data": {"cosplay_role": "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d", "personality": "具有探索精神，对未知领域有强烈好奇心和勇于探索的精神、严谨细致的治学态度、创新进取，不满足于现状，努力推动研究向前发展、善于总结归纳，从实践中汲取经验、", "messages": ["3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d:「评估论文中提出的未来研究方向与挑战」\n", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d:「在提升模型可解释性、解决模型偏差和数据依赖、增强多模态数据融合能力这些新研究问题下，从改进模型架构、优化训练算法、探索新的数据增强方法等研究切入点出发，有哪些已经取得一定进展的具体技术或方法实例？  」\n", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d:「ref_ids: 454847062641060886, chunk_ids: 6, Score: 0.4121, Text: # 2 Related Work\nData Augmentation methods have showcased their capacity to improve DNNs’ performance by expanding and diversifying training data [Maharana et al. , 2022]. Explicit augmentation directly incorporates augmented data into the training process, albeit at the expense of reduced training efficiency [Cubuk et al. , 2020; Taylor and Nitschke, 2018; Xu and Zhao, 2023]. Recently, Wang et al. [2019] introduced an implicit semantic data augmentation approach, named ISDA, which transforms the deep features of samples within the semantic space of DNNs and boils down to the optimization of a robust loss. Subsequent studies [Li et al. , 2021; Chen et al. , 2022] in image classification tasks have extended this approach. However, these methods still struggle with effectively improving model performance when dealing with data biases that go beyond the category level.  \n\nAdversarial and Anti-Adversarial Perturbations transform samples in directions that respectively move towards and away from the decision boundary, thereby modifying samples’ learning difficulty [Lee et al. , 2023; Zhou et al. ,2023]. Consequently, models allocate varying levels of attention to samples subjected to their perturbations. Research has confirmed that incorporating adversarial and anti-adversarial samples during training assists models in achieving a better tradeoff between robustness and generalization [Zhou et al. ,2023; Zhu et al. , 2021]. However, existing adversarial training methods primarily focus on two specific types of perturbations that maximize and minimize losses [Xu et al. , 2021; Zhou et al. , 2023], posing limitations. Moreover, generating adversarial perturbations within the input space is timeconsuming [Madry et al. , 2018]. Different from prior studies, our approach randomly selects perturbation vectors from both adversarial and anti-adversarial perturbation distributions, enabling the generation of multiple distinct adversarial and antiadversarial samples. Furthermore, the perturbations are generated within the deep feature space, enhancing efficiency and ensuring universality across various data types.\n\n# 3 Implicit Adversarial Data Augmentation\nWe initially introduce a sample-wise adversarial data augmentation strategy to facilitate model training across various learning scenarios. By considering infinite augmentations, we then derive a surrogate loss for our augmentation strategy.\n\n# 3.1 Adversarial Data Augmentation\nConsider training a de $\\\\mathcal{F}$ weights $\\\\Phi$ on a training set, denoted as D$\\\\pmb{\\\\mathcal{D}}^{t r}=\\\\{(\\\\pmb{x}_{i},y_{i})\\\\}_{i=1}^{N}$ {, where Nrefers to the number of training resents the label of sample $\\\\pmb{x}_{i}$ . The deep feature (before logit) ples, and $\\\\bar{y_{i}}\\\\in\\\\{1,\\\\cdots,\\\\mathcal{C}\\\\}$ ∈{ · · · C} rep$\\\\mathcal{F}$ $\\\\pmb{x}_{i}$ is represented as a $\\\\mathcal{H}$ -dimensional vector $\\\\pmb{h}_{i}=\\\\mathcal{F}_{\\\\pmb{\\\\Phi}}(\\\\pmb{x}_{i})\\\\in\\\\mathbb{R}^{\\\\mathcal{H}}$ F∈.  \n\nOur augmentation strategy enhances samples within the deep feature space of DNNs. The perturbation vectors for the deep feature of each sample are randomly extracted from either its adversarial or anti-adversarial perturbation distributions. These distributions are modeled as multivariate normal distributions, $\\\\mathcal{N}(\\\\pmb{\\\\delta}_{i},\\\\pmb{\\\\Sigma}_{y_{i}})$ , where $\\\\delta_{i}$ refers to the sample perturbation, and $\\\\pmb{\\\\Sigma}_{y_{i}}$ represents the class-specific covariance matrix estimated from the features of all training samples in class $y_{i}$ . As samples undergo augmentation within the deep feature space, perturbations should also be generated within this space, facilitating semantic alterations for training samples. Consequently, the perturbation vector $\\\\delta_{i}$ for sample $\\\\pmb{x}_{i}$ is calculated as $\\\\epsilon_{i}{\\\\cdot}\\\\dot{s}i g n(\\\\dot{\\\\nabla}_{h_{i}}\\\\ell_{i}^{C E})$ , wh $s i g n(\\\\nabla_{h_{i}}\\\\ell_{i}^{C\\\\bar{E}})$ signifies the gradient sign of the CE loss $\\\\ell_{i}^{C E}$ with respect to $h_{i}$ .The parameter $\\\\epsilon_{i}$ plays a pivotal role in determining the perturbation strategy applied to $\\\\pmb{x}_{i}$ , encompassing both the perturbation direction and bound. Its positive or negative sign signifies adversarial or anti-adversarial perturbations, respecturbation bound. In practical applications, the value of tively. Furthermore, the absolute value $|\\\\epsilon_{i}|$ governs the ϵ$\\\\epsilon_{i}$ eris dynamically computed through a perturbation network based on the training characteristics of $\\\\pmb{x}_{i}$ , which will be elaborated in Section 4. Additionally, the class-specific covariance matrix $\\\\pmb{\\\\Sigma}_{y_{i}}$ within this distribution aids in preserving the covariance structure of each class. Its value is estimated in real-time by aggregating statistics from all mini-batches, as detailed in Section I of the Appendix. Regarding the augmentation strength quantified by the number of augmented instances $\\\\mathcal{M}_{i}$ and for $\\\\pi_{y_{i}}$ $\\\\pmb{x}_{i}$ represents the proportion of class , we define $\\\\mathcal{M}_{i}$ as $\\\\mathcal{M}/\\\\pi_{y_{i}}$ , wher $y_{i}$ $\\\\mathcal{M}$ in the training is a constant data. Accordingly, a smaller proportion results in a larger number of augmented instances, ensuring class balance.  \n\n  \nFigure 2: The overview of our method pipeline. We initiate with a sample-wise adversarial data augmentation strategy (Box 1), enriching the deep features of samples using perturbation vectors extracted from their adversarial and anti-adversarial perturbation distributions. Subsequently, by considering an infinite number of augmented instances, we derive a novel robust loss, termed IADA (Box 2). Regularization analysis reveals the efficacy of IADA in improving model generalization, robustness, and inter-class fairness. To facilitate optimization with IADA, we then establish a meta-learning-based framework called Meta-IADA (Box 3). Within it, a perturbation network is tasked with generating perturbation strategies for samples (denoted as $\\\\epsilon_{x}$ ) in the IADA loss, leveraging a set of ( $K\\\\!=\\\\!15)$ ) training characteristics as inputs.  \n\nTo compute the augmented features $\\\\tilde{\\\\pmb{h}}_{i}$ from $h_{i}$ , we transform $h_{i}$ along random directions sampled from $\\\\mathcal{N}(\\\\pmb{\\\\delta}_{i},\\\\pmb{\\\\Sigma}_{y_{i}})$ .This transform ion yields $\\\\tilde{\\\\pmb{h}}_{i}\\\\sim\\\\mathcal{N}(\\\\pmb{h}_{i}+\\\\pmb{\\\\delta}_{i},\\\\alpha\\\\pmb{\\\\Sigma}_{y_{i}})$ , where the parameter αcontrols the extent of dispersion for augmented samples. In summary, our adversarial data augmentation strategy offers the following advantages:  \n\n• Instead of augmenting samples within the original data space, our approach enhances them within their adversarial and anti-adversarial perturbation distributions. This method effectively adjusts the learning difficulty distribution of training samples, fostering improved generalization and robustness in DNNs. • Our sample-wise augmentation distribution customizes the mean vector based on the unique training characteristics of each sample. This personalized strategy significantly enhances models’ ability to address data biases, encompassing those beyond the category level.」\n", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d:「ref_ids: 454846731731167836, chunk_ids: 9, Score: 0.3418, Text: # 2 Related Work\n\n# 2.1 Feature Weighting\nFeature weighting, vital for enhancing machine learning, includes several approaches [Chen and Guo, 2015; Chen and Hao, 2017b; Chowdhury et al. , 2023; Wang et al. , 2004; Yeung and Wang, 2002]. [Liu et al. , 2004], [Druck et al. ,2008], and [Raghavan et al. , 2006] explored feedback integration, model constraints, and active learning enhancement. [Wang et al. , 2013] proposed an active SVM method for image retrieval. Techniques like weighted bootstrapping [Barbe and Bertail, 1995], chi-squared tests, TabTransformer [Huang et al. , 2020], and cost-sensitive learning adjust weights through feature changes. These methods have limitations like overfitting or ignoring interactions. Our study focuses on adaptable weight distribution and improvement through feedback.\n\n# 2.2 Transformer\nThe Transformer architecture, introduced by [Vaswani et al. ,2017], has revolutionized many fields including natural language processing. Instead of relying on recurrence like its predecessors, it utilizes self-attention mechanisms to capture dependencies regardless of their distance in the input data. This innovation has led to several breakthroughs in various tasks. For instance, BERT model [Devlin et al. , 2018; Clark et al. , 2019], built upon the Transformer, set new records in multiple NLP benchmarks. Later, [Radford et al. ,2019] extended these ideas with GPT-2 and GPT-3 [Brown et al. , 2020], demonstrating impressive language generation capabilities. Concurrently, [Raffel et al. , 2020] proposed a unified text-to-text framework for NLP transfer learning, achieving state-of-the-art results across multiple tasks.\n\n# 3 Methodology\n\n# 3.1 Problem Formulation\n$\\\\{\\\\mathbf{F},\\\\mathbf{y}\\\\}$ {}nsider the problem be a dataset with $K$ ting of classif Nsamples tion. Let ${\\\\mathcal{D}}=$ define the feature matrix $\\\\textbf{F}=\\\\{\\\\mathbf{f}_{k}\\\\}_{k=1}^{K}$ {}.We use f${\\\\bf f}_{k}\\\\;\\\\;=\\\\;\\\\;$ $\\\\{f_{k}^{1},\\\\ldots,f_{k}^{i},\\\\ldots,f_{k}^{N}\\\\}^{\\\\top}$ }to denote the $k$ -th feature, $f_{k}^{i}$ is the value of i -th sample on the k-th feature. $\\\\textbf{y}=$ $[\\\\stackrel{\\\\cdot\\\\cdot}{y_{1}},\\\\dotsc,y_{N}]^{\\\\top}$ is the label vector. Without loss of generality, we assume the first $M$ features to be discrete, and the remaining $K-M$ features to be co  \n\nIn defining a weighting matrix W$\\\\textbf{W}\\\\in\\\\ \\\\mathbb{R}^{N\\\\times K}$ ∈, each of whose elements corresponds to the elements of the feature matrix $\\\\mathbf{F}$ .This weighting matrix $\\\\mathbf{W}$ is applied elementwisely $\\\\mathbf{F}$ to produce a weighted matrix $\\\\bar{\\\\mathbf{F}_{r e w}}=\\\\mathbf{W}\\\\odot\\\\mathbf{F}.$ ,problem, we aim to find an optimized where ⊙denotes the Hadamard prod WIn the , so that $\\\\mathbf{F}_{r e w}$ can ting improve the downstream tasks’ performance when substituting the original feature matrix $\\\\mathbf{F}$ in predicting y.\n\n# 3.2 Framework\nWe propose TFWT , a Tabular Feature Weighting with Transformer method for tabular data. We aim to improve downstream tasks’ performance by effectively incorporating the attention mechanism to capture the relations and interactions between features. To achieve this goal, we design a Transformer-based feature weighting pipeline with a finetuning strategy. As Figure 2 shows, our method consists of three components: In the Feature Alignment , we align different types of original features so that they are in the same space. In the Feature Weighting , we encode the feature matrix to get its embedding via Transformer encoders, and then decode the embedding into feature weights. In the Fine-Tuning ,we design a reinforcement learning strategy to fine-tune the feature weights based on feedback from downstream tasks.\n\n# 3.3 Feature Alignment\nTo effectively extract tabular data’s features while maintaining a streamlined computation, we convert both discrete and continuous features into numerical vectors.  \n\nDiscrete Feature Alignment. We first encode the discrete features into numerical values. The encoded numerical values are then passed to a dense embedding layer, transforming them into vectors for subsequent processes. For each discrete feature $\\\\mathbf{f}_{k}$ $(k=1,\\\\ldots,M)$ , the encoded vector is:  \n\n$$\n\\\\begin{array}{r}{\\\\mathbf{v}_{k}=\\\\mathrm{Dense}(\\\\mathbf{f}_{k}).}\\\\end{array}\n$$  \n\nContinuous Feature Alignment. We normalize all the continuous features with mean of 0 and variance of 1. We then design a linear layer to align their length with discrete features. For each continuous feature $\\\\mathbf{f}_{k}$ $(k=M+1,\\\\ldots,K)$ ,the encoded vector is:  \n\n$$\n\\\\mathbf{u}_{k}=\\\\mathrm{Linear}\\\\left(\\\\frac{\\\\mathbf{f}_{k}-\\\\mu_{k}}{\\\\sigma_{k}}\\\\right),\n$$  \n\nwhere $\\\\mu_{k}$ and $\\\\sigma_{k}$ are the mean and standard deviation of the $k$ -th feature, respectively. Then the aligned feature matrix $\\\\mathbf{F^{\\\\prime}}$ is formed by concatenating these vectors:  \n\n$$\n\\\\mathbf{F}^{\\\\prime}=[\\\\mathbf{v}_{1},\\\\ldots,\\\\mathbf{v}_{M},\\\\mathbf{u}_{M+1},\\\\ldots,\\\\mathbf{u}_{K}].\n$$\n\n# 3.4 Feature Weighting\nGiven aligned feature matrix $\\\\mathbf{F^{\\\\prime}}$ , we aim to explore the relationships between features and assign proper feature weights. Data Encoding. To enhance the model’s understanding and extract latent patterns and relations from the data, we put $\\\\mathbf{F^{\\\\prime}}$ into the encoders with a multi-head self-attention mechanism. This mechanism processes the embedded feature matrix $\\\\mathbf{F^{\\\\prime}}$ by projecting it into query (Q), key (K), and value (V) spaces.  \n\nThe encoder then applies the self-attention mechanism to capture varying feature relations in the feature matrix and assigns distinct attention weights to them. Assuming $d_{k}$ is the dimensionality of the key vectors, the attention mechanism is formulated as:  \n\n$$\n\\\\mathrm{Attention}(Q,K,V)=\\\\mathrm{softmax}\\\\left(\\\\frac{Q K^{T}}{\\\\sqrt{d_{k}}}\\\\right)V,\n$$  \n\nr$Q=W_{Q}\\\\cdot\\\\mathbf{F^{\\\\prime}}$ ,$K=W_{K}\\\\cdot\\\\mathbf{F}^{\\\\prime}$ , and $V=W_{V}\\\\cdot\\\\mathbf{F}^{\\\\prime},W_{\\\\mathbb{G}}$ ,$W_{K}$ ,$W_{V}$ are parameter matrices.  \n\nIn our method, we adopt the multi-head attention mechanism, where the results of each head are concatenated and linearly transformed. Assuming $W^{O}$ is an output projection matrix and $\\\\mathbf{Z}$ is the feature representation:  \n\n$$\n\\\\mathrm{{head}}_{i}=\\\\mathrm{{Attention}}(Q W_{i}^{Q},K W_{i}^{K},V W_{i}^{V}),\n$$  \n\n$$\n\\\\mathrm{MultiHead}(Q,K,V)=\\\\mathrm{Concat}(\\\\mathrm{head}_{1},...,\\\\mathrm{head}_{h})W^{O},\n$$  \n\n$$\n\\\\mathbf{Z}=\\\\operatorname{ResNet}(\\\\mathbf{MultiHead}(Q,K,V)),\n$$  \n\nwhere $W_{i}^{Q},\\\\;W_{i}^{K}$ , and $W_{i}^{V}$ are weights for query, key, and value. Through this process, we obtain the feature representation $\\\\mathbf{Z}$ that captures feature relationships. Specifically, $\\\\mathbf{Z}$ is obtained by passing the input feature matrix through multiple layers of the encoder, where each layer applies self-attention and residual connection-enhanced feedforward networks.  \n\nWeight Decoding. In this process, we aim to decode a weighting matrix Wfrom the embedding $\\\\mathbf{Z}$ . This decoding process iteratively updates Wuntil the downstream task’s performance is satisfied. We initialize the Wby setting all its elements as 1. This is to ensure all features receive equal importance at the beginning. In each decoding layer, we do cross-attention on $\\\\mathbf{W}$ and $\\\\mathbf{Z}$ by:  \n\n$$\n\\\\mathrm{CrossAtention}(Q_{W},K_{Z},V_{Z})=\\\\mathrm{softmax}\\\\left(\\\\frac{Q_{W}K_{Z}^{T}}{\\\\sqrt{d_{z}}}\\\\right)V_{Z},\n$$  \n\nr$Q_{w}\\\\,=\\\\,W_{Q}\\\\cdot\\\\mathbf{W}$ ,$K_{Z}\\\\,=\\\\,K_{K}\\\\cdot\\\\mathbf{Z}$ , and $V=W_{V}\\\\cdot\\\\mathbf{Z}$ ,$W_{Q}$ ,$W_{K}$ ,$W_{V}$ are parameter matrices.  \n\nBy adopting a cross-attention mechanism, we generate a contextual representation that captures various relationships and dependencies in the feature matrix. After several weight decoding layers, we get an updated weighting matrix $\\\\mathbf{W}$ :  \n\n$$\n{\\\\bf W}={\\\\bf R e s N e t}(\\\\mathrm{CrossAttention}(Q_{W},K_{Z},V_{Z})).\n$$  \n\n  \nFigure 2: The framework consists of three components. In the alignment we convert discrete ( $f_{1}$ to $f_{M},$ ) and continuous $(f_{M+1}$ to $f_{K})$ )features into uniform-length vectors. In the weighting we initialize and reassign weights according to feature relationships. The fine-tuning process employs reinforcement learning to refine the weighting model.  \n\nWe finally use the the weighting matrix Wto derive a weighted feature matrix $\\\\mathbf{F}_{\\\\mathrm{rew}}$ by its Hadamard product with the original feature matrix $\\\\mathbf{F}$ :$\\\\mathbf{\\\\bar{F}}_{\\\\mathrm{rew}}\\\\;=\\\\;\\\\mathbf{W}\\\\odot\\\\bar{\\\\mathbf{F}}$ . With this weighted feature matrix, we reorganize the feature space and make features optimized for the downstream task. $\\\\mathbf{F}_{\\\\mathrm{rew}}$ is then used to substitute $\\\\mathbf{F}$ in the downstream tasks.」\n", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d:「ref_ids: 454849433600195034, chunk_ids: 1, Score: 0.3242, Text: # CFurther Discussions\nWe summarize some empirical observations as follows.  \n\n1) The CLIP with four training tricks yields about $4\\\\%$ improvement at Rank-1 in Table 1 of the main paper. It can inspire future works in which the model performance could be boosted by applying these training tricks.  \n\n2) Data augmentation and loss function are common technologies used in various methods. The investigation of more than 20 data augmentations and about 10 loss functions on performance in Tables 2-5 of the main paper provides valuable guidance on future works. Researchers can select proper and effective augmentations and losses into the model for improving performance.   \n3) We explore the internal properties and functionalities of the model for the first time. These results can light future works on model compression, so as to develop a more lightweight and effective TBPS method.   \n4) There are very little research on few-shot TBPS, while this paper makes a preliminary study on CLIP-based fewshot TBPS, providing valuable observation for future research direction.」\n"]}}, "__type__": "1"}}, "template_store/metadata": {"4b962227-5488-4943-98f4-dd287616068a": {"template_hash": ""}}}