{"analysis_store/data": {"43577d46-8c30-4c8a-a774-477deb0535da": {"__data__": {"id_": "43577d46-8c30-4c8a-a774-477deb0535da", "metadata": {}, "relationships": {}, "hash": "", "story_scenario_context": "### 第一步：提取关键信息\n1. **研究方向相关**：社交媒体中的爱情表现、卢曼爱情语义学在电视电影中的应用、深入研究卢曼理论及其在社会学研究中的潜在应用、探讨卢曼理论和社会学的交叉点。\n2. **关联关系相关**：研究与社会学研究情感因素密切相关、讨论与媒体语义信息有关、卢曼爱情语义学与社交媒体内容密切相联、卢曼理论与社交媒体中爱情表现的接近度、卢曼爱情语义学与社会学观点相交、社交媒体中爱情表现与卢曼理论存在重叠。\n\n### 第二步：总结突出特点\n1. **研究建议多元**：涉及社交媒体爱情表现、影视应用以及理论在社会学研究应用等多方面研究建议。\n2. **强调关联**：突出卢曼爱情语义学与社交媒体内容、社会学研究之间的紧密关联，以及研究与情感因素、媒体语义信息的相关性 。  ", "scene_monologue_context": "今天我深入研究了计算模型相关的学术内容。先是围绕计算模型在不同数据集与应用场景下的适用性与泛化能力展开探讨，尤其关注多领域、多模态数据融合现实场景中，如何提升计算模型泛化能力，应对多模态数据的异质性和复杂性，实现更高效的特征提取与融合。\n\n在阅读相关文献时，了解到领域泛化（DG）和适应（DA）对提高机器学习模型的稳健性和适应性意义重大，众多DG和DA算法被提出，但大多针对单模态数据。随着现实应用中处理多模态数据需求的增加，扩展这些方法以支持跨多种模态的多模态DG变得十分迫切。同时，还接触到多模态开放集领域泛化（MM - OSDG）这一概念，它旨在训练一个能有效泛化到包含未知类样本的新目标领域的模型，而当前单模态开放集DG方法在这方面存在不足。\n\n另外，还学习了相关工作部分，了解到当前最先进的DG方法大致可分为特征对齐、特征解缠、数据/特征增强、元学习四类，每种方法都有其优势与局限。数据混合方面，不同的数据混合方法各有特点，而文中提出的CDM方法有其独特之处。在跨域不变性方面，传统方法和新方法各有优劣，文中提出的MiRe模型通过特征聚合和消息传递对不同语义锚的图形结构进行建模。\n\n此外，还涉及多视图聚类（MVC）相关内容。传统多视图聚类方法存在直接处理含噪声和冗余信息特征的问题，深度聚类方法虽有改进但仍存在一些不足，如难以获得有判别力的共识表示，对比学习中的正负对区分可能与聚类目标冲突等。文中提出的新型多视图表示学习框架（GCFAggMVC），有望缓解这些问题，它通过学习视图特定表示、设计全局和跨视图特征聚合模块以及利用对比学习建立一致性等方式，充分挖掘相似样本的互补性，在完整和不完整多视图聚类任务中都展现出良好性能。  ", "user_id": "此来访者", "scene_content": "角色    内容    分镜\n", "story_board_summary_context": "02c99ed3-dc6a-4b2d-bbff-109a51351344:「探讨计算模型在不同数据集与应用场景下的适用性与泛化能力」\n02c99ed3-dc6a-4b2d-bbff-109a51351344:「在多领域、多模态数据融合的现实应用场景下，为提升计算模型的泛化能力，有哪些具体方法可以有效应对多模态数据的异质性和复杂性，以实现更高效的特征提取与融合？  」\n02c99ed3-dc6a-4b2d-bbff-109a51351344:「ref_ids: 454984266138264960, chunk_ids: 2, Score: 0.5273, Text: # 1 Introduction\nDomain generalization (DG) and adaptation (DA) significantly improve the robustness and adaptability of machine learning models, enabling them to perform effectively across diverse and previously unseen environments [ 61 ]. This enhancement ensures that the models are more readily transferable to real-world applications, such as autonomous driving [ 13 ,15 ] and action recognition [ 10 ]. To address the challenges posed by distribution shifts, a wide range of DG and DA algorithms have been introduced. These algorithms include domain-invariant feature learning [ 46 ], feature disentanglement [ 52 ], data augmentation [ 64 ], and meta-learning [ 37 ]. However, the majority of these algorithms are designed for unimodal data, such as images [ 36 ] or time series data [ 44 ]. With the increasing need to process multimodal data in real-world applications [ 5 ,10 ], it has become imperative to extend these methods to support multimodal DG across a variety of modalities, including audio-video [ 31 ,65 ] and vision-language [ 29 ,54 ]. In response to this challenge, several approaches, such as RNA-Net [ 53 ] and SimMMDG [ 14 ], have been proposed to address the complexities of multimodal DG.  \n\nTable 1: Illustration of the difference between the proposed Multimodal Open-Set DG and DA and other related tasks. $\\\\mathcal{D}_{t}$ denote the target domains. $C_{s}$ and $\\\\boldsymbol{c}_{t}$ denote the label space of source and target domains, respectively.   \n\n\n<html><body><table><tr><td>Task</td><td></td><td>Only one modality?Need C。=Ct?Access to Dt?</td><td></td></tr><tr><td>DomainAdaptation [18]</td><td></td><td></td><td></td></tr><tr><td>Domain Generalization[6]</td><td></td><td></td><td></td></tr><tr><td>Open-Set Domain Adaptation[41]</td><td></td><td></td><td></td></tr><tr><td>Open-SetDomain Generalization[57]</td><td></td><td>X</td><td></td></tr><tr><td>Multimodal Domain Adaptation [47]</td><td>×</td><td></td><td></td></tr><tr><td>MultimodalDomain Generalization14]</td><td></td><td></td><td></td></tr><tr><td>Multimodal Open-Set Domain Adaptation 1 (proposed)</td><td></td><td>X</td><td></td></tr><tr><td>Multimodal 1Open-SetDomain Generalization (proposed)</td><td>×</td><td></td><td></td></tr></table></body></html>  \n\nAn inherent assumption in both DG and multimodal DG is the alignment of label spaces between source and target domains. However, real-world applications, such as autonomous driving [ 3 ], often feature target domains with novel categories not present in the source label space. As a result, the learned model may struggle with samples from these novel categories, significantly degrading the robustness of existing DG and multimodal DG methods. This setup, where the target domain contains unknown or open classes not seen in source domains, is referred to as open-set DG. Several unimodal open-set DG approaches, including DAML [ 57 ] and MEDIC [ 62 ], have been developed within the meta-learning framework to tackle this issue. CrossMatch [ 67 ] utilizes an adversarial data augmentation strategy to generate auxiliary samples beyond the source label space. Yet, none specifically address the challenge of Multimodal Open-Set DG (MMOSDG), which is the primary focus of this paper. The goal of MM-OSDG is to train a model using data from several source domains across two or more modalities, enabling it to effectively generalize to previously unseen target domains with the same modalities and including samples from unknown classes. The key challenge of MM-OSDG is to efficiently leverage complementary information from diverse modalities to improve generalization and open-class detection performance, areas where current unimodal open-set DG approaches fall short. We summarize the distinctions between our proposed MM-OSDG problem and various related problems in Tab. 1 .  \n\nTo address the challenge of domain shift in unimodal setups, several studies have explored the integration of self-supervision techniques for DG and DA [ 4 ,6 ]. This approach involves addressing a self-supervised pretext task concurrently with the primary supervised problem, which leads to the learning of resilient cross-domain features conducive to robust generalization. Additionally, recent research has demonstrated the utility of leveraging outputs from self-supervised models for anomaly detection, facilitating the discrimination between normal and anomalous samples [ 2 ,21 ] – a scenario similar to open-class detection. In particular, Rotation-based Open Set (ROS) [ 4 ] explores rotation recognition as a self-supervised task for both unknown class detection and domain adaptation. Meanwhile, results from MOOD [ 39 ] illustrate that a reconstruction-based pretext task forces the network to learn the real data distribution of the indistribution (ID) samples, thereby enlarging the divergence between the out-ofdistribution (OOD) and ID samples.  \n\nInspired by the success of the self-supervised pretext tasks in robust feature learning and OOD sample detection in unimodal setups, we propose a novel approach referred to as MOOSA to address the Multim odal OpenSet Domain Generalization and A daptation problems using multimodal self-supervised tasks. Specifically, we propose a generative task, termed Masked Cross-modal Translation, and a contrastive task, denoted as Multimodal Jigsaw Puzzles. These tasks are complementary to each other to effectively learn multimodal representative features conducive to both generalization and open-class detection. An entropy weighting mechanism is further introduced to balance the loss across different modalities. Additionally, our methodology is extended to handle the Multimodal Open-Set Domain Adaptation (MM-OSDA) problem in scenarios where unlabeled target data is available. The efficacy of the proposed approach is thoroughly validated through extensive experiments conducted on two multimodal DG benchmark datasets: EPIC-Kitchens [ 10 ] and Human-AnimalCartoon (HAC) [ 14 ]. Our contributions can be summarized as follows:  \n\n–We delve into the unexplored area of Multimodal Open-Set Domain Generalization, a concept with significant implications for real-world applications. It requires a model trained on diverse source domains to generalize effectively to new, unseen target domains, which share the same modalities but include samples from previously unknown classes.  \n\n–To tackle MM-OSDG, we introduce two complementary multimodal selfsupervised tasks – Masked Cross-modal Translation and Multimodal Jigsaw Puzzles – along with an entropy weighting mechanism. We also extend our method to the novel Multimodal Open-Set Domain Adaptation setup.  \n\n–The efficacy and versatility of our proposed approach are validated through extensive experiments conducted across MM-OSDG, MM-OSDA, and Multimodal Closed-Set DG settings.」\n02c99ed3-dc6a-4b2d-bbff-109a51351344:「ref_ids: 454846353205433616, chunk_ids: 1, Score: 0.3379, Text: # 2 Related Work\nDomain Generalization. Generalizing a well-trained model to novel environments with different data distributions is a challenging and long-standing machine learning problem [ 81 ,69 ]. Current state-of-the-art DG approaches can be roughly categorized into four types. (1) Feature Alignment. Bridging the domain gap through statistic matching and adversarial learning [ 38 ,36 ,45 ] provides invariant representations, which are expected to be shared by novel domains. A major defect is that the learned representations is prone to mix common and domain-specific components, potentially resulting in strong bias towards spurious relations. (2) Feature Disentanglement. To address the above issue, disentangling latent feature into two disjoint parts has attract a great surge of interest. Prevailing approaches [ 54 ,53 ,16 ,44 ,61 ,40 ] resort to causal graphs [ 50 ] to explicitly identify causal and non-causal factors with theoretical guarantees. If this could be perfectly achieved, learned models will generalize well under any circumstances. However, these theoretical results require strong assumptions, e.g., the degree of diversity between causal and non-causal factors and the presence of an estimated causal graph [ 62 ], or a priori knowledge about the combinations of latent factors, e.g., distribution of values for a certain attribute. The complex combinations of many realworld cases ( e.g., DomainNet [ 52 ]) greatly impede the practical uses. In that sense, a principled disentanglement solution is hard to be reached. (3) Data/Feature Augmentation. A simple yet effective approach is to augment the diversity of data or feature so as to avoid overfitting to training data [ 67 ,75 ,48 ,84 ,74 ,8 ,78 ,13 ]. Among them, learning and imposing heuristic style transmission strategies take the dominant positions, while explicitly separating and recombination images remain the boundary to explore. (4) Meta-Learning. Some of recent works [ 33 ,39 ,34 ,17 ,41 ,14 ] simulate the distribution shifts between seen and unseen environments by using meta-learning [ 21 ], which splits the training data into meta-train and meta-test domains.  \n\nDespite a proliferation of DG approaches, Wiles et al. [71 ] reveal that the best DG methods are not consistent over different shifts and datasets in which disentangling offers limited improvements in most real-world scenarios. In addition, Gulrajani and Lopez-Paz [ 23 ] cast doubt on the progress that have been made by comparing to a standard empirical risk minimization baseline, showing that conventional domain-invariant methods [ 60 ,22 ] exhibit robust improvements. In this work, we embrace the strengths of cross-domain invariance by considering a more fine-grained and stable property— structural invariance —which is evaluated on a number of challenging benchmarks.  \n\nData Mixing. Mixing data, such as Mixup [ 77 ,66 ] and its various variants, has shown compelling results in standard supervised and semi-supervised learning. Mixup operations aim to conduct data interpolation via convex combinations of pairs of images and their labels. Instead, our CDM generates diverse training samples by replacing the background of a certain image with a randomly cropped patch from other images but keeps its object label fixed. CutMix [ 76 ] replaces a regularly-shaped image region with a patch from another training image and proportionally mix their ground-truth labels. CutPaste [ 31 ] cuts an image patch and randomly pastes it at an another image. BackErase [ 56 ]uses the object annotations to copy and pastes foreground objects on a background image. Compared to the aforementioned methods that cut a regularly-shaped image patch [ 76 ,31 ] or rely on ground-truth object labels [ 56 ], the proposed CDM simultaneously leverage the category and domain information to derive an irregularly-shaped foreground regions while avoiding fine-grained annotations.  \n\nCross-Domain Invariance. Seeking cross-domain invariance is crucial for out-of-distribution generalization problems, such as Unsupervised Domain Adaptation (UDA) [ 49 ] and DG. Traditional methods typically resort to statistical distribution divergence, such as maximum mean discrepancy [ 43 ] and second-order moment [ 60 ], for measuring domain-wise distribution shifts. More recently, a promising approach is to utilize the concept of class prototype for enforcing semantic consistency across domains [ 73 ,12 ,10 ]. This line of research has also been extensively explored in various downstream tasks. However, we argue that no matter domain- or class-wise invariance cannot guarantee the generalizable representations especially when encountering unseen test environments.  \n\n  \nFigure 2: The pip e of e proposed MiRe . Assume that we have two domains $\\\\mathcal{D}_{1}$ and $\\\\mathcal{D}_{2}$ , CDM augments them to performs feature aggregation based on the semantic topology in previous iteration and their local D$\\\\mathcal{D}_{1}^{\\\\prime}$ and D$\\\\mathcal{D}_{2}^{\\\\prime}$ . In each iteration of ASTR, the embedding feature of each local instance adjacent relations ( step 1 ). Then, global anchor features are updated based on the aggregated local features ( step 2 ). Finally, a bipartite graph learning procedure is imposed on the top of semantic topology to perform between-domain relational reasoning and induce structural invariance ( step 3 ).  \n\nSuch an invariance may be susceptible to include some misleading spurious correlation, such as wrongly associating an foreground object with specific background. The justification is that the topological structure of these prototypes is unexplored, making them being sensitive to the change of environments [ 44 ,9 ,79 ]. By contrast, the proposed MiRe models the graphical structures of different semantic anchors by means of feature aggregation and message-passing.」\n02c99ed3-dc6a-4b2d-bbff-109a51351344:「ref_ids: 454848837592725570, chunk_ids: 1, Score: 0.2266, Text: # 1. Introduction\nWith the rapid development of informatization, data is often collected by various social media or views. For instance, a 3D object can be described from different angles; a news event is reported from different sources; and an image can be characterized by different types of feature sets, e.g., SIFT, LBP, and HoG. Such an instance object, which is described from multiple views, is referred to as multi-view data. Multi-view clustering (MVC) [ 6 ], i.e., unsupervisedly fusing the multi-view data to aid differentiate crucial grouping, is a fundamental task in the fields of data mining, pattern recognition, etc, but it remains a challenging problem.  \n\nTraditional multi-view clustering methods [ 7 ] include matrix decomposition methods, graph-based multi-view methods, and subspace-based multi-view methods. The goal of these methods is to obtain a high-quality consensus graph or subspace self-representation matrix by various regularization constraints in order to improve the performance of clustering. However, most of them directly operate on the original multiview features or specified kernel features, which usually include noises and redundancy information during the collection or kernel space selection processes, moreover harmful to the clustering tasks.  \n\nDeep neural networks have demonstrated excellent performance in data feature representation for many vision tasks. Deep clustering methods also draw more attention to researchers [ 1 ,9 ,40 ,50 –52 ]. These methods efficiently learn the feature presentation of each view using a viewspecific encoder network, and fuse these learnt representations from all views to obtain a consensus representation that can be divided into different categories by a clustering module. To reduce the influence of view-private information on clustering, these methods designed different alignment models. For example, some methods align the representation distributions or label distributions from different views by KL divergence [ 14 ]. They might be hard to distinguish between clusters, since a category from one view might be aligned with a different category in another view. Some methods align the representation from different views by contrastive learning. Despite these models have achieved significant improvement in MVC task, the following issues still exist: 1) Almost all existing deep MVC methods (such as [ 38 ,40 ,49 ]) are based on view-wise fusion models, such as weighted-sum fusion of all views or concatenating fusion of all views, which makes it difficult to obtain discriminative consensus representations from multiple views, since a view or several views of a sample might contain too much noise or be missing in the collection process. 2) These alignment methods (such as [ 38 ,51 ]) based on contrastive learning usually distinguish the positive pair and negative pair from the sample-level. That is, they make inter-view presentations from the same sample as positive pair, and makes view representations from different samples as negative pair (including view representations from different samples in the same cluster), whereas it might be conflict with the clustering objective, where these representations of samples from the same cluster should be similar to each other.  \n\nIn the paper, a novel multi-view representation learning framework for clustering is proposed to alleviate the above problems. Motivated by the insight that the representations of samples from the same category are typically similar, we can learn consensus data representation from multiview data by other samples with a high structure relationship, moreover, in contrastive learning, we should increase the similarity of view representations from the same cluster, not only from the same sample, which is beneficial clustering tasks. To accomplish this, we first learn the view-specific representations to reconstruct the original data by leveraging the autoencoder model. Then, we design a global and cross-view feature aggregation module, which is capable of learning a global similarity relationship among samples, and obtaining a consensus representation based on the global similarity relationship of all samples. Furthermore, we leverage the learnt global structure relationship and consensus representation to establish the consistency with view-specific representations by contrastive learning, which minimizes the similarity between the representations with low structure relationship. Compared with previous work, our contributions are listed as follows:  \n\n• We propose a novel Global and Cross-view Feature Aggregation network framework for Multi-View Clustering (GCFAggMVC), which is able to fully explore the complementary of similar samples and addresses the problem of negative pairs from the different samples in the same cluster having low similarity score.  \n\n• Different from previous methods, we design a global and cross-view feature aggregation module, which integrates the transformer structure to learn the global structure relationship from different feature spaces, and then obtains the consensus representation based on the learnt global relationship, which fully exploits the complementary information of similar samples, thereby reduce the impact of noise and redundancy or sample missing among different views. Moreover, we align the consensus representation and the viewspecific representation by our global structure-guided contrastive learning module, which makes the representations of similar samples with highly structure relationship similarity.  \n\n• The proposed module is flexible multi-view data representation module, which can be also applied to incomplete multi-view data clustering tasks by plugging our module into the framework of other methods as the consensus representation of a sample with missing view data can be enhanced by these samples with high structure relationships. Experiments show that the proposed method achieves not only excellent performance in complete multi-view clustering tasks, but also works well in incomplete multi-view clustering tasks.」\n", "dreams_guidance_context": "### Step 1: 确定研究的关键问题和目标\n - **关键问题**：\n    - 在多领域、多模态数据融合场景下，如何提升计算模型泛化能力，应对多模态数据的异质性和复杂性以实现高效特征提取与融合？\n    - 如何解决多模态开放集领域泛化（MM - OSDG）问题，即利用多模态源域数据训练模型，使其有效泛化到含未知类样本的目标领域？\n    - 传统多视图聚类方法存在噪声和冗余信息影响，深度聚类方法在获取判别性共识表示和正负对区分上存在问题，如何改进？\n - **研究目标**：\n    - 提出有效方法应对多模态数据挑战，提升计算模型在多领域、多模态数据融合场景下的泛化能力。\n    - 针对MM - OSDG问题，提出新方法，利用多模态自监督任务学习有效特征，提升模型泛化和开放类检测性能，并扩展到多模态开放集领域适应（MM - OSDA）问题。\n    - 提出新型多视图表示学习框架（GCFAggMVC），解决多视图聚类中存在的问题，在完整和不完整多视图聚类任务中取得良好性能。\n\n### Step 2: 梳理算法和方法\n - **多模态开放集领域泛化与适应方法**：\n    - 提出MOOSA方法，包含生成任务Masked Cross-modal Translation和对比任务Multimodal Jigsaw Puzzles，通过这两个互补的多模态自监督任务学习有利于泛化和开放类检测的多模态代表性特征。\n    - 引入熵加权机制平衡不同模态的损失，并将方法扩展到处理有未标记目标数据的MM - OSDA问题。\n - **数据混合方法**：\n    - 文中提到多种数据混合方法，如Mixup、CutMix、CutPaste、BackErase等，而提出的CDM方法通过用其他图像随机裁剪的补丁替换某图像背景生成多样训练样本，同时保留对象标签，该方法能同时利用类别和领域信息获取不规则前景区域，且避免精细标注。\n - **跨域不变性方法**：\n    - 传统方法利用统计分布差异（如最大均值差异、二阶矩）测量域间分布变化，新方法利用类原型概念强制跨域语义一致。\n    - 提出的MiRe模型通过特征聚合和消息传递对不同语义锚的图形结构进行建模，以实现结构不变性。\n - **多视图聚类方法**：\n    - 传统多视图聚类方法包括矩阵分解、图基和子空间基方法，直接处理原始多视图特征或指定核特征，存在噪声和冗余问题。\n    - 深度聚类方法利用特定视图编码器网络学习各视图特征表示，通过不同对齐模型融合表示，但存在难以获得判别性共识表示以及对比学习正负对区分与聚类目标冲突的问题。\n    - 提出的GCFAggMVC框架，先利用自动编码器模型学习视图特定表示以重构原始数据，设计全局和跨视图特征聚合模块学习样本间全局相似关系并获得共识表示，再通过全局结构引导的对比学习模块使共识表示与视图特定表示建立一致性。\n\n### Step 3: 分析实验设计和结果\n - **多模态开放集领域泛化与适应实验**：\n    - **实验设计**：在两个多模态DG基准数据集EPIC - Kitchens和Human - AnimalCartoon (HAC) 上进行广泛实验，验证MOOSA方法在MM - OSDG、MM - OSDA和多模态封闭集DG设置下的有效性。\n    - **实验结果**：文中未详细提及具体实验数据，但表明该方法的有效性和通用性得到验证，说明提出的方法在多模态开放集领域泛化与适应任务中取得了较好效果。\n - **多视图聚类实验**：\n    - **实验设计**：未详细描述实验数据集和具体实验设置，但提到将提出的GCFAggMVC框架应用于完整和不完整多视图聚类任务。\n    - **实验结果**：该方法在完整多视图聚类任务中取得优异性能，在不完整多视图聚类任务中也表现良好，说明该框架能有效解决多视图聚类中存在的问题。\n\n### Step 4: 评估研究的局限性和未来方向\n - **局限性**：\n    - 在多模态开放集领域泛化与适应研究中，未提及当前研究的局限性。\n    - 在多视图聚类研究中，未明确指出所提方法的局限性。\n - **未来方向**：\n    - 在多模态开放集领域泛化与适应方面，未提出未来研究的建议或拓展方向。\n    - 在多视图聚类方面，未提及未来可能的研究方向。整体来看，两篇文献在局限性和未来方向阐述上相对不足，可进一步思考这些研究在实际应用场景中的潜在限制以及未来可探索的方向，以推动相关领域进一步发展 。  ", "evolutionary_step": "这段对话主要围绕计算模型在多领域、多模态数据融合场景下的适用性、泛化能力展开，涉及提升泛化能力的方法、多模态领域泛化与适应的相关研究，以及多视图聚类方法等内容，与计算机科学研究步骤中的算法和模型研究相关。具体总结如下：\n1. **研究计算模型在不同数据集与应用场景下的适用性与泛化能力**：探讨在多领域、多模态数据融合场景中，提升计算模型泛化能力的方法，以应对多模态数据的异质性和复杂性，实现高效特征提取与融合。\n2. **多模态领域泛化与适应的研究**\n    - **现有方法局限**：多数领域泛化（DG）和适应（DA）算法针对单模态数据，多模态DG中源和目标域标签空间对齐假设在现实应用中有问题，现有单模态开放集DG方法未解决多模态开放集DG（MM-OSDG）挑战。\n    - **提出新方法**：提出MOOSA方法，利用多模态自监督任务解决MM-OSDG和多模态开放集领域适应问题，包括生成任务“Masked Cross-modal Translation”和对比任务“Multimodal Jigsaw Puzzles”，引入熵加权机制平衡模态间损失，并扩展方法处理有未标记目标数据的情况，通过实验验证了方法的有效性和通用性。\n3. **相关工作回顾**\n    - **领域泛化**：当前DG方法大致分为特征对齐、特征解缠、数据/特征增强、元学习四类，各有优缺点，本文考虑结构不变性这一更细粒度和稳定的属性。\n    - **数据混合**：对比Mixup等数据混合方法，提出的CDM通过替换图像背景生成多样训练样本，同时利用类别和领域信息。\n    - **跨域不变性**：传统方法用统计分布差异衡量域间分布变化，新方法利用类原型概念，但都不能保证可泛化表示，本文提出的MiRe通过特征聚合和消息传递对不同语义锚的图形结构建模。\n4. **多视图聚类方法研究**\n    - **传统方法问题**：传统多视图聚类方法直接处理原始多视图特征或指定核特征，存在噪声和冗余信息问题。\n    - **深度聚类方法不足**：深度聚类方法虽有改进，但基于视图融合模型难以获得有判别力的共识表示，基于对比学习的对齐方法在区分正负对时可能与聚类目标冲突。\n    - **提出新框架**：提出用于聚类的多视图表示学习框架GCFAggMVC，通过自编码器模型学习视图特定表示，设计全局和跨视图特征聚合模块学习样本间全局相似关系，利用对比学习建立与视图特定表示的一致性，该模块灵活，可应用于不完整多视图数据聚类任务。  ", "dreams_personality_context": "从这段内容难以直接总结出人物性格。因为文本主要围绕计算机科学研究的专业内容展开，重点在于研究的问题、方法、成果等学术方面，并没有提供关于人物性格特征的描述或线索。  \n\n如果非要强行关联，从研究过程中展现出对现有方法局限的敏锐洞察、不断探索新方法解决问题、回顾相关工作并进行对比分析等行为，可以推测出人物可能具有善于钻研、勇于创新、严谨细致、具有批判性思维等性格特点，但这些更多是基于研究行为的合理推测，并非从文本中直接提炼出的性格描述。  ", "ref_analysis_id": ""}, "__type__": "dreams_node"}}, "analysis_store/ref_analysis_info": {"": {"node_ids": ["43577d46-8c30-4c8a-a774-477deb0535da"], "metadata": {}}}, "analysis_store/metadata": {"43577d46-8c30-4c8a-a774-477deb0535da": {"analysis_hash": "", "ref_analysis_id": ""}}}