{"task_step_store/data": {"8da2e2af-46ef-4ee5-8766-c77589af9874": {"__data__": {"id_": "8da2e2af-46ef-4ee5-8766-c77589af9874", "metadata": {}, "relationships": {}, "hash": "", "start_task_context": "大模型MLA技术细节", "aemo_representation_context": "### 1. 分析近几年研究领域的技术框架与方法论\n在计算机科学相关研究领域，Transformer、GAN、BERT 等框架成为众多论文采用的核心技术。这些框架在不同任务中展现出强大的适应性，其方法论围绕着如何有效处理数据特征、优化模型结构以提升性能。例如，Transformer 基于自注意力机制，打破了传统序列模型的局限性，在自然语言处理和计算机视觉等多领域广泛应用；GAN 通过生成器与判别器的对抗训练，在图像生成等任务上取得显著成果；BERT 则通过预训练方式，极大提升了自然语言处理任务的性能。\n\n### 2. 研究论文中采用的主要框架在不同任务中的应用与变体\n - **Transformer**：在自然语言处理任务中，如机器翻译、文本分类，Transformer 架构不断演变，出现了诸如 ViT（Vision Transformer）等变体应用于计算机视觉任务，将图像视为序列进行处理，展现出跨领域的应用潜力。\n - **GAN**：在图像生成任务中，DCGAN（Deep Convolutional GAN）等变体通过改进网络结构，生成更逼真的图像；在医学图像合成、视频生成等领域也有应用，通过调整损失函数和网络架构适应不同任务需求。\n - **BERT**：除了基础的自然语言理解任务，还在信息检索、情感分析等任务中得到广泛应用，通过微调预训练模型适应特定任务，同时出现了 RoBERTa 等改进版本，优化预训练策略提升性能。\n\n### 3. 评估学术界的技术进步与局限性\n - **技术进步**：模型性能在多个任务上取得显著提升，例如在图像识别准确率、自然语言处理任务的 F1 值等指标上不断刷新记录。新的模型架构和训练方法不断涌现，推动了技术的快速发展。\n - **局限性**：依然存在模型偏差和数据依赖问题。模型在某些特定数据集上表现良好，但在其他数据集或现实场景中泛化能力不足。部分模型对大规模标注数据依赖严重，数据质量和数量影响模型性能，且模型解释性差，难以理解其决策过程。\n\n### 4. 探讨计算模型在不同数据集与应用场景下的适用性与泛化能力\n - **适用性**：不同模型在特定数据集和应用场景下有各自优势。例如，基于深度学习的模型在大规模、高维数据的图像和语音识别任务中表现出色；传统机器学习模型在小数据、简单任务中仍有应用价值。\n - **泛化能力**：尽管部分模型在特定领域取得成功，但在多领域、多模态数据融合的现实应用中，泛化能力面临挑战。多模态数据的异质性和复杂性使得模型难以有效提取和融合特征，限制了其在复杂现实场景中的应用。\n\n### 5. 分析最新算法的稳定性与容错性\n - **稳定性优化**：一些算法针对稳定性进行了优化，例如采用正则化技术、对抗训练等方法提高模型在复杂环境下的稳定性。在动态环境中，部分算法通过在线学习、自适应调整参数等方式保持性能稳定。\n - **大规模数据适应性**：在大规模数据处理上，部分算法通过分布式训练、模型压缩等技术提高计算效率和适应性。但仍有算法在处理大规模数据时面临内存、计算资源等限制，导致性能下降。\n\n### 6. 评估论文中提出的未来研究方向与挑战\n - **新研究问题**：提出了如提升模型可解释性、解决模型偏差和数据依赖、增强多模态数据融合能力等新研究问题。\n - **研究切入点**：从改进模型架构、优化训练算法、探索新的数据增强方法等方面寻找新的研究切入点。这些挑战促使研究者不断探索新的技术和方法，推动后续研究朝着更高效、更智能、更具泛化能力的方向发展。\n\n### 研究成果、方法创新性与应用价值总结\n - **研究成果**：在模型性能提升、新架构和算法提出等方面取得显著成果，推动了计算机科学多个领域的发展。\n - **方法创新性**：通过引入新的技术框架、改进训练方法和优化模型结构等方式，展现出诸多创新点，如自注意力机制、对抗训练等。\n - **应用价值**：在图像、自然语言处理、语音等多个领域有广泛应用，为智能安防、智能医疗、智能交通等现实场景提供技术支持，具有巨大的商业和社会价值。  ", "task_step_name": "分析近几年研究领域的技术框架与方法论", "task_step_description": "在计算机科学相关研究领域，Transformer、GAN、BERT 等框架成为众多论文采用的核心技术。这些框架在不同任务中展现出强大的适应性，其方法论围绕着如何有效处理数据特征、优化模型结构以提升性能。例如，Transformer 基于自注意力机制，打破了传统序列模型的局限性，在自然语言处理和计算机视觉等多领域广泛应用；GAN 通过生成器与判别器的对抗训练，在图像生成等任务上取得显著成果；BERT 则通过预训练方式，极大提升了自然语言处理任务的性能。", "task_step_level": "0", "task_step_question": "近几年在计算机科学相关研究领域，Transformer、GAN、BERT 等框架是如何具体围绕有效处理数据特征和优化模型结构来提升性能的？ ", "task_step_question_context": [{"ref_id": "454847723981641856", "chunk_id": "1", "score": 0.458984375, "text": "# 2 RELATED WORK\nPre-trained language models. Transformer (Vaswani et al., 2017) is a sequence-to-sequence model that heavily uses the concept of self-attention. Later on, numerous transformer-based models have been proposed and show overwhelming performance on natural language processing (NLP) and on computer vision (CV) tasks. Devlin et al. (2019) designed BERT that pre-train deep bidirectional representations from unlabeled text and reached powerful performance. Liu et al. (2019) found that BERT were terribly undertrained and proposed RoBERTa, an enhanced training recipe for BERT which can greatly boost the performance. He et al. (2020) proposed decoding-enhanced BERT with disentangled attention (DeBERTa) that incorporates the disentangled attention mechanism and an improved mask encoder to enhance BERT and RoBERTa. More variants like XL-Net, Albert, and Electra have also been proposed in recent years (Yang et al., 2019; Lan et al., 2019; Clark et al., 2019). The series of GPT models (Radford et al., 2019; Brown et al., 2020) are later developed based on transformers decoder blocks rather than encoder blocks like BERT, which again have shown superior performance on different tasks. These large models pretrained on a large amount of unlabelled texts would need to be further fine-tuned on downstream tasks for better performance.  \n\nOne of the accompanying disadvantages of these pre-training models with tremendous parameter counts (e.g., 175 B in GPT-3) is the unaffordable computational cost for further fine-tuning.  \n\nPruning and Low-rank decomposition. Pruning is a widely-used model compression technique. It can reduce the number of parameters inside models, which possibly brings training and inference efficiency. Along with weight pruning method (Han et al., 2015b) being one of the most effective methods (Gordon et al., 2020), various criterion have been proposed to select insignifi- cant weights for pruning, such as Taylor approximation (Molchanov et al., 2019), Hessian score approximation (Hassibi & Stork, 1993), and other saliency scores such as SNIP (Lee et al., 2018), GraSP (Wang et al., 2019) and SynFlow (Tanaka et al., 2020). Several pruning methods have been commonly adapted to compress language models (McCarley et al., 2019; Gordon et al., 2020; Sanh et al., 2020; Wang et al., 2020; Chen et al., 2021). Specifically, McCarley et al. (2019) proposed to prune attention heads that had less contribution to the model. Wang et al. (2020) pruned BERT models by involving low-rank factorization and $\\ell_{0}$ regularization. Sanh et al. (2020) invented an improved version of magnitude pruning ( i.e. , pruning based on the weight change) that can better suit the transfer learning. Chen et al. (2021) performed structured pruning on BERT via $\\ell_{1}$ sparse regularization, which reduced a large portion of parameters and decreased the training cost.  \n\nLow-rank approximation (Ye, 2005) is also vastly studied. One classical scenario is robust principle component analysis (Cand\\`es et al., 2011), which decomposes a matrix into a low-rank plus a sparse component. Existing literature shows that in deep learning, the learned over-parameterized models often naturally bear approximate low-rank weight structures (Oymak et al., 2019; Yu et al., 2017). Some (Jaderberg et al., 2014; Povey et al., 2018; Sainath et al., 2013; Zhang et al., 2014; Zhao et al., 2016) have explicitly imposed the low-rank constraint during training. Wang et al. (2020); Hu et al. (2021) utilized low-rank decomposition to shrink the model size and trim down the trainable parameters during fine-tuning. However, to our best knowledge, integrating sparsity and low-rank structures has never been studied before for efficient fine-tuning of pre-trained language models.  \n\nParameter-efficient adaptation. Parameter-efficient adaptation aims at reducing the number of trainable parameters when fine-tuning the models across different downstream domains. Unlike pruning, it generates sparse updates instead of building sparse models. Various approaches are invented to achieve the goal. Rebuffiet al. (2017); Houlsby et al. (2019) inserted and only trained adapters between existing layers, whose parameters are much less compared to the pretrained models. Guo et al. (2020) leveraged $\\ell_{0}$ regularization to limit the number of non-zero elements in the update vectors. Lester et al. (2021); Li & Liang (2021) introduced efficient prompt tuning which optimizes only a small continuous task-specific vector. Hu et al. (2021) proposed a low-rank decomposition-based method that can also significantly reduce the number of trainable parameters. However, fine-tuned models yielded by these methods work have the same amount of weights as the pre-trained starting point; hence they contribute no resource efficiency of the final model.\n\n# 3 METHODOLOGY\nIn this section, we begin by describing our notations and definitions of sparsity generation and parameter-efficient fine-tuning in Section 3.1. Then, we introduce the (dually) sparsity-embedded efficient fine-tuning algorithms in Sections 3.2 and 3.3.\n\n# 3.1 PRELIMINARIES\nSparsity generation and resource-efficient fine-tuning. We adopt both unstructured and structured pruning methods to produce sparsity. They can lead to resource-efficiency including memory and computation savings.  \n\n$\\boldsymbol{\\mathscr{W}}\\,\\in\\,\\mathbb{R}^{m\\times n}$ denote a weight matrix. The goal of ning is to fi a binary mas $s\\ \\in$ $\\{0,1\\}^{\\|\\mathcal{W}\\|_{0}}$ {results in a sparse weight structured pruning, it helps save computational cost since the sparse weights can be smaller in size }, where $\\|\\mathcal{W}\\|_{0}$ W ⊙S . For unstructured pruning, only memory cost is saved; but for umber of parameters in W. The mask Sis applied to Wand by wiping out all-zero columns or rows. However, the performance of networks after structured pruning is often shown to be inferior compared with the unstructured pruning counterpart.  \n\nParameter-efficient fine-tuning. stream rn task ific weight update To leverage $\\Delta{\\mathcal{W}}$ knowledge in pre-trained weights via fine-tuning and generate predictions with $\\mathcal{W}$ , downweights massive resources as the size of the pre-trained model increases. Parameter-efficient fine-tuning try W$\\mathcal{W}\\!+\\!\\Delta\\mathcal{W}$ W. Since $\\Delta{\\mathcal{W}}$ Whas the same size of W, learning the update matrices usually requires to solve this problem by using as few trainable parameters as possible to represent $\\Delta{\\mathcal{W}}$ , while maintaining competitive downstream fine-tuning performance. Previous literature reaches the goal via either sparsifying weigh a matrices $\\Delta{\\mathcal{W}}$ (Guo et al., 2020) or leveraging low-rank decomposed matrices to compute $\\Delta{\\mathcal{W}}$ W(Hu et al., 2021).  \n\n  \nFigure 1: The overview of our proposals. The sparse masks can have unstructured or structured patterns, hich leads to training and erence efficiency. During the fine-tuning, we only train decomposed matrices $\\mathcal{U}$ ,Vand non-zero elements in S$S_{2}$ 2 .  \n\n<html><body><table><tr><td>Algorithm 1: Sparsity-Embedded Low- Rank Decomposition</td></tr><tr><td>Input: Pretrained weights W, number of non-zero elements N Output: Sparse matrices S2 Initialize S2 to be an empty set. foreachself-attentionprojectionweights w inW do */</td></tr><tr><td>/+ Decomposition Perform matrix decomposition: w; ≈ UV + S' by solving the optimization problem in Eqn.1. /* Identify important</td></tr><tr><td>elements to form S2 */ Perform thresholding on S': Keep N elements in S' with top magnitudes, and set the rest 0. Append S' into S2. end</td></tr></table></body></html>  \n\n<html><body><table><tr><td>Algorithm2:DSEE</td></tr><tr><td>Input: Pretrained weights W, number of non-zero elements N, desired sparsity s, loss function Output: Sparse mask S1, matrices U,V, S2 Decompose W into U,V and S2</td></tr><tr><td>(Re-)Initialization: U = 0, V ~ N(0,0.02),Ω = indexes of non-zero elements in S2, S = 0 /﹢ I:train before pruning * Train U,V, S with respect to L under the</td></tr><tr><td>constraint of Poc (S) = 0. / II: pruning the model */</td></tr><tr><td>Prune (1-s%) parameters in W globally by sorting the magnitude of W + UV + S,</td></tr><tr><td>deriving the sparsity mask S1 /+ III:tuning after pruning * Tune U, V, S2 for E epochs for recovering the performance.</td></tr></table></body></html>"}, {"ref_id": "454847724073130116", "chunk_id": "3", "score": 0.40234375, "text": "# 2. Related work\n\n# 2.1. Transformer v.s. CNN\nTransformer [ 63 ] was introduced in 2017 for NLP tasks. Compared with LSTM, Transformer can not only train in parallel but also achieve better performance. Then many famous NLP models are built on Transformer, including GPT series [ 44 ,45 ,3 ,42 ], BERT [ 12 ], T5 [ 47 ], and OPT [80 ]. For the application of the Transformer in vision tasks, Vision Transformer (ViT) is definitely the seminal work, showing that Transformer can achieve impressive performance after large-scale supervised training. Followup works [ 61 ,76 ,65 ,66 ,18 ] like Swin [ 37 ] continually improve model performance, achieving new state-of-the-art on various vision tasks. These results seem to tell us “Attention is all you need” [ 63 ].  \n\nBut it is not that simple. ViT variants like DeiT usually adopt modern training procedures including various advanced techniques of data augmentation [ 10 ,9 ,79 ,77 ,83 ], regularization [ 57 ,25 ] and optimizers [ 28 ,39 ]. Wightman et al. find that with similar training procedures, the performance of ResNet can be largely improved. Besides, Yu et al. [74 ] argue that the general architecture instead of attention plays a key role in model performance. Han et al. [19 ] find by replacing attention in Swin with regular or dynamic depthwise convolution, the model can also obtain comparable performance. ConvNeXt [ 38 ], a remarkable work, modernizes ResNet into an advanced version with some designs from ViTs, and the resulting models consistently outperform Swin [ 37 ]. Other works like RepLKNet [13 ], VAN [ 17 ], FocalNets [ 72 ], HorNet [ 49 ], SLKNet [ 36 ], ConvFormer [ 75 ], Conv2Former [ 22 ], and InternImage [ 64 ]constantly improve performance of CNNs. Despite the high performance obtained, these models neglect efficiency, exhibiting lower speed than ConvNeXt. Actually, ConvNeXt is also not an efficient model compared with ResNet. We argue that CNN models should keep the original advantage of efficiency. Thus, in this paper, we aim to improve the model efficiency of CNNs while maintaining high performance.\n\n# 2.2. Convolution with large kernels.\nWell-known works, like AlexNet [ 30 ] and Inception v1 [56 ] already utilize large kernels up to $11\\times11$ and $7\\times7$ , respectively. To improve the efficiency of large kernels, VGG [53 ] proposes to heavily s $3\\times3$ convolutions e In$k\\times1$ $k\\times k$ tant for semantic segmentation and they decompose large ××on v3 [ staking sequentially. For depthwise convoluti [. Besides, Peng 60 ] splits kernels into several groups from 57 ] factorizes et al. $k\\times k$ find that large kernels are impor×convolution into $1\\times k$ $3\\times3$ ××and ixto kernels similar to Inception v3 [ 57 ]. Witnessing the success of Transformer in vision tasks [ 16 ,65 ,37 ], large-kernel convolution is more emphasized since it can offer a large receptive field to imitate attention [ 19 ,38 ]. For example, ConvNeXt adopts kernel size of $7\\times7$ for depthwise convolution by default. To employ larger kernels, RepLKNet [ 13 ]proposes to utilize structural re-parameterization techniques [78 ,14 ] to scale up kernel size to $31\\times31$ ; VAN [ 17 ] sequentially stacks large-kernel depth-wise convolution (DWConv) and depth-wise dilation convolution to obtain $21\\!\\times\\!21$ receptive filed; FocalNets employs a gating mechanism to fuse multi-level features from stacking depthwise convolutions; Recently, SLaK [ 36 ] fac es la ernel $k\\times k$ two small non-square kernels ( Different from these works, we do not aim to scale up larger $k\\!\\times\\!s$ ×and $s\\!\\times\\!k$ ×, where $s<k$ ). kernels. Instead, we target efficiency and decompose large kernels in a simple and speed-friendly way while keeping comparable performance.\n\n# 3. Method\n\n# 3.1. MetaNeXt\nFormulation of MetaNeXt Block. ConvNeXt [ 38 ] is a modern CNN model with simple architecture. For each ConvNeXt block, the input $X$ is first processed by a depthwise convolutioin to propagate information along spatial dimensions. We follow MetaFormer [ 74 ] to abstract the depthwise convolution as a token mixer which is responsible for spatial information interaction. Accordingly, as shown in the second subfigure in Figure 2 , the ConvNeXt is abstracted as MetaNeXt block. Formally, in a MetaNeXt block, its input $X$ is firstly processed as  \n\n$$\nX^{\\prime}=\\operatorname{TokenMixer}(X)\n$$  \n\nimport torch.nn as nn  \n\nAlgorithm 1 Inception Depthwise Convolution (PyTorchlike Code)   \n\n\n<html><body><table><tr><td>def</td><td>class InceptionDwConv2d(nn.Module): init__(self， in_channels,</td></tr><tr><td></td><td>square_kernel_size=3, band_kernel_size=11, branch_ratio=1/8): super().—init()</td></tr><tr><td></td><td>gc = int(in_channels * branch_ratio) # channel number of a convolutionbranch</td></tr><tr><td></td><td>self.dwconv_hw = nn.Conv2d(gc, gc, square_kernel_size, padding= square_kernel_size//2, groups=gc)</td></tr><tr><td></td><td>self.dwconv_w = nn.Conv2d(gc, gc, kernel_size =(l, band_kernel_size), padding=(0,</td></tr><tr><td></td><td>band_kernel_size//2), groups=gc) self.dwconv_h = nn.Conv2d(gc, gc,. kernel_size =(band_kernel_size, l), padding=(</td></tr><tr><td></td><td>band_kernel_size//2, 0)， groups=gc) self.split_indexes = (gc, gc, gc, in_channels -\"3*gc)</td></tr><tr><td></td><td>def forward(self，x): # B， C， H,， W = x.shape</td></tr><tr><td></td><td>x_hw， x_w， x_h, x_id = torch.split(x， self.</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td>split_indexes, dim=l)</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td>return torch.cat(</td></tr><tr><td></td><td></td></tr><tr><td></td><td>(self.dwconv_hw(x_hw）,</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td>self.dwconv_w(x_w),</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td>x_id),</td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td>self.dwconv_h(x_h),</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td>dim=1)</td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr></table></body></html>  \n\nwhere $X,X^{\\prime}\\in\\mathbb{R}^{B\\times C\\times H\\times W}$ with $B,C,H$ and $W$ denoting batch size, channel number, height and width, respectively. Then the output from the token mixer is normalized,  \n\n$$\nY=\\operatorname{Norm}(X^{\\prime})\n$$  \n\nAfter normalization [ 27 ,1 ], the resulting features are inputted into an MLP module consisting of two fullyconnected layers with an activation function sandwiched between them, the same as feed-forward network in Transformer [ 63 ]. The two fully-connected layers can also be implemented by $1\\times1$ convolutions. Also, shortcut connection [ 20 ,54 ] is adopted. This process can be expressed by  \n\n$$\nY=\\mathrm{Conv}_{1\\times1}^{r C\\to C}\\{\\sigma[\\mathrm{Conv}_{1\\times1}^{C\\to r C}(Y)]\\}+X,\n$$  \n\nwhere $\\mathrm{Conv}_{k\\times k}^{C_{i}\\rightarrow C_{o}}$ means convolution with kernel size of $k\\times k$ , input channels o ×$C_{i}$ and output channels of $C_{o};r$ is the expansion ratio and σdenotes activation function.  \n\nComparison to MetaFormer block. As shown in Figure 2 , it can be found that MetaNeXt block shares similar modules with MetaFormer block [ 74 ], e.g. token mixer and MLP. Nevertheless, a critical differentiation between the two models lies in the number of shortcut connections [20 ,54 ]. MetaNeXt block implements a single shortcut connection, whereas the MetaFormer block incorporates two, one for the token mixer and the other for the MLP. From this aspect, MetaNeXt block can be regarded as a result of merging two residual sub-blocks from MetaFormer, thereby simplifying the overall architecture. As a result, the MetaNeXt architecture exhibits a higher speed compared to MetaFormer. However, this simpler design comes with a limitation: the token mixer component in MetaNeXt cannot be complicated ( e.g. , Attention) as shown in our experiments (Table 3 ).  \n\nInstantiation to ConvNeXt. As shown in Figure 2 , in ConvNeXt, the token mixer is simply implemented by a depthwise convolution,  \n\n$$\nX^{\\prime}=\\operatorname{TokenMixer}(X)=\\operatorname{DWConv}_{k\\times k}^{C\\to C}(X)\n$$  \n\nkernel size of where $\\mathrm{DWConv}_{k\\times k}^{C\\rightarrow C}$ $k\\times k$ ×. In ConvNeXt, denotes depthwise convolution with $k$ is set as 7 by default."}, {"ref_id": "454845616393828768", "chunk_id": "2", "score": 0.39453125, "text": "# 2 Related Work\n\n# 2.1 Transformers for Graph\nRecently, Transformer [ 33 ] has shown its superiority in an increasing number of domains [ 7 ,8 ,40 ], e.g. Bert [ 7 ] in NLP and ViT [ 8 ] in CV. Existing works attempting to generalize Transformer to graph data mainly focus on two problems: (1) How to design dedicated positional encoding for the nodes; (2) How to alleviate the quadratic computational complexity of the vanilla Transformer and scale the Graph Transformer to large graphs. As for the positional encoding, GT [ 9 ] firstly uses Laplacian eigenvectors to enhance node features. Graph-Bert [ 41 ] studies employing Weisfeiler-Lehman code to encode structural information. Graphormer [ 38 ] utilizes centrality encoding to enhance node features while incorporating edge information with spatial (SPD-indexed attention bias) and edge encoding. SAN [ 21 ] further replaces the static Laplacian eigenvectors with learnable positional encodings and designs an attention mechanism that distinguishes local connectivity. For the scalability issue, one immediate idea is to restrict the number of attending nodes. For example, GAT [ 34 ] and GT-Sparse [9 ] only consider the 1-hop neighboring nodes; Gophormer [ 46 ] uses GraphSAGE [ 11 ] sampling to uniformly sample ego-graphs with pre-defined maximum depth; Graph-Bert [ 41 ] restricts the receptive field of each node to the nodes with top$\\cdot\\mathbf{k}$ intimacy scores (e.g., Katz and PPR). However, these fixed node sampling strategies sacrifice the advantage of the Transformer architecture. SAC [22 ] tries to use an LSTM edge predictor to predict edges for self-attention operations. However, the fact that LSTM can hardly be parallelized reduces the computational efficiency of the Transformer.\n\n# 2.2 Sparse Transformers\nIn parallel, many efforts have been devoted to reducing the computational complexity of the Transformer in the field of NLP [ 23 ] and CV [ 32 ]. In the domain of NLP, Longformer [ 2 ] applies block-wise or strode patterns while only fixing on fixed neighbors. Reformer [ 19 ] replaces dot-product attention by using approximate attention computation based on locality-sensitive hashing. Routing Transformer [30] employs online $\\mathbf{k}$ -means clustering on the tokens. Linformer [35] demonstrates that the self-attention mechanism can be approximated by a low-rank matrix and reduces the complexity from ${\\mathcal{O}}(n^{2})$ scheme which brings greater efficiency by limiting self-attention computation to non-overlapping to $\\mathcal{O}(n)$ . As for vision transformers, Swin Transformer [ 24 ] proposes the shifted windowing local windows while also allowing for cross-window connection. Focal Transformer [ 37 ] presents a new mechanism incorporating both fine-grained local and coarse-grained global attention to capture short- and long-range visual dependencies efficiently. However, these sparse transformers do not take the unique graph properties into consideration.\n\n# 2.3 Graph Neural Networks and Node Sampling\nGraph neural networks (GNNs) [ 18 ,11 ,12 ,44 ,43 ,31 ,45 ,42 ] follow a message-passing schema that iteratively updates the representation of a node by aggregating representations from neighboring nodes. When generalizing to large graphs, Graph Neural Networks face a similar scalability issue. This is mainly due to the uncontrollable neighborhood expansion in the aggregation stage of GNN. Several node sampling algorithms have been proposed to limit the neighborhood expansion, which mainly falls into node-wise sampling methods and layer-wise sampling methods. In node-wise sampling, each node samples $k$ neighbors from its sampling distribution, then the total number of nodes in the $l$ -th layer becomes $\\mathcal{O}(\\breve{k}^{l})$ . GraphSage [ 11 ] is one of the most well-known node-wise sampling methods with the uniform sampling distribution. GCN-BS [ 25 ] introduces a variance reduced sampler based on multi-armed bandits. To alleviate the exponential neighbor expansion $\\mathcal{O}(k^{l})$ of the node-wise samplers, layer-wise samplers define the sampling distribution as a probability of sampling nodes given a set of nodes in the upper layer [ 4 ,16 ,49 ]. From another perspective, these sampling methods can also be categorized into fixed sampling strategies [ 11 ,4 ,49 ] and adaptive strategies [ 25 ,39 ]. However, none of the above sampling methods in GNNs can be directly applied in Graph Transformer as Graph Transformer does not follow the message passing schema.\n\n# 3 Preliminaries\n\n# 3.1 Problem Definition\nLet $G=(A,X)$ denote t ted graph where $A\\in\\mathbb{R}^{n\\times n}$ represents the symmetric adjac matrix with nnodes, and $X\\in\\mathbb{R}^{n\\times p}$ ∈is the attribute matrix of pattributes r node. The element $A_{i j}$ in the adjacency matrix equals to 1 if there exists an edge between node $v_{i}$ and node $v_{j}$ , otherwise $A_{i j}~=~0$ . The label of node $v_{i}$ is $y_{i}$ . In the node classification problem, the classifier has the knowledge of the labels of a subset of nodes $V_{L}$ . The goal of semi-supervised node classification is to infer the labels of nodes in $V\\backslash V_{L}$ by learning a classification function.\n\n# 3.2 Transformer Architecture\nThe Transformer architecture consists of a series of Transformer layers [ 33 ]. Each Transformer layer has two parts: a multi-head self-attention (MHA) module and a position-wise feed-forward network (FFN). Let $\\mathbf{H}=\\left[h_{1},\\cdot\\cdot\\cdot\\mathbf{\\Phi},h_{m}\\right]^{\\top}\\in\\mathbb{R}^{m\\times d}$ denote the input to the self-attention module where $d$ is  \n\nthe hidden dimension, $h_{i}\\in\\mathbb{R}^{d\\times1}$ is the hidden represe ation at position $i$ , and $m$ is the number of positions. The MHA module firstly projects the input Hto query-, key-, value-spaces, denoted as $\\mathbf{Q},\\mathbf{K},\\mathbf{V}$ , using three matrices $\\mathbf{W}_{Q}\\in\\mathbb{R}^{d\\times d_{K}}$ ,$\\mathbf{W}_{K}\\in\\mathbb{R}^{d\\times d_{K}^{\\textbf{\\texttt{L}}}}$ and $\\dot{\\mathbf{W}_{V}}\\in\\mathbb{R}^{d\\times d_{V}}$ :  \n\n$$\n\\mathbf{Q}=\\mathbf{H}\\mathbf{W}_{Q},\\quad\\mathbf{K}=\\mathbf{H}\\mathbf{W}_{K},\\quad\\mathbf{V}=\\mathbf{H}\\mathbf{W}_{V}.\n$$  \n\nThen, in each head $i\\,\\in\\,\\{1,2,\\dots,B\\}$ ($B$ is the to heads), the scaled dot-product attention mechanism is applied to the corresponding {$\\{\\mathbf{Q}_{i},\\mathbf{K}_{i},\\mathbf{V}_{i}\\}$ }:  \n\n$$\n\\mathrm{head}_{i}=\\mathrm{Softmax}\\left(\\frac{\\mathbf{Q}_{i}\\mathbf{K}_{i}^{T}}{\\sqrt{d_{K}}}\\right)\\mathbf{V}_{i}.\n$$  \n\nFinally, the outputs from different heads are further concatenated and transformed to obtain the final output of MHA:  \n\n$$\n\\mathrm{MHA}(\\mathbf{H})=\\mathrm{Concat}\\left(\\mathbf{\\Pi}_{\\mathrm{head}_{1},\\mathbf{\\Pi}_{\\cdot}\\mathbf{\\Pi}_{\\cdot},\\mathrm{...},\\mathrm{head}_{B}}\\right)\\mathbf{W}_{O},\n$$  \n\nwhere $\\mathbf{W}_{O}\\in\\mathbb{R}^{d\\times d}$ . In this work, we employ $d_{K}=d_{V}=d/B$ ."}], "task_step_question_answer": "这些技术框架的持续发展和创新，不仅推动了计算机科学领域的进步，也为其他相关学科带来了新的研究思路和方法。在跨学科研究中，这些技术框架发挥着越来越重要的作用。例如在环境科学领域，利用深度学习技术框架可以对大量的气象数据、地理信息数据等进行分析和处理，预测气候变化趋势，为环境保护和资源管理提供科学依据。在社会科学领域，通过自然语言处理技术框架对社交媒体数据、新闻文本等进行挖掘和分析，可以了解公众的情绪和观点，为政策制定和社会研究提供支持。随着技术的不断进步，这些技术框架还将不断拓展其应用领域，为解决各种复杂的实际问题提供更有效的手段。", "ref_task_step_id": ""}, "__type__": "task_step_node"}, "0b08a81b-65f3-4cf0-9626-683e37b4bdaa": {"__data__": {"id_": "0b08a81b-65f3-4cf0-9626-683e37b4bdaa", "metadata": {}, "relationships": {}, "hash": "", "start_task_context": "大模型MLA技术细节", "aemo_representation_context": "### 1. 分析近几年研究领域的技术框架与方法论\n在计算机科学相关研究领域，Transformer、GAN、BERT 等框架成为众多论文采用的核心技术。这些框架在不同任务中展现出强大的适应性，其方法论围绕着如何有效处理数据特征、优化模型结构以提升性能。例如，Transformer 基于自注意力机制，打破了传统序列模型的局限性，在自然语言处理和计算机视觉等多领域广泛应用；GAN 通过生成器与判别器的对抗训练，在图像生成等任务上取得显著成果；BERT 则通过预训练方式，极大提升了自然语言处理任务的性能。\n\n### 2. 研究论文中采用的主要框架在不同任务中的应用与变体\n - **Transformer**：在自然语言处理任务中，如机器翻译、文本分类，Transformer 架构不断演变，出现了诸如 ViT（Vision Transformer）等变体应用于计算机视觉任务，将图像视为序列进行处理，展现出跨领域的应用潜力。\n - **GAN**：在图像生成任务中，DCGAN（Deep Convolutional GAN）等变体通过改进网络结构，生成更逼真的图像；在医学图像合成、视频生成等领域也有应用，通过调整损失函数和网络架构适应不同任务需求。\n - **BERT**：除了基础的自然语言理解任务，还在信息检索、情感分析等任务中得到广泛应用，通过微调预训练模型适应特定任务，同时出现了 RoBERTa 等改进版本，优化预训练策略提升性能。\n\n### 3. 评估学术界的技术进步与局限性\n - **技术进步**：模型性能在多个任务上取得显著提升，例如在图像识别准确率、自然语言处理任务的 F1 值等指标上不断刷新记录。新的模型架构和训练方法不断涌现，推动了技术的快速发展。\n - **局限性**：依然存在模型偏差和数据依赖问题。模型在某些特定数据集上表现良好，但在其他数据集或现实场景中泛化能力不足。部分模型对大规模标注数据依赖严重，数据质量和数量影响模型性能，且模型解释性差，难以理解其决策过程。\n\n### 4. 探讨计算模型在不同数据集与应用场景下的适用性与泛化能力\n - **适用性**：不同模型在特定数据集和应用场景下有各自优势。例如，基于深度学习的模型在大规模、高维数据的图像和语音识别任务中表现出色；传统机器学习模型在小数据、简单任务中仍有应用价值。\n - **泛化能力**：尽管部分模型在特定领域取得成功，但在多领域、多模态数据融合的现实应用中，泛化能力面临挑战。多模态数据的异质性和复杂性使得模型难以有效提取和融合特征，限制了其在复杂现实场景中的应用。\n\n### 5. 分析最新算法的稳定性与容错性\n - **稳定性优化**：一些算法针对稳定性进行了优化，例如采用正则化技术、对抗训练等方法提高模型在复杂环境下的稳定性。在动态环境中，部分算法通过在线学习、自适应调整参数等方式保持性能稳定。\n - **大规模数据适应性**：在大规模数据处理上，部分算法通过分布式训练、模型压缩等技术提高计算效率和适应性。但仍有算法在处理大规模数据时面临内存、计算资源等限制，导致性能下降。\n\n### 6. 评估论文中提出的未来研究方向与挑战\n - **新研究问题**：提出了如提升模型可解释性、解决模型偏差和数据依赖、增强多模态数据融合能力等新研究问题。\n - **研究切入点**：从改进模型架构、优化训练算法、探索新的数据增强方法等方面寻找新的研究切入点。这些挑战促使研究者不断探索新的技术和方法，推动后续研究朝着更高效、更智能、更具泛化能力的方向发展。\n\n### 研究成果、方法创新性与应用价值总结\n - **研究成果**：在模型性能提升、新架构和算法提出等方面取得显著成果，推动了计算机科学多个领域的发展。\n - **方法创新性**：通过引入新的技术框架、改进训练方法和优化模型结构等方式，展现出诸多创新点，如自注意力机制、对抗训练等。\n - **应用价值**：在图像、自然语言处理、语音等多个领域有广泛应用，为智能安防、智能医疗、智能交通等现实场景提供技术支持，具有巨大的商业和社会价值。  ", "task_step_name": "研究论文中采用的主要框架在不同任务中的应用与变体", "task_step_description": "- **Transformer**：在自然语言处理任务中，如机器翻译、文本分类，Transformer 架构不断演变，出现了诸如 ViT（Vision Transformer）等变体应用于计算机视觉任务，将图像视为序列进行处理，展现出跨领域的应用潜力。 - **GAN**：在图像生成任务中，DCGAN（Deep Convolutional GAN）等变体通过改进网络结构，生成更逼真的图像；在医学图像合成、视频生成等领域也有应用，通过调整损失函数和网络架构适应不同任务需求。 - **BERT**：除了基础的自然语言理解任务，还在信息检索、情感分析等任务中得到广泛应用，通过微调预训练模型适应特定任务，同时出现了 RoBERTa 等改进版本，优化预训练策略提升性能。", "task_step_level": "1", "task_step_question": "Transformer、GAN、BERT这三种主要框架在各自不同任务的应用和变体中，哪种变体在跨领域应用或性能提升方面取得的效果最为显著，依据是什么？ ", "task_step_question_context": [{"ref_id": "454847723981641856", "chunk_id": "1", "score": 0.32421875, "text": "# 2 RELATED WORK\nPre-trained language models. Transformer (Vaswani et al., 2017) is a sequence-to-sequence model that heavily uses the concept of self-attention. Later on, numerous transformer-based models have been proposed and show overwhelming performance on natural language processing (NLP) and on computer vision (CV) tasks. Devlin et al. (2019) designed BERT that pre-train deep bidirectional representations from unlabeled text and reached powerful performance. Liu et al. (2019) found that BERT were terribly undertrained and proposed RoBERTa, an enhanced training recipe for BERT which can greatly boost the performance. He et al. (2020) proposed decoding-enhanced BERT with disentangled attention (DeBERTa) that incorporates the disentangled attention mechanism and an improved mask encoder to enhance BERT and RoBERTa. More variants like XL-Net, Albert, and Electra have also been proposed in recent years (Yang et al., 2019; Lan et al., 2019; Clark et al., 2019). The series of GPT models (Radford et al., 2019; Brown et al., 2020) are later developed based on transformers decoder blocks rather than encoder blocks like BERT, which again have shown superior performance on different tasks. These large models pretrained on a large amount of unlabelled texts would need to be further fine-tuned on downstream tasks for better performance.  \n\nOne of the accompanying disadvantages of these pre-training models with tremendous parameter counts (e.g., 175 B in GPT-3) is the unaffordable computational cost for further fine-tuning.  \n\nPruning and Low-rank decomposition. Pruning is a widely-used model compression technique. It can reduce the number of parameters inside models, which possibly brings training and inference efficiency. Along with weight pruning method (Han et al., 2015b) being one of the most effective methods (Gordon et al., 2020), various criterion have been proposed to select insignifi- cant weights for pruning, such as Taylor approximation (Molchanov et al., 2019), Hessian score approximation (Hassibi & Stork, 1993), and other saliency scores such as SNIP (Lee et al., 2018), GraSP (Wang et al., 2019) and SynFlow (Tanaka et al., 2020). Several pruning methods have been commonly adapted to compress language models (McCarley et al., 2019; Gordon et al., 2020; Sanh et al., 2020; Wang et al., 2020; Chen et al., 2021). Specifically, McCarley et al. (2019) proposed to prune attention heads that had less contribution to the model. Wang et al. (2020) pruned BERT models by involving low-rank factorization and $\\ell_{0}$ regularization. Sanh et al. (2020) invented an improved version of magnitude pruning ( i.e. , pruning based on the weight change) that can better suit the transfer learning. Chen et al. (2021) performed structured pruning on BERT via $\\ell_{1}$ sparse regularization, which reduced a large portion of parameters and decreased the training cost.  \n\nLow-rank approximation (Ye, 2005) is also vastly studied. One classical scenario is robust principle component analysis (Cand\\`es et al., 2011), which decomposes a matrix into a low-rank plus a sparse component. Existing literature shows that in deep learning, the learned over-parameterized models often naturally bear approximate low-rank weight structures (Oymak et al., 2019; Yu et al., 2017). Some (Jaderberg et al., 2014; Povey et al., 2018; Sainath et al., 2013; Zhang et al., 2014; Zhao et al., 2016) have explicitly imposed the low-rank constraint during training. Wang et al. (2020); Hu et al. (2021) utilized low-rank decomposition to shrink the model size and trim down the trainable parameters during fine-tuning. However, to our best knowledge, integrating sparsity and low-rank structures has never been studied before for efficient fine-tuning of pre-trained language models.  \n\nParameter-efficient adaptation. Parameter-efficient adaptation aims at reducing the number of trainable parameters when fine-tuning the models across different downstream domains. Unlike pruning, it generates sparse updates instead of building sparse models. Various approaches are invented to achieve the goal. Rebuffiet al. (2017); Houlsby et al. (2019) inserted and only trained adapters between existing layers, whose parameters are much less compared to the pretrained models. Guo et al. (2020) leveraged $\\ell_{0}$ regularization to limit the number of non-zero elements in the update vectors. Lester et al. (2021); Li & Liang (2021) introduced efficient prompt tuning which optimizes only a small continuous task-specific vector. Hu et al. (2021) proposed a low-rank decomposition-based method that can also significantly reduce the number of trainable parameters. However, fine-tuned models yielded by these methods work have the same amount of weights as the pre-trained starting point; hence they contribute no resource efficiency of the final model.\n\n# 3 METHODOLOGY\nIn this section, we begin by describing our notations and definitions of sparsity generation and parameter-efficient fine-tuning in Section 3.1. Then, we introduce the (dually) sparsity-embedded efficient fine-tuning algorithms in Sections 3.2 and 3.3.\n\n# 3.1 PRELIMINARIES\nSparsity generation and resource-efficient fine-tuning. We adopt both unstructured and structured pruning methods to produce sparsity. They can lead to resource-efficiency including memory and computation savings.  \n\n$\\boldsymbol{\\mathscr{W}}\\,\\in\\,\\mathbb{R}^{m\\times n}$ denote a weight matrix. The goal of ning is to fi a binary mas $s\\ \\in$ $\\{0,1\\}^{\\|\\mathcal{W}\\|_{0}}$ {results in a sparse weight structured pruning, it helps save computational cost since the sparse weights can be smaller in size }, where $\\|\\mathcal{W}\\|_{0}$ W ⊙S . For unstructured pruning, only memory cost is saved; but for umber of parameters in W. The mask Sis applied to Wand by wiping out all-zero columns or rows. However, the performance of networks after structured pruning is often shown to be inferior compared with the unstructured pruning counterpart.  \n\nParameter-efficient fine-tuning. stream rn task ific weight update To leverage $\\Delta{\\mathcal{W}}$ knowledge in pre-trained weights via fine-tuning and generate predictions with $\\mathcal{W}$ , downweights massive resources as the size of the pre-trained model increases. Parameter-efficient fine-tuning try W$\\mathcal{W}\\!+\\!\\Delta\\mathcal{W}$ W. Since $\\Delta{\\mathcal{W}}$ Whas the same size of W, learning the update matrices usually requires to solve this problem by using as few trainable parameters as possible to represent $\\Delta{\\mathcal{W}}$ , while maintaining competitive downstream fine-tuning performance. Previous literature reaches the goal via either sparsifying weigh a matrices $\\Delta{\\mathcal{W}}$ (Guo et al., 2020) or leveraging low-rank decomposed matrices to compute $\\Delta{\\mathcal{W}}$ W(Hu et al., 2021).  \n\n  \nFigure 1: The overview of our proposals. The sparse masks can have unstructured or structured patterns, hich leads to training and erence efficiency. During the fine-tuning, we only train decomposed matrices $\\mathcal{U}$ ,Vand non-zero elements in S$S_{2}$ 2 .  \n\n<html><body><table><tr><td>Algorithm 1: Sparsity-Embedded Low- Rank Decomposition</td></tr><tr><td>Input: Pretrained weights W, number of non-zero elements N Output: Sparse matrices S2 Initialize S2 to be an empty set. foreachself-attentionprojectionweights w inW do */</td></tr><tr><td>/+ Decomposition Perform matrix decomposition: w; ≈ UV + S' by solving the optimization problem in Eqn.1. /* Identify important</td></tr><tr><td>elements to form S2 */ Perform thresholding on S': Keep N elements in S' with top magnitudes, and set the rest 0. Append S' into S2. end</td></tr></table></body></html>  \n\n<html><body><table><tr><td>Algorithm2:DSEE</td></tr><tr><td>Input: Pretrained weights W, number of non-zero elements N, desired sparsity s, loss function Output: Sparse mask S1, matrices U,V, S2 Decompose W into U,V and S2</td></tr><tr><td>(Re-)Initialization: U = 0, V ~ N(0,0.02),Ω = indexes of non-zero elements in S2, S = 0 /﹢ I:train before pruning * Train U,V, S with respect to L under the</td></tr><tr><td>constraint of Poc (S) = 0. / II: pruning the model */</td></tr><tr><td>Prune (1-s%) parameters in W globally by sorting the magnitude of W + UV + S,</td></tr><tr><td>deriving the sparsity mask S1 /+ III:tuning after pruning * Tune U, V, S2 for E epochs for recovering the performance.</td></tr></table></body></html>"}, {"ref_id": "454984242683452570", "chunk_id": "1", "score": 0.296875, "text": "# 3. BERT Revisited\n\n# 3.1. BERT in Vision Problems\nTransformers and deep learning have significantly improved results for many tasks in computer vision [ 1 ,7 ,9 ,22 ,23 ,26 ,27 ,30 ,40 ,41 ]. Worth mentioning is Vision Transformer (ViT) [ 7 ], one of the first research efforts at the intersection of Transformers and computer vision. Unlike the traditional CNN network, ViT splits an image into a sequence of patches and applies the Transformers-based framework directly. Inspired by the success of BERT in Natural Language Processing (NLP), Bidirectional Encoder representation from Image Transformers (BEiT) [ 1 ] is presented as a self-supervised learning framework in computer vision. In particular, image patches are tokenized using DALL-E [ 32 ] to the visual tokens. These tokens are then randomly masked before feeding into the transformer backbone. The training objective is to recover the original visual tokens from the corrupted patches. These methods [ 1 ,38 ]have marked a remarkable improvement compared to supervised learning methods by leveraging large-scale unlabelled datasets, e.g., ImageNet-1K, ImagNet-21K [ 33 ], to discover semantic information.\n\n# 3.2. Limitations of BERT in Vision Problems\nOne limitation of using BERT in vision problems is the tokenization step. In the NLP field, a token has precisely one word mapped into it. In vision problems, however, many possible images or patches can share the same token as long as they have the same content. Therefore, designing a BERT model to mask a token and train a prediction model in the missing contexts in computer vision is more challenging than NLP. In addition, the tokenizer , i.e., DALLE [ 32 ], is not robust enough to map similar contexts to a token. It yields noise in the tokenization process and affects the overall training performance. He et al., [ 9 ] presented a Masked Auto Encoder (MAE) that utilizes the BERT framework. Instead of tokenizing images, it eliminates patches of an image via a random masking strategy and reconstructs the context of these masked patches to the original content. Although this method can avoid using the tokenizer, it only considers the context inside an image. Thus, it does not apply to micro-expression, which requires understanding semantic information from consecutive video frames. In this paper, $\\mu$ -BERT is presented to address these limitations.\n\n# 4. The Proposed $\\mu$ -BERT Approach\n$\\mu$ -BERT is designed to model micro-changes of facial texture across temporal dimensions, which is hard to observe by unaided human eyes via a reconstruction process. The proposed $\\mu$ -BERT architecture, shown in Figure 2 , consists of five main blocks: a $\\mu$ -Encoder ,Patch of Interest $(P o I)$ ,Blockwise Swapping ,Diagonal Micro Attention (DMA) , and a $\\mu$ -Decoder . Given input images $I_{t}$ and $I_{t+\\delta}$ , the role of the $\\mu$ -Encoder is to represent $I_{t}$ and $I_{t+\\delta}$ into latent vectors. Then, Patch of Interest (PoI) constrains $\\mu$ -BERT to look into facial regions containing microexpressions rather than unrelated regions such as the background. Blockwise Swapping and Diagonal Micro Attention (DMA) allow the model to focus on facial regions that primarily consist of micro differences between frames. Finally, $\\mu$ -Decoder reconstructs the output signal back to the determined one. Compared to prior works, $\\mu$ -BERT can adaptively focus on changes in facial regions while ignoring the ones in the background and effectively recognizes micro-expressions even when face movements occur. Moreover, $\\mu$ -BERT can also alleviate the dependency on the accuracy of alignment approaches in pre-processing step.  \n\n  \nFigure 2. An overview of the proposed $\\mu$ -BERT approach to facial micro-expression recognition.\n\n# 4.1. Non-overlapping Patches Representation\nIn $\\mu$ -BERT, an input frame $I_{t}\\,\\,\\in\\,\\,\\mathbb{R}^{H\\times W\\times C}$ is divided into a set of several non-overlapping patches Pas Eqn. ( 1 ).  \n\n$$\n\\mathcal{P}_{t}=\\{p_{t}^{i}\\}_{i=0}^{N_{p}-1}\\qquad|\\mathcal{P}_{t}|=H W/({p s}^{2})\n$$  \n\nwhere $H,W,C$ are the height, width, and number of channels, respectively. Each patch $p_{t}^{i}$ sution of $p s\\times p s$ .In our experiments, $H=W=224$ ,$C=3$ , and $p s=8$ .\n\n# 4.2. $\\mu$ -Encoder\nEach patch $p_{i}~\\in~\\mathcal{P}_{t}$ is linear d into a latent vector of dimension fixed positional encoding [ $d$ denoted as 42 ]. Then, an image $\\mathbf{z}_{t}^{i}\\in\\mathbb{R}^{1\\times d}$ ∈, wit $I_{t}$ additive can be represented as in Eqn. ( 2 ).  \n\n$$\n\\begin{array}{r l}&{\\mathbf{Z}_{t}=c o n c a t\\left[\\mathbf{z}_{t}^{0},\\mathbf{z}_{t}^{1},...\\mathbf{z}_{t}^{N_{p}-1}\\right]\\in\\mathbb{R}^{N_{p}\\times d}}\\\\ &{\\mathbf{z}_{t}^{i}=\\alpha(p_{t}^{i})+\\mathbf{e}(i)}\\end{array}\n$$  \n\nwhere $\\alpha$ and $\\mathbf{e}$ are the projection embedding network and positional embedding, respectively. Let $\\mu$ -Encoder, denoted as $\\mathcal{E}$ , be a stack of continuous blocks. Each block consists of alternating layers of Multi Head Attention (MHA) and Multi-Layer Perceptron (MLP), as illustrated in Figure 3 .The Layer Norm (LN) is employed to the input signal before feeding to MHA and MLP layers, as in Eqn. ( 3 ).  \n\n  \nFigure 3. Builing block of Encoder and Decoder. Each block includes Multi-Head Attention (MHA) and Layer Normalization.  \n\n$$\n\\begin{array}{r l}&{\\mathbf{x}_{\\iota}^{\\prime}\\iota=\\mathbf{x}_{\\iota-1}+\\mathrm{MHA}(\\mathrm{LN}(\\mathbf{x}_{\\iota-1}))}\\\\ &{\\mathbf{x}_{\\iota}=\\mathbf{x}_{\\iota}^{\\prime}+\\mathrm{MLP}(\\mathrm{LN}(\\mathbf{x}_{\\iota}^{\\prime}))}\\\\ &{\\mathbf{x}_{0}=\\mathbf{Z}_{\\iota},\\,1\\leq\\iota\\leq L_{e}}\\end{array}\n$$  \n\nwhere $L_{e}$ is the number of blocks in $\\mathcal{E}$ . Given $\\mathbf{Z}_{t}$ , The output latent vector $\\mathbf{P_{t}}$ is represented as in Eqn. ( 4 ).  \n\n$$\n\\mathbf{P}_{t}=\\mathcal{E}(\\mathbf{Z}_{t})\\qquad\\mathbf{P}_{t}\\in\\mathbb{R}^{N_{p}\\times d}\n$$"}, {"ref_id": "454895298648999436", "chunk_id": "0", "score": 0.263671875, "text": "# 2. Related work\n\n# 2.1. Transformer v.s. CNN\nTransformer [ 63 ] was introduced in 2017 for NLP tasks. Compared with LSTM, Transformer can not only train in parallel but also achieve better performance. Then many famous NLP models are built on Transformer, including GPT series [ 44 ,45 ,3 ,42 ], BERT [ 12 ], T5 [ 47 ], and OPT [80 ]. For the application of the Transformer in vision tasks, Vision Transformer (ViT) is definitely the seminal work, showing that Transformer can achieve impressive performance after large-scale supervised training. Followup works [ 61 ,76 ,65 ,66 ,18 ] like Swin [ 37 ] continually improve model performance, achieving new state-of-the-art on various vision tasks. These results seem to tell us “Attention is all you need” [ 63 ].  \n\nBut it is not that simple. ViT variants like DeiT usually adopt modern training procedures including various advanced techniques of data augmentation [ 10 ,9 ,79 ,77 ,83 ], regularization [ 57 ,25 ] and optimizers [ 28 ,39 ]. Wightman et al. find that with similar training procedures, the performance of ResNet can be largely improved. Besides, Yu et al. [74 ] argue that the general architecture instead of attention plays a key role in model performance. Han et al. [19 ] find by replacing attention in Swin with regular or dynamic depthwise convolution, the model can also obtain comparable performance. ConvNeXt [ 38 ], a remarkable work, modernizes ResNet into an advanced version with some designs from ViTs, and the resulting models consistently outperform Swin [ 37 ]. Other works like RepLKNet [13 ], VAN [ 17 ], FocalNets [ 72 ], HorNet [ 49 ], SLKNet [ 36 ], ConvFormer [ 75 ], Conv2Former [ 22 ], and InternImage [ 64 ]constantly improve performance of CNNs. Despite the high performance obtained, these models neglect efficiency, exhibiting lower speed than ConvNeXt. Actually, ConvNeXt is also not an efficient model compared with ResNet. We argue that CNN models should keep the original advantage of efficiency. Thus, in this paper, we aim to improve the model efficiency of CNNs while maintaining high performance.\n\n# 2.2. Convolution with large kernels.\nWell-known works, like AlexNet [ 30 ] and Inception v1 [56 ] already utilize large kernels up to $11\\times11$ and $7\\times7$ , respectively. To improve the efficiency of large kernels, VGG [53 ] proposes to heavily s $3\\times3$ convolutions e In$k\\times1$ $k\\times k$ tant for semantic segmentation and they decompose large ××on v3 [ staking sequentially. For depthwise convoluti [. Besides, Peng 60 ] splits kernels into several groups from 57 ] factorizes et al. $k\\times k$ find that large kernels are impor×convolution into $1\\times k$ $3\\times3$ ××and ixto kernels similar to Inception v3 [ 57 ]. Witnessing the success of Transformer in vision tasks [ 16 ,65 ,37 ], large-kernel convolution is more emphasized since it can offer a large receptive field to imitate attention [ 19 ,38 ]. For example, ConvNeXt adopts kernel size of $7\\times7$ for depthwise convolution by default. To employ larger kernels, RepLKNet [ 13 ]proposes to utilize structural re-parameterization techniques [78 ,14 ] to scale up kernel size to $31\\times31$ ; VAN [ 17 ] sequentially stacks large-kernel depth-wise convolution (DWConv) and depth-wise dilation convolution to obtain $21\\!\\times\\!21$ receptive filed; FocalNets employs a gating mechanism to fuse multi-level features from stacking depthwise convolutions; Recently, SLaK [ 36 ] fac es la ernel $k\\times k$ two small non-square kernels ( Different from these works, we do not aim to scale up larger $k\\!\\times\\!s$ ×and $s\\!\\times\\!k$ ×, where $s<k$ ). kernels. Instead, we target efficiency and decompose large kernels in a simple and speed-friendly way while keeping comparable performance.\n\n# 3. Method\n\n# 3.1. MetaNeXt\nFormulation of MetaNeXt Block. ConvNeXt [ 38 ] is a modern CNN model with simple architecture. For each ConvNeXt block, the input $X$ is first processed by a depthwise convolutioin to propagate information along spatial dimensions. We follow MetaFormer [ 74 ] to abstract the depthwise convolution as a token mixer which is responsible for spatial information interaction. Accordingly, as shown in the second subfigure in Figure 2 , the ConvNeXt is abstracted as MetaNeXt block. Formally, in a MetaNeXt block, its input $X$ is firstly processed as  \n\n$$\nX^{\\prime}=\\operatorname{TokenMixer}(X)\n$$  \n\nimport torch.nn as nn  \n\nAlgorithm 1 Inception Depthwise Convolution (PyTorchlike Code)   \n\n\n<html><body><table><tr><td>def</td><td>class InceptionDwConv2d(nn.Module): init__(self， in_channels,</td></tr><tr><td></td><td>square_kernel_size=3, band_kernel_size=11, branch_ratio=1/8): super().—init()</td></tr><tr><td></td><td>gc = int(in_channels * branch_ratio) # channel number of a convolutionbranch</td></tr><tr><td></td><td>self.dwconv_hw = nn.Conv2d(gc, gc, square_kernel_size, padding= square_kernel_size//2, groups=gc)</td></tr><tr><td></td><td>self.dwconv_w = nn.Conv2d(gc, gc, kernel_size =(l, band_kernel_size), padding=(0,</td></tr><tr><td></td><td>band_kernel_size//2), groups=gc) self.dwconv_h = nn.Conv2d(gc, gc,. kernel_size =(band_kernel_size, l), padding=(</td></tr><tr><td></td><td>band_kernel_size//2, 0)， groups=gc) self.split_indexes = (gc, gc, gc, in_channels -\"3*gc)</td></tr><tr><td></td><td>def forward(self，x): # B， C， H,， W = x.shape</td></tr><tr><td></td><td>x_hw， x_w， x_h, x_id = torch.split(x， self.</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td>split_indexes, dim=l)</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td>return torch.cat(</td></tr><tr><td></td><td></td></tr><tr><td></td><td>(self.dwconv_hw(x_hw）,</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td>self.dwconv_w(x_w),</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td>x_id),</td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td>self.dwconv_h(x_h),</td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td>dim=1)</td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr><tr><td></td><td></td></tr></table></body></html>  \n\nwhere $X,X^{\\prime}\\in\\mathbb{R}^{B\\times C\\times H\\times W}$ with $B,C,H$ and $W$ denoting batch size, channel number, height and width, respectively. Then the output from the token mixer is normalized,  \n\n$$\nY=\\operatorname{Norm}(X^{\\prime})\n$$  \n\nAfter normalization [ 27 ,1 ], the resulting features are inputted into an MLP module consisting of two fullyconnected layers with an activation function sandwiched between them, the same as feed-forward network in Transformer [ 63 ]. The two fully-connected layers can also be implemented by $1\\times1$ convolutions. Also, shortcut connection [ 20 ,54 ] is adopted. This process can be expressed by  \n\n$$\nY=\\mathrm{Conv}_{1\\times1}^{r C\\to C}\\{\\sigma[\\mathrm{Conv}_{1\\times1}^{C\\to r C}(Y)]\\}+X,\n$$  \n\nwhere $\\mathrm{Conv}_{k\\times k}^{C_{i}\\rightarrow C_{o}}$ means convolution with kernel size of $k\\times k$ , input channels o ×$C_{i}$ and output channels of $C_{o};r$ is the expansion ratio and σdenotes activation function.  \n\nComparison to MetaFormer block. As shown in Figure 2 , it can be found that MetaNeXt block shares similar modules with MetaFormer block [ 74 ], e.g. token mixer and MLP. Nevertheless, a critical differentiation between the two models lies in the number of shortcut connections [20 ,54 ]. MetaNeXt block implements a single shortcut connection, whereas the MetaFormer block incorporates two, one for the token mixer and the other for the MLP. From this aspect, MetaNeXt block can be regarded as a result of merging two residual sub-blocks from MetaFormer, thereby simplifying the overall architecture. As a result, the MetaNeXt architecture exhibits a higher speed compared to MetaFormer. However, this simpler design comes with a limitation: the token mixer component in MetaNeXt cannot be complicated ( e.g. , Attention) as shown in our experiments (Table 3 ).  \n\nInstantiation to ConvNeXt. As shown in Figure 2 , in ConvNeXt, the token mixer is simply implemented by a depthwise convolution,  \n\n$$\nX^{\\prime}=\\operatorname{TokenMixer}(X)=\\operatorname{DWConv}_{k\\times k}^{C\\to C}(X)\n$$  \n\nkernel size of where $\\mathrm{DWConv}_{k\\times k}^{C\\rightarrow C}$ $k\\times k$ ×. In ConvNeXt, denotes depthwise convolution with $k$ is set as 7 by default."}], "task_step_question_answer": "在未来的研究中，Transformer 的变体可能会进一步扩展到更多非序列数据的处理任务中，例如时间序列分析和图数据处理。最近的研究表明，Transformer 在时间序列预测任务中表现出色，例如 Temporal Fusion Transformer (TFT) 通过引入时间注意力机制，显著提升了多变量时间序列预测的准确性。在图数据处理方面，Graph Transformer 通过结合图神经网络（GNN）和图注意力机制，已经在社交网络分析和推荐系统中取得了显著成果。例如，Graph Transformer 在社交网络中的节点分类任务中，通过捕捉节点之间的复杂关系，显著提升了分类精度。此外，Transformer 在音频信号处理中的应用也取得了重要进展，如 Conformer 模型在语音识别任务中表现出色，通过结合卷积和自注意力机制，显著提升了语音识别的准确性。在多模态数据融合方面，CLIP 模型通过联合训练图像和文本编码器，实现了跨模态的语义理解，为图像检索和文本生成任务提供了新的解决方案。Perceiver 和 Flamingo 等变体进一步扩展了 Transformer 在多模态任务中的应用，通过处理复杂的多模态数据（如文本-图像-音频）来提升跨模态理解的能力。\n\nGAN 的变体可能会通过引入更复杂的生成器和判别器结构，进一步提升生成图像的质量和多样性。StyleGAN 通过引入风格迁移机制，能够生成更加逼真和多样化的图像，为艺术创作和图像编辑提供了新的工具。BigGAN 则通过增加模型容量和优化训练策略，生成了更高分辨率和更逼真的图像。这些改进不仅提升了图像生成的质量，还为医学图像合成和视频生成等任务提供了新的可能性。此外，GAN 在视频生成和 3D 模型生成领域也有广泛应用。例如，VideoGAN 通过引入时间一致性约束，能够生成高质量的视频序列，为视频编辑和虚拟现实应用提供了新的工具。3D-GAN 则通过结合生成对抗网络和 3D 卷积，能够生成逼真的 3D 模型，为游戏开发和虚拟现实应用提供了新的可能性。CycleGAN 和 StarGAN 等变体在风格迁移和图像修复任务中表现出色，通过改进生成器和判别器结构来提升生成图像的质量和多样性。\n\nBERT 的变体可能会在更多跨领域任务中得到应用，例如在生物信息学中，通过预训练模型捕捉蛋白质序列中的语义信息，辅助蛋白质功能预测和结构分析。最近的研究表明，BERT 在蛋白质序列分析中的应用已经取得了显著进展，例如 ProtBERT 通过预训练蛋白质序列，显著提升了蛋白质功能预测的准确性。在金融领域，BERT 可以用于情感分析和市场预测，通过分析新闻和社交媒体文本，预测股票市场的波动。例如，FinBERT 通过微调预训练模型，显著提升了金融文本情感分析的准确性，为市场预测提供了有力支持。此外，BERT 在法律文本分析和教育领域的自动评分系统中也有广泛应用。例如，Legal-BERT 通过预训练法律文本，显著提升了法律文本分类和检索的准确性。在教育领域，BERT-based essay scoring 系统通过分析学生作文的语义和结构，能够自动评估作文质量，为教育评估提供了新的工具。BioBERT 和 ClinicalBERT 等变体在医疗文本分析中的应用也取得了显著进展，通过提升疾病诊断和药物发现的性能，为医疗领域提供了新的支持。", "ref_task_step_id": ""}, "__type__": "task_step_node"}, "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa": {"__data__": {"id_": "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa", "metadata": {}, "relationships": {}, "hash": "", "start_task_context": "大模型MLA技术细节", "aemo_representation_context": "### 1. 分析近几年研究领域的技术框架与方法论\n在计算机科学相关研究领域，Transformer、GAN、BERT 等框架成为众多论文采用的核心技术。这些框架在不同任务中展现出强大的适应性，其方法论围绕着如何有效处理数据特征、优化模型结构以提升性能。例如，Transformer 基于自注意力机制，打破了传统序列模型的局限性，在自然语言处理和计算机视觉等多领域广泛应用；GAN 通过生成器与判别器的对抗训练，在图像生成等任务上取得显著成果；BERT 则通过预训练方式，极大提升了自然语言处理任务的性能。\n\n### 2. 研究论文中采用的主要框架在不同任务中的应用与变体\n - **Transformer**：在自然语言处理任务中，如机器翻译、文本分类，Transformer 架构不断演变，出现了诸如 ViT（Vision Transformer）等变体应用于计算机视觉任务，将图像视为序列进行处理，展现出跨领域的应用潜力。\n - **GAN**：在图像生成任务中，DCGAN（Deep Convolutional GAN）等变体通过改进网络结构，生成更逼真的图像；在医学图像合成、视频生成等领域也有应用，通过调整损失函数和网络架构适应不同任务需求。\n - **BERT**：除了基础的自然语言理解任务，还在信息检索、情感分析等任务中得到广泛应用，通过微调预训练模型适应特定任务，同时出现了 RoBERTa 等改进版本，优化预训练策略提升性能。\n\n### 3. 评估学术界的技术进步与局限性\n - **技术进步**：模型性能在多个任务上取得显著提升，例如在图像识别准确率、自然语言处理任务的 F1 值等指标上不断刷新记录。新的模型架构和训练方法不断涌现，推动了技术的快速发展。\n - **局限性**：依然存在模型偏差和数据依赖问题。模型在某些特定数据集上表现良好，但在其他数据集或现实场景中泛化能力不足。部分模型对大规模标注数据依赖严重，数据质量和数量影响模型性能，且模型解释性差，难以理解其决策过程。\n\n### 4. 探讨计算模型在不同数据集与应用场景下的适用性与泛化能力\n - **适用性**：不同模型在特定数据集和应用场景下有各自优势。例如，基于深度学习的模型在大规模、高维数据的图像和语音识别任务中表现出色；传统机器学习模型在小数据、简单任务中仍有应用价值。\n - **泛化能力**：尽管部分模型在特定领域取得成功，但在多领域、多模态数据融合的现实应用中，泛化能力面临挑战。多模态数据的异质性和复杂性使得模型难以有效提取和融合特征，限制了其在复杂现实场景中的应用。\n\n### 5. 分析最新算法的稳定性与容错性\n - **稳定性优化**：一些算法针对稳定性进行了优化，例如采用正则化技术、对抗训练等方法提高模型在复杂环境下的稳定性。在动态环境中，部分算法通过在线学习、自适应调整参数等方式保持性能稳定。\n - **大规模数据适应性**：在大规模数据处理上，部分算法通过分布式训练、模型压缩等技术提高计算效率和适应性。但仍有算法在处理大规模数据时面临内存、计算资源等限制，导致性能下降。\n\n### 6. 评估论文中提出的未来研究方向与挑战\n - **新研究问题**：提出了如提升模型可解释性、解决模型偏差和数据依赖、增强多模态数据融合能力等新研究问题。\n - **研究切入点**：从改进模型架构、优化训练算法、探索新的数据增强方法等方面寻找新的研究切入点。这些挑战促使研究者不断探索新的技术和方法，推动后续研究朝着更高效、更智能、更具泛化能力的方向发展。\n\n### 研究成果、方法创新性与应用价值总结\n - **研究成果**：在模型性能提升、新架构和算法提出等方面取得显著成果，推动了计算机科学多个领域的发展。\n - **方法创新性**：通过引入新的技术框架、改进训练方法和优化模型结构等方式，展现出诸多创新点，如自注意力机制、对抗训练等。\n - **应用价值**：在图像、自然语言处理、语音等多个领域有广泛应用，为智能安防、智能医疗、智能交通等现实场景提供技术支持，具有巨大的商业和社会价值。  ", "task_step_name": "评估学术界的技术进步与局限性", "task_step_description": "- **技术进步**：模型性能在多个任务上取得显著提升，例如在图像识别准确率、自然语言处理任务的 F1 值等指标上不断刷新记录。新的模型架构和训练方法不断涌现，推动了技术的快速发展。 - **局限性**：依然存在模型偏差和数据依赖问题。模型在某些特定数据集上表现良好，但在其他数据集或现实场景中泛化能力不足。部分模型对大规模标注数据依赖严重，数据质量和数量影响模型性能，且模型解释性差，难以理解其决策过程。", "task_step_level": "2", "task_step_question": "学术界在模型性能提升和新架构、训练方法涌现方面取得了技术进步，但存在模型偏差、数据依赖、泛化能力不足以及模型解释性差等局限性，那么如何在利用新架构和训练方法提升模型性能的同时，有效解决模型偏差和数据依赖问题，提高模型的泛化能力和解释性？ ", "task_step_question_context": [{"ref_id": "454847062641060886", "chunk_id": "6", "score": 0.302734375, "text": "# CFurther Discussions\nWe summarize some empirical observations as follows.  \n\n1) The CLIP with four training tricks yields about $4\\%$ improvement at Rank-1 in Table 1 of the main paper. It can inspire future works in which the model performance could be boosted by applying these training tricks.  \n\n2) Data augmentation and loss function are common technologies used in various methods. The investigation of more than 20 data augmentations and about 10 loss functions on performance in Tables 2-5 of the main paper provides valuable guidance on future works. Researchers can select proper and effective augmentations and losses into the model for improving performance.   \n3) We explore the internal properties and functionalities of the model for the first time. These results can light future works on model compression, so as to develop a more lightweight and effective TBPS method.   \n4) There are very little research on few-shot TBPS, while this paper makes a preliminary study on CLIP-based fewshot TBPS, providing valuable observation for future research direction."}, {"ref_id": "454846731731167836", "chunk_id": "9", "score": 0.2216796875, "text": "# 4.3. Backward-Congruent Re-ranking\nUnlike model ensemble, knowledge distillation attempts to explicitly align the behaviors of the new model to the old model during training . Alternatively, we propose BackwardCongruent Re-ranking (BCR), which does not impose any constraint to the training of the new model and only takes effect during inference .  \n\nRe-ranking is a popular approach in structured prediction to combine the strengths of two different models ( Collins & Koo ,2005 ;Socher et al. ,2013 ;Le & Zuidema ,2014 ;Do & Rehbein ,2020 ). It suggests to use one model as the candidate generator for creating a candidate pool and use the other model as the re-ranker for picking the best candidate. While previous work has been focused on developing powerful re-rankers for overall performance improvement, the purpose of BCR is to reduce model update regression. BCR treats the new model as the candidate generator and the old model as the re-ranker. Our motivations are two-fold. First, structured prediction models can produce a number of possible predictions. Second, different predictions may achieve similar error rates but differ by the mistakes they made. Among them, the most likely one according to the old model should have the least prediction flips. These make re-ranking particularly useful for structured prediction.  \n\nFormally, we have the old model and the new model parameterized by $\\phi_{\\mathrm{new}}$ and $\\phi_{\\mathrm{old}}$ respectively. For a given input $x$ ,the new model first generates a set of candidates $\\mathrm{GEN}_{\\phi_{\\mathrm{new}}}(x)$ .Then we choose the prediction $y^{\\ast}$ with the highest score computed by the old model.  \n\n$$\ny^{*}=\\operatorname*{arg\\,max}_{y\\in\\mathrm{GEN}_{\\phi_{\\mathrm{new}}}(x)}p_{\\phi_{\\mathrm{old}}}(y|x),\n$$  \n\nwhere $p_{\\phi_{\\mathrm{old}}}(y|x)$ is the old odel’s generation probability (score) of $y$ given the input xand GEN can be implemented by various decoding methods :  \n\n•Maximization-based Search The de facto decoding objective, particular for structured prediction tasks is, maximization-based search. This strategy is based on the assumption that the model assigns higher scores to better output. When finding the exact best $\\cdot k$ output is intractable, the common practice is to use beam search for approximation instead. Hence, we use the $k$ -best MST algorithm ( Zmigrod et al. ,2020 ;2021 ) for the biaffine parser and use beam search for other parsers.  \n\n•Top$k$ Sampling Truncated stochastic sampling such as top-k sampling ( Fan et al. ,2018 ;Radford et al. ,2019 ) is a popular alternative for generating multiple outputs in open-ended text generation tasks. At each decoding step, the top $k$ possible local predictions are selected and the sampling is based on their relative probabilities.  \n\n•Top $\\cdot p$ Sampling Similar to top$k$ sampling, top$\\boldsymbol{p}$ sampling ( Holtzman et al. ,2019 ) is another sampling-based decoding method. The only difference is that top$\\boldsymbol{p}$ sampling samples from the smallest set of top local predictions whose cumulative probability mass exceeds $p$ .  \n\n•Dropout$\\boldsymbol{p}$ Sampling We explore a special sampling method, dropout$\\cdot p$ sampling, that has attracted little attention in the literature. Dropout ( Srivastava et al. ,2014 ) is a regularization technique used in almost all modern neural network-based models. The key idea is to randomly drop some neurons from the neural network during training. Normally, dropout is turned off during inference. However, in dropout$\\cdot p$ sampling, we keep using dropout with dropout rate $p$ . Compared to other methods, dropout$\\boldsymbol{p}$ sampling is unique in that (1) it changes the scoring function instead of the decoding objective; (2) unlike traditional truncated sampling that conducts local sampling at each decoding step, it can be regarded as a global sampling. Dropout$\\boldsymbol{p}$ sampling also has a broader applicable scope than top$k$ and top$p$ sampling as the latter two are designed for sequence generation models.  \n\nDiscussion Following previous work ( Shen et al. ,2004 ;Yan et al. ,2021 ;Xie et al. ,2021 ), our discussion has been focused on handling one model update. However, BCR can be extended to handle multiple turns of model updates. To do so, one can keep the most recent $k$ models and use a weighted combination of their scores as the re-ranking metric. In practice, $k$ can be set to trade-off between performance and runtime cost.  \n\nOne downside of BCR is that we must maintain and deploy both the old and new models. Because the re-ranking step has less time complexity compared to the decoding algorithms and the computation is fully parallelizable, this does not create much additional inference latency. However, the increase in memory footprint does entail an increase in inference hosting cost. One remedy could be to use knowldge distillation to distill the old model(s) into a smaller one, which we leave for future work.  \n\nMeasuring and Reducing Model Update Regression in Structured Prediction for NLP   \n\n\n<html><body><table><tr><td rowspan=\"3\"></td><td colspan=\"4\">deepbiafdeepbiaf</td><td colspan=\"3\">stackptrstackptr</td><td colspan=\"3\">deepbiaf=stackptr</td></tr><tr><td colspan=\"2\">UCM</td><td>UAS</td><td></td><td>UCM</td><td>UAS</td><td></td><td>UCM</td><td>UAS</td><td></td></tr><tr><td>NFR</td><td>NFIA ACC NFR</td><td></td><td>NFIACCNFR</td><td>NFIACC NFR</td><td>NFIACC</td><td>NFR</td><td></td><td>NFI ACC NFR</td><td>NFI ACC</td></tr><tr><td>PIO</td><td></td><td>-63.88</td><td></td><td>-91.76</td><td>-65.83</td><td>-91.81</td><td></td><td>-63.88</td><td></td><td>-91.76</td></tr><tr><td>Untreated</td><td></td><td>3.6910.2563.97</td><td>1.66 19.85 91.64</td><td></td><td>3.43 10.1066.03</td><td>1.6720.20 91.73</td><td></td><td>3.73 10.98 66.03</td><td></td><td>2.1025.37 91.73</td></tr><tr><td>Distillation</td><td>3.82</td><td>10.62 264.00</td><td>1.62</td><td>19.45 91.67</td><td>3.57 10.40 65.66</td><td>1.7020.4991.70</td><td>3.62</td><td>10.68 66.11</td><td>2.03 24.71</td><td>91.78</td></tr><tr><td>→Ensemble</td><td>2.51</td><td>7.14 64.81</td><td>1.02 12.9792.10</td><td>2.21</td><td>6.74 67.21</td><td>1.1114.3092.21</td><td>2.83</td><td>8.62 67.21</td><td>1.62 20.75</td><td>92.21</td></tr><tr><td>BCR</td><td>1.12</td><td>3.1464.36</td><td>0.84 10.21 91.78</td><td></td><td>1.05 3.12 66.45</td><td>0.84 10.3091.88</td><td>1.20</td><td>3.60 66.76</td><td>1.11 13.87</td><td>92.01</td></tr></table></body></html>"}, {"ref_id": "454984230919739446", "chunk_id": "8", "score": 0.197265625, "text": "# Conclusion\nIn this paper, we tackle two challenges in incremental novel class discovery: how to leverage novel unlabeled data sets for effective training guidance and how to prevent catastrophic forgetting of previous knowledge. We propose Triple Comparison and Probability Regularization to control the probability discrepancy and diversity of categories for adaptive category assignment. In addition, we design a hybrid structure, Adaptive Model Merging, which preserves the previous knowledge by reducing the novel branch’s interference with the old classes. Extensive experiments on classiNCD demonstrate that our method can significantly outperform the existing methods without increasing the computational cost.\n\n# Acknowledgements\nThe study was funded by the National Natural Science Foundation of China under contracts No. 62332002, No. 62027804, No. 62088102, No. 61825101, No. 62372010, and No. 62202010, and the major key project of the Peng Cheng Laboratory (PCL2021A13). Computing support was provided by Pengcheng Cloudbrain."}], "task_step_question_answer": "在深入分析技术进步与局限性的基础上，进一步探讨这些研究成果在实际应用中的转化情况。例如，Transformer架构在自然语言处理领域的应用已广泛渗透到智能客服、机器翻译等实际场景，显著提升了用户体验和服务效率。然而，其在处理复杂语境和多义词时的表现仍不尽如人意，暴露出模型在细粒度语义理解上的不足。GAN技术在图像生成领域的应用虽取得了显著成果，但在医学图像合成等高精度要求场景中，生成图像的细节还原度和真实性仍有待提升。BERT模型在信息检索和情感分析任务中的应用广泛，但在处理长文本和低资源语言时，性能显著下降，限制了其应用范围。\n\n此外，学术界与工业界的合作日益紧密，许多研究成果通过开源项目和商业应用快速转化为实际生产力。然而，转化过程中也面临诸多挑战，如模型在实际环境中的鲁棒性、数据隐私保护等问题。未来研究需更加注重模型的实用性和普适性，探索在有限资源和复杂环境下的高效算法。同时，跨学科合作如结合认知科学、心理学等领域的研究成果，可能为解决模型解释性和泛化能力问题提供新的思路。例如，通过引入认知科学的理论，可以设计出更符合人类认知规律的模型架构，从而提升模型在复杂任务中的表现。此外，心理学的研究可以帮助我们更好地理解用户需求，设计出更人性化的智能系统。", "ref_task_step_id": ""}, "__type__": "task_step_node"}, "02c99ed3-dc6a-4b2d-bbff-109a51351344": {"__data__": {"id_": "02c99ed3-dc6a-4b2d-bbff-109a51351344", "metadata": {}, "relationships": {}, "hash": "", "start_task_context": "大模型MLA技术细节", "aemo_representation_context": "### 1. 分析近几年研究领域的技术框架与方法论\n在计算机科学相关研究领域，Transformer、GAN、BERT 等框架成为众多论文采用的核心技术。这些框架在不同任务中展现出强大的适应性，其方法论围绕着如何有效处理数据特征、优化模型结构以提升性能。例如，Transformer 基于自注意力机制，打破了传统序列模型的局限性，在自然语言处理和计算机视觉等多领域广泛应用；GAN 通过生成器与判别器的对抗训练，在图像生成等任务上取得显著成果；BERT 则通过预训练方式，极大提升了自然语言处理任务的性能。\n\n### 2. 研究论文中采用的主要框架在不同任务中的应用与变体\n - **Transformer**：在自然语言处理任务中，如机器翻译、文本分类，Transformer 架构不断演变，出现了诸如 ViT（Vision Transformer）等变体应用于计算机视觉任务，将图像视为序列进行处理，展现出跨领域的应用潜力。\n - **GAN**：在图像生成任务中，DCGAN（Deep Convolutional GAN）等变体通过改进网络结构，生成更逼真的图像；在医学图像合成、视频生成等领域也有应用，通过调整损失函数和网络架构适应不同任务需求。\n - **BERT**：除了基础的自然语言理解任务，还在信息检索、情感分析等任务中得到广泛应用，通过微调预训练模型适应特定任务，同时出现了 RoBERTa 等改进版本，优化预训练策略提升性能。\n\n### 3. 评估学术界的技术进步与局限性\n - **技术进步**：模型性能在多个任务上取得显著提升，例如在图像识别准确率、自然语言处理任务的 F1 值等指标上不断刷新记录。新的模型架构和训练方法不断涌现，推动了技术的快速发展。\n - **局限性**：依然存在模型偏差和数据依赖问题。模型在某些特定数据集上表现良好，但在其他数据集或现实场景中泛化能力不足。部分模型对大规模标注数据依赖严重，数据质量和数量影响模型性能，且模型解释性差，难以理解其决策过程。\n\n### 4. 探讨计算模型在不同数据集与应用场景下的适用性与泛化能力\n - **适用性**：不同模型在特定数据集和应用场景下有各自优势。例如，基于深度学习的模型在大规模、高维数据的图像和语音识别任务中表现出色；传统机器学习模型在小数据、简单任务中仍有应用价值。\n - **泛化能力**：尽管部分模型在特定领域取得成功，但在多领域、多模态数据融合的现实应用中，泛化能力面临挑战。多模态数据的异质性和复杂性使得模型难以有效提取和融合特征，限制了其在复杂现实场景中的应用。\n\n### 5. 分析最新算法的稳定性与容错性\n - **稳定性优化**：一些算法针对稳定性进行了优化，例如采用正则化技术、对抗训练等方法提高模型在复杂环境下的稳定性。在动态环境中，部分算法通过在线学习、自适应调整参数等方式保持性能稳定。\n - **大规模数据适应性**：在大规模数据处理上，部分算法通过分布式训练、模型压缩等技术提高计算效率和适应性。但仍有算法在处理大规模数据时面临内存、计算资源等限制，导致性能下降。\n\n### 6. 评估论文中提出的未来研究方向与挑战\n - **新研究问题**：提出了如提升模型可解释性、解决模型偏差和数据依赖、增强多模态数据融合能力等新研究问题。\n - **研究切入点**：从改进模型架构、优化训练算法、探索新的数据增强方法等方面寻找新的研究切入点。这些挑战促使研究者不断探索新的技术和方法，推动后续研究朝着更高效、更智能、更具泛化能力的方向发展。\n\n### 研究成果、方法创新性与应用价值总结\n - **研究成果**：在模型性能提升、新架构和算法提出等方面取得显著成果，推动了计算机科学多个领域的发展。\n - **方法创新性**：通过引入新的技术框架、改进训练方法和优化模型结构等方式，展现出诸多创新点，如自注意力机制、对抗训练等。\n - **应用价值**：在图像、自然语言处理、语音等多个领域有广泛应用，为智能安防、智能医疗、智能交通等现实场景提供技术支持，具有巨大的商业和社会价值。  ", "task_step_name": "探讨计算模型在不同数据集与应用场景下的适用性与泛化能力", "task_step_description": "- **适用性**：不同模型在特定数据集和应用场景下有各自优势。例如，基于深度学习的模型在大规模、高维数据的图像和语音识别任务中表现出色；传统机器学习模型在小数据、简单任务中仍有应用价值。 - **泛化能力**：尽管部分模型在特定领域取得成功，但在多领域、多模态数据融合的现实应用中，泛化能力面临挑战。多模态数据的异质性和复杂性使得模型难以有效提取和融合特征，限制了其在复杂现实场景中的应用。", "task_step_level": "3", "task_step_question": "在多领域、多模态数据融合的现实应用场景下，为提升计算模型的泛化能力，有哪些具体方法可以有效应对多模态数据的异质性和复杂性，以实现更高效的特征提取与融合？  ", "task_step_question_context": [{"ref_id": "454984266138264960", "chunk_id": "2", "score": 0.52734375, "text": "# 1 Introduction\nDomain generalization (DG) and adaptation (DA) significantly improve the robustness and adaptability of machine learning models, enabling them to perform effectively across diverse and previously unseen environments [ 61 ]. This enhancement ensures that the models are more readily transferable to real-world applications, such as autonomous driving [ 13 ,15 ] and action recognition [ 10 ]. To address the challenges posed by distribution shifts, a wide range of DG and DA algorithms have been introduced. These algorithms include domain-invariant feature learning [ 46 ], feature disentanglement [ 52 ], data augmentation [ 64 ], and meta-learning [ 37 ]. However, the majority of these algorithms are designed for unimodal data, such as images [ 36 ] or time series data [ 44 ]. With the increasing need to process multimodal data in real-world applications [ 5 ,10 ], it has become imperative to extend these methods to support multimodal DG across a variety of modalities, including audio-video [ 31 ,65 ] and vision-language [ 29 ,54 ]. In response to this challenge, several approaches, such as RNA-Net [ 53 ] and SimMMDG [ 14 ], have been proposed to address the complexities of multimodal DG.  \n\nTable 1: Illustration of the difference between the proposed Multimodal Open-Set DG and DA and other related tasks. $\\mathcal{D}_{t}$ denote the target domains. $C_{s}$ and $\\boldsymbol{c}_{t}$ denote the label space of source and target domains, respectively.   \n\n\n<html><body><table><tr><td>Task</td><td></td><td>Only one modality?Need C。=Ct?Access to Dt?</td><td></td></tr><tr><td>DomainAdaptation [18]</td><td></td><td></td><td></td></tr><tr><td>Domain Generalization[6]</td><td></td><td></td><td></td></tr><tr><td>Open-Set Domain Adaptation[41]</td><td></td><td></td><td></td></tr><tr><td>Open-SetDomain Generalization[57]</td><td></td><td>X</td><td></td></tr><tr><td>Multimodal Domain Adaptation [47]</td><td>×</td><td></td><td></td></tr><tr><td>MultimodalDomain Generalization14]</td><td></td><td></td><td></td></tr><tr><td>Multimodal Open-Set Domain Adaptation 1 (proposed)</td><td></td><td>X</td><td></td></tr><tr><td>Multimodal 1Open-SetDomain Generalization (proposed)</td><td>×</td><td></td><td></td></tr></table></body></html>  \n\nAn inherent assumption in both DG and multimodal DG is the alignment of label spaces between source and target domains. However, real-world applications, such as autonomous driving [ 3 ], often feature target domains with novel categories not present in the source label space. As a result, the learned model may struggle with samples from these novel categories, significantly degrading the robustness of existing DG and multimodal DG methods. This setup, where the target domain contains unknown or open classes not seen in source domains, is referred to as open-set DG. Several unimodal open-set DG approaches, including DAML [ 57 ] and MEDIC [ 62 ], have been developed within the meta-learning framework to tackle this issue. CrossMatch [ 67 ] utilizes an adversarial data augmentation strategy to generate auxiliary samples beyond the source label space. Yet, none specifically address the challenge of Multimodal Open-Set DG (MMOSDG), which is the primary focus of this paper. The goal of MM-OSDG is to train a model using data from several source domains across two or more modalities, enabling it to effectively generalize to previously unseen target domains with the same modalities and including samples from unknown classes. The key challenge of MM-OSDG is to efficiently leverage complementary information from diverse modalities to improve generalization and open-class detection performance, areas where current unimodal open-set DG approaches fall short. We summarize the distinctions between our proposed MM-OSDG problem and various related problems in Tab. 1 .  \n\nTo address the challenge of domain shift in unimodal setups, several studies have explored the integration of self-supervision techniques for DG and DA [ 4 ,6 ]. This approach involves addressing a self-supervised pretext task concurrently with the primary supervised problem, which leads to the learning of resilient cross-domain features conducive to robust generalization. Additionally, recent research has demonstrated the utility of leveraging outputs from self-supervised models for anomaly detection, facilitating the discrimination between normal and anomalous samples [ 2 ,21 ] – a scenario similar to open-class detection. In particular, Rotation-based Open Set (ROS) [ 4 ] explores rotation recognition as a self-supervised task for both unknown class detection and domain adaptation. Meanwhile, results from MOOD [ 39 ] illustrate that a reconstruction-based pretext task forces the network to learn the real data distribution of the indistribution (ID) samples, thereby enlarging the divergence between the out-ofdistribution (OOD) and ID samples.  \n\nInspired by the success of the self-supervised pretext tasks in robust feature learning and OOD sample detection in unimodal setups, we propose a novel approach referred to as MOOSA to address the Multim odal OpenSet Domain Generalization and A daptation problems using multimodal self-supervised tasks. Specifically, we propose a generative task, termed Masked Cross-modal Translation, and a contrastive task, denoted as Multimodal Jigsaw Puzzles. These tasks are complementary to each other to effectively learn multimodal representative features conducive to both generalization and open-class detection. An entropy weighting mechanism is further introduced to balance the loss across different modalities. Additionally, our methodology is extended to handle the Multimodal Open-Set Domain Adaptation (MM-OSDA) problem in scenarios where unlabeled target data is available. The efficacy of the proposed approach is thoroughly validated through extensive experiments conducted on two multimodal DG benchmark datasets: EPIC-Kitchens [ 10 ] and Human-AnimalCartoon (HAC) [ 14 ]. Our contributions can be summarized as follows:  \n\n–We delve into the unexplored area of Multimodal Open-Set Domain Generalization, a concept with significant implications for real-world applications. It requires a model trained on diverse source domains to generalize effectively to new, unseen target domains, which share the same modalities but include samples from previously unknown classes.  \n\n–To tackle MM-OSDG, we introduce two complementary multimodal selfsupervised tasks – Masked Cross-modal Translation and Multimodal Jigsaw Puzzles – along with an entropy weighting mechanism. We also extend our method to the novel Multimodal Open-Set Domain Adaptation setup.  \n\n–The efficacy and versatility of our proposed approach are validated through extensive experiments conducted across MM-OSDG, MM-OSDA, and Multimodal Closed-Set DG settings."}, {"ref_id": "454846353205433616", "chunk_id": "1", "score": 0.337890625, "text": "# 2 Related Work\nDomain Generalization. Generalizing a well-trained model to novel environments with different data distributions is a challenging and long-standing machine learning problem [ 81 ,69 ]. Current state-of-the-art DG approaches can be roughly categorized into four types. (1) Feature Alignment. Bridging the domain gap through statistic matching and adversarial learning [ 38 ,36 ,45 ] provides invariant representations, which are expected to be shared by novel domains. A major defect is that the learned representations is prone to mix common and domain-specific components, potentially resulting in strong bias towards spurious relations. (2) Feature Disentanglement. To address the above issue, disentangling latent feature into two disjoint parts has attract a great surge of interest. Prevailing approaches [ 54 ,53 ,16 ,44 ,61 ,40 ] resort to causal graphs [ 50 ] to explicitly identify causal and non-causal factors with theoretical guarantees. If this could be perfectly achieved, learned models will generalize well under any circumstances. However, these theoretical results require strong assumptions, e.g., the degree of diversity between causal and non-causal factors and the presence of an estimated causal graph [ 62 ], or a priori knowledge about the combinations of latent factors, e.g., distribution of values for a certain attribute. The complex combinations of many realworld cases ( e.g., DomainNet [ 52 ]) greatly impede the practical uses. In that sense, a principled disentanglement solution is hard to be reached. (3) Data/Feature Augmentation. A simple yet effective approach is to augment the diversity of data or feature so as to avoid overfitting to training data [ 67 ,75 ,48 ,84 ,74 ,8 ,78 ,13 ]. Among them, learning and imposing heuristic style transmission strategies take the dominant positions, while explicitly separating and recombination images remain the boundary to explore. (4) Meta-Learning. Some of recent works [ 33 ,39 ,34 ,17 ,41 ,14 ] simulate the distribution shifts between seen and unseen environments by using meta-learning [ 21 ], which splits the training data into meta-train and meta-test domains.  \n\nDespite a proliferation of DG approaches, Wiles et al. [71 ] reveal that the best DG methods are not consistent over different shifts and datasets in which disentangling offers limited improvements in most real-world scenarios. In addition, Gulrajani and Lopez-Paz [ 23 ] cast doubt on the progress that have been made by comparing to a standard empirical risk minimization baseline, showing that conventional domain-invariant methods [ 60 ,22 ] exhibit robust improvements. In this work, we embrace the strengths of cross-domain invariance by considering a more fine-grained and stable property— structural invariance —which is evaluated on a number of challenging benchmarks.  \n\nData Mixing. Mixing data, such as Mixup [ 77 ,66 ] and its various variants, has shown compelling results in standard supervised and semi-supervised learning. Mixup operations aim to conduct data interpolation via convex combinations of pairs of images and their labels. Instead, our CDM generates diverse training samples by replacing the background of a certain image with a randomly cropped patch from other images but keeps its object label fixed. CutMix [ 76 ] replaces a regularly-shaped image region with a patch from another training image and proportionally mix their ground-truth labels. CutPaste [ 31 ] cuts an image patch and randomly pastes it at an another image. BackErase [ 56 ]uses the object annotations to copy and pastes foreground objects on a background image. Compared to the aforementioned methods that cut a regularly-shaped image patch [ 76 ,31 ] or rely on ground-truth object labels [ 56 ], the proposed CDM simultaneously leverage the category and domain information to derive an irregularly-shaped foreground regions while avoiding fine-grained annotations.  \n\nCross-Domain Invariance. Seeking cross-domain invariance is crucial for out-of-distribution generalization problems, such as Unsupervised Domain Adaptation (UDA) [ 49 ] and DG. Traditional methods typically resort to statistical distribution divergence, such as maximum mean discrepancy [ 43 ] and second-order moment [ 60 ], for measuring domain-wise distribution shifts. More recently, a promising approach is to utilize the concept of class prototype for enforcing semantic consistency across domains [ 73 ,12 ,10 ]. This line of research has also been extensively explored in various downstream tasks. However, we argue that no matter domain- or class-wise invariance cannot guarantee the generalizable representations especially when encountering unseen test environments.  \n\n  \nFigure 2: The pip e of e proposed MiRe . Assume that we have two domains $\\mathcal{D}_{1}$ and $\\mathcal{D}_{2}$ , CDM augments them to performs feature aggregation based on the semantic topology in previous iteration and their local D$\\mathcal{D}_{1}^{\\prime}$ and D$\\mathcal{D}_{2}^{\\prime}$ . In each iteration of ASTR, the embedding feature of each local instance adjacent relations ( step 1 ). Then, global anchor features are updated based on the aggregated local features ( step 2 ). Finally, a bipartite graph learning procedure is imposed on the top of semantic topology to perform between-domain relational reasoning and induce structural invariance ( step 3 ).  \n\nSuch an invariance may be susceptible to include some misleading spurious correlation, such as wrongly associating an foreground object with specific background. The justification is that the topological structure of these prototypes is unexplored, making them being sensitive to the change of environments [ 44 ,9 ,79 ]. By contrast, the proposed MiRe models the graphical structures of different semantic anchors by means of feature aggregation and message-passing."}, {"ref_id": "454848837592725570", "chunk_id": "1", "score": 0.2265625, "text": "# 1. Introduction\nWith the rapid development of informatization, data is often collected by various social media or views. For instance, a 3D object can be described from different angles; a news event is reported from different sources; and an image can be characterized by different types of feature sets, e.g., SIFT, LBP, and HoG. Such an instance object, which is described from multiple views, is referred to as multi-view data. Multi-view clustering (MVC) [ 6 ], i.e., unsupervisedly fusing the multi-view data to aid differentiate crucial grouping, is a fundamental task in the fields of data mining, pattern recognition, etc, but it remains a challenging problem.  \n\nTraditional multi-view clustering methods [ 7 ] include matrix decomposition methods, graph-based multi-view methods, and subspace-based multi-view methods. The goal of these methods is to obtain a high-quality consensus graph or subspace self-representation matrix by various regularization constraints in order to improve the performance of clustering. However, most of them directly operate on the original multiview features or specified kernel features, which usually include noises and redundancy information during the collection or kernel space selection processes, moreover harmful to the clustering tasks.  \n\nDeep neural networks have demonstrated excellent performance in data feature representation for many vision tasks. Deep clustering methods also draw more attention to researchers [ 1 ,9 ,40 ,50 –52 ]. These methods efficiently learn the feature presentation of each view using a viewspecific encoder network, and fuse these learnt representations from all views to obtain a consensus representation that can be divided into different categories by a clustering module. To reduce the influence of view-private information on clustering, these methods designed different alignment models. For example, some methods align the representation distributions or label distributions from different views by KL divergence [ 14 ]. They might be hard to distinguish between clusters, since a category from one view might be aligned with a different category in another view. Some methods align the representation from different views by contrastive learning. Despite these models have achieved significant improvement in MVC task, the following issues still exist: 1) Almost all existing deep MVC methods (such as [ 38 ,40 ,49 ]) are based on view-wise fusion models, such as weighted-sum fusion of all views or concatenating fusion of all views, which makes it difficult to obtain discriminative consensus representations from multiple views, since a view or several views of a sample might contain too much noise or be missing in the collection process. 2) These alignment methods (such as [ 38 ,51 ]) based on contrastive learning usually distinguish the positive pair and negative pair from the sample-level. That is, they make inter-view presentations from the same sample as positive pair, and makes view representations from different samples as negative pair (including view representations from different samples in the same cluster), whereas it might be conflict with the clustering objective, where these representations of samples from the same cluster should be similar to each other.  \n\nIn the paper, a novel multi-view representation learning framework for clustering is proposed to alleviate the above problems. Motivated by the insight that the representations of samples from the same category are typically similar, we can learn consensus data representation from multiview data by other samples with a high structure relationship, moreover, in contrastive learning, we should increase the similarity of view representations from the same cluster, not only from the same sample, which is beneficial clustering tasks. To accomplish this, we first learn the view-specific representations to reconstruct the original data by leveraging the autoencoder model. Then, we design a global and cross-view feature aggregation module, which is capable of learning a global similarity relationship among samples, and obtaining a consensus representation based on the global similarity relationship of all samples. Furthermore, we leverage the learnt global structure relationship and consensus representation to establish the consistency with view-specific representations by contrastive learning, which minimizes the similarity between the representations with low structure relationship. Compared with previous work, our contributions are listed as follows:  \n\n• We propose a novel Global and Cross-view Feature Aggregation network framework for Multi-View Clustering (GCFAggMVC), which is able to fully explore the complementary of similar samples and addresses the problem of negative pairs from the different samples in the same cluster having low similarity score.  \n\n• Different from previous methods, we design a global and cross-view feature aggregation module, which integrates the transformer structure to learn the global structure relationship from different feature spaces, and then obtains the consensus representation based on the learnt global relationship, which fully exploits the complementary information of similar samples, thereby reduce the impact of noise and redundancy or sample missing among different views. Moreover, we align the consensus representation and the viewspecific representation by our global structure-guided contrastive learning module, which makes the representations of similar samples with highly structure relationship similarity.  \n\n• The proposed module is flexible multi-view data representation module, which can be also applied to incomplete multi-view data clustering tasks by plugging our module into the framework of other methods as the consensus representation of a sample with missing view data can be enhanced by these samples with high structure relationships. Experiments show that the proposed method achieves not only excellent performance in complete multi-view clustering tasks, but also works well in incomplete multi-view clustering tasks."}], "task_step_question_answer": "在金融领域，高频交易数据的复杂性和实时性要求模型具备快速响应和高效处理能力。深度学习模型如LSTM和Transformer已被用于预测市场趋势和风险管理，但由于金融数据的非平稳性和噪声，模型的泛化能力面临挑战。通过引入时间序列特征提取和异常检测技术，可以提升模型在金融数据上的表现。例如，Temporal Convolutional Networks (TCN) 通过捕捉时间序列中的长期依赖关系，显著提升了金融时间序列预测的准确性。此外，基于自监督学习的时间序列预训练方法，如TS-TCC，通过利用未标注数据增强模型的泛化能力，进一步提升了模型在金融数据上的表现。这些方法通过捕捉时间序列中的长期依赖关系和利用未标注数据，显著提升了模型在金融数据上的表现。\n\n在教育领域，个性化学习需求要求模型能够根据学生的学习行为和表现动态调整推荐策略。基于强化学习的个性化推荐系统已被应用于在线教育平台，但如何在不同学生群体中实现泛化仍是一个难题。通过引入元学习和多任务学习技术，可以提升模型在不同教育场景中的适应能力。例如，Meta-Learned Models for Education (MLME) 通过元学习框架，能够快速适应不同学生的学习模式，显著提升了推荐系统的个性化效果。此外，多任务学习框架如MTL-EDU，通过共享不同任务之间的知识，进一步提升了模型在教育数据上的泛化能力。这些方法通过快速适应不同学生的学习模式和共享任务知识，显著提升了模型的泛化能力。\n\n在零售领域，模型需要处理大量的用户行为数据和商品信息，以实现精准营销和库存管理。基于图神经网络的推荐系统在捕捉用户-商品交互关系上表现出色，但如何应对数据稀疏性和冷启动问题仍需进一步研究。通过引入知识图谱和跨域推荐技术，可以提升模型在零售场景中的泛化能力。例如，Knowledge-aware Graph Neural Networks (KGNN) 通过结合知识图谱和图神经网络，显著提升了推荐系统在冷启动场景中的表现。此外，跨域推荐技术如CDR-GNN，通过利用源域和目标域之间的共享知识，进一步提升了模型在零售数据上的泛化能力。这些方法通过结合知识图谱和利用源域与目标域之间的共享知识，显著提升了模型的泛化能力。\n\n在泛化能力的讨论中，迁移学习和领域自适应技术的具体实现和挑战值得深入探讨。迁移学习中的负迁移问题，即源域和目标域之间的差异导致模型性能下降，是一个常见挑战。通过引入领域对抗训练和特征对齐技术，可以有效缓解这一问题。领域自适应中，如何有效对齐不同领域的特征分布是关键。基于对抗生成网络的特征对齐方法已被证明在跨域任务中具有潜力，但如何平衡特征对齐和任务性能仍需进一步研究。例如，Domain-Adversarial Neural Networks (DANN) 通过引入领域对抗训练，显著提升了模型在跨域任务中的泛化能力。此外，基于生成对抗网络的特征对齐方法如GAN-ADA，通过生成目标域的特征分布，进一步提升了模型在跨域任务中的表现。这些方法通过引入领域对抗训练和生成目标域特征分布，显著提升了模型的泛化能力。\n\n多模态数据融合的深入分析可以进一步探讨具体的融合策略和技术。例如，在自动驾驶领域，如何设计有效的多模态注意力机制以融合视觉、雷达和激光雷达数据是一个关键问题。基于Transformer的多模态融合框架已被应用于多模态特征提取，但如何处理不同模态数据之间的不一致性和噪声仍需进一步研究。通过引入模态间一致性约束和噪声鲁棒性训练，可以提升模型在多模态数据上的表现。例如，Multimodal Transformer (MMT) 通过引入模态间一致性约束，显著提升了多模态数据融合的效果。此外，基于噪声鲁棒性训练的多模态融合方法如NR-MMT，通过增强模型对噪声数据的鲁棒性，进一步提升了模型在多模态数据上的表现。这些方法通过引入模态间一致性约束和增强模型对噪声数据的鲁棒性，显著提升了模型在多模态数据上的表现。\n\n模型的解释性和可解释性也是提升其在实际应用中可信度和接受度的重要因素。通过引入可解释性技术如LIME和SHAP，可以揭示模型的决策过程，帮助用户理解模型的预测结果。在医疗影像分析中，可解释性技术已被用于辅助医生理解模型的诊断依据，从而提升模型的临床接受度。例如，Explainable AI for Medical Imaging (XAI-MI) 通过结合LIME和SHAP技术，显著提升了医疗影像分析模型的可解释性。此外，基于注意力机制的可解释性方法如Attention-XAI，通过可视化模型的注意力分布，进一步提升了模型在医疗影像分析中的可解释性。这些方法通过结合LIME和SHAP技术以及可视化模型的注意力分布，显著提升了模型的可解释性。\n\n模型的稳定性和容错性在复杂环境中尤为重要。通过引入正则化和对抗训练技术，可以提高模型在异常数据或噪声数据下的稳定性。在金融领域，对抗训练已被用于提升模型在市场波动中的鲁棒性，从而确保模型在高风险环境中的稳定表现。例如，Adversarial Training for Financial Models (ATFM) 通过引入对抗训练，显著提升了金融模型在市场波动中的稳定性。此外，基于正则化的稳定性增强方法如Reg-ATFM，通过结合正则化和对抗训练，进一步提升了模型在金融数据上的稳定性。这些方法通过引入对抗训练和结合正则化，显著提升了模型在复杂环境中的稳定性。", "ref_task_step_id": ""}, "__type__": "task_step_node"}, "d04736cf-c340-414e-a4a7-79dcf60c22c3": {"__data__": {"id_": "d04736cf-c340-414e-a4a7-79dcf60c22c3", "metadata": {}, "relationships": {}, "hash": "", "start_task_context": "大模型MLA技术细节", "aemo_representation_context": "### 1. 分析近几年研究领域的技术框架与方法论\n在计算机科学相关研究领域，Transformer、GAN、BERT 等框架成为众多论文采用的核心技术。这些框架在不同任务中展现出强大的适应性，其方法论围绕着如何有效处理数据特征、优化模型结构以提升性能。例如，Transformer 基于自注意力机制，打破了传统序列模型的局限性，在自然语言处理和计算机视觉等多领域广泛应用；GAN 通过生成器与判别器的对抗训练，在图像生成等任务上取得显著成果；BERT 则通过预训练方式，极大提升了自然语言处理任务的性能。\n\n### 2. 研究论文中采用的主要框架在不同任务中的应用与变体\n - **Transformer**：在自然语言处理任务中，如机器翻译、文本分类，Transformer 架构不断演变，出现了诸如 ViT（Vision Transformer）等变体应用于计算机视觉任务，将图像视为序列进行处理，展现出跨领域的应用潜力。\n - **GAN**：在图像生成任务中，DCGAN（Deep Convolutional GAN）等变体通过改进网络结构，生成更逼真的图像；在医学图像合成、视频生成等领域也有应用，通过调整损失函数和网络架构适应不同任务需求。\n - **BERT**：除了基础的自然语言理解任务，还在信息检索、情感分析等任务中得到广泛应用，通过微调预训练模型适应特定任务，同时出现了 RoBERTa 等改进版本，优化预训练策略提升性能。\n\n### 3. 评估学术界的技术进步与局限性\n - **技术进步**：模型性能在多个任务上取得显著提升，例如在图像识别准确率、自然语言处理任务的 F1 值等指标上不断刷新记录。新的模型架构和训练方法不断涌现，推动了技术的快速发展。\n - **局限性**：依然存在模型偏差和数据依赖问题。模型在某些特定数据集上表现良好，但在其他数据集或现实场景中泛化能力不足。部分模型对大规模标注数据依赖严重，数据质量和数量影响模型性能，且模型解释性差，难以理解其决策过程。\n\n### 4. 探讨计算模型在不同数据集与应用场景下的适用性与泛化能力\n - **适用性**：不同模型在特定数据集和应用场景下有各自优势。例如，基于深度学习的模型在大规模、高维数据的图像和语音识别任务中表现出色；传统机器学习模型在小数据、简单任务中仍有应用价值。\n - **泛化能力**：尽管部分模型在特定领域取得成功，但在多领域、多模态数据融合的现实应用中，泛化能力面临挑战。多模态数据的异质性和复杂性使得模型难以有效提取和融合特征，限制了其在复杂现实场景中的应用。\n\n### 5. 分析最新算法的稳定性与容错性\n - **稳定性优化**：一些算法针对稳定性进行了优化，例如采用正则化技术、对抗训练等方法提高模型在复杂环境下的稳定性。在动态环境中，部分算法通过在线学习、自适应调整参数等方式保持性能稳定。\n - **大规模数据适应性**：在大规模数据处理上，部分算法通过分布式训练、模型压缩等技术提高计算效率和适应性。但仍有算法在处理大规模数据时面临内存、计算资源等限制，导致性能下降。\n\n### 6. 评估论文中提出的未来研究方向与挑战\n - **新研究问题**：提出了如提升模型可解释性、解决模型偏差和数据依赖、增强多模态数据融合能力等新研究问题。\n - **研究切入点**：从改进模型架构、优化训练算法、探索新的数据增强方法等方面寻找新的研究切入点。这些挑战促使研究者不断探索新的技术和方法，推动后续研究朝着更高效、更智能、更具泛化能力的方向发展。\n\n### 研究成果、方法创新性与应用价值总结\n - **研究成果**：在模型性能提升、新架构和算法提出等方面取得显著成果，推动了计算机科学多个领域的发展。\n - **方法创新性**：通过引入新的技术框架、改进训练方法和优化模型结构等方式，展现出诸多创新点，如自注意力机制、对抗训练等。\n - **应用价值**：在图像、自然语言处理、语音等多个领域有广泛应用，为智能安防、智能医疗、智能交通等现实场景提供技术支持，具有巨大的商业和社会价值。  ", "task_step_name": "分析最新算法的稳定性与容错性", "task_step_description": "- **稳定性优化**：一些算法针对稳定性进行了优化，例如采用正则化技术、对抗训练等方法提高模型在复杂环境下的稳定性。在动态环境中，部分算法通过在线学习、自适应调整参数等方式保持性能稳定。 - **大规模数据适应性**：在大规模数据处理上，部分算法通过分布式训练、模型压缩等技术提高计算效率和适应性。但仍有算法在处理大规模数据时面临内存、计算资源等限制，导致性能下降。", "task_step_level": "4", "task_step_question": "在处理大规模数据时，那些面临内存和计算资源限制导致性能下降的算法，是否可以借鉴采用正则化技术、对抗训练等稳定性优化方法来提升在大规模数据环境下的稳定性和适应性？ ", "task_step_question_context": [{"ref_id": "454848769189392150", "chunk_id": "4", "score": 0.185546875, "text": "# 3.2 SEPARATING BATCH STATISTICS IS NOT NECESSARY\nBatchNorm is a widely used normalization layer shown to improve performance and training stability of image classifiers ( Ioffe & Szegedy ,2015 ). We recall that a BatchNorm layer, given a batch as input, first normalizes it by subtracting the mean and dividing by the standard deviation computed over the entire batch, then it applies an affine transformation, with learnable scale and offset parameters. During training, it accumulates these so-called batch statistics to use during test time, so that the output of the classifier for each image is independent of the other images in the batch. The batch statistics can be seen an approximation of the statistics over the image distribution.  \n\nXie et al. (2019a ) show that optimizing the co-training loss in Eq. 1 can yield worse results on clean images than simple nominal training. This is especially the case when the network has a low capacity or the attack (i.e., the inner maximization) is too strong (such as using a large perturbation radius $\\epsilon$ ). To solve this issue, they propose AdvProp, which consists in using distinct BatchNorm layers for clean and adversarial images. They argue that “maintaining one set of [BatchNorm] statistics results in incorrect statistics estimation” , which could be the reason for the performance degradation. We note that using two sets of BatchNorm layers for the clean and adversarial samples as in AdvProp creates two sets of batch statistics but also two sets of learnable scale and offset parameters. In the following we investigate whether having separate batch statistics is a necessary condition for successful co-training.  \n\n  \nFigure 2: Dual parameters are enough. We report the clean (solid lines) and robust accuracy (dashed lines) over training steps of R ES NET -50 trained on I MAGE NET with the co-training loss of Eq. 1 $(\\epsilon=4/255)$ : for models with dual layers. Clean accuracy refers to the clean mode and the robust accuracy to the robust mode .Left panel. We compare models with different normalization layers with no domain-specific parameters (Shared BatchNorm, Shared LayerNorm, Shared GroupNorm) to Dual BatchNorm as proposed by Xie et al. (2019a ): regardless of the type of normalization, the robustness of classifiers without dual layers drops to (almost) zero at the end of training. Right panel. We use domain-specific normalization layers (Dual BatchNorm, Dual LayerNorm, Dual GroupNorm) and a model with BatchNorm with shared batch statistics but domain-specific scale and offset (DualParams BatchNorm): all models achieve high clean and robust accuracy.  \n\nFigure 2 shows the clean and robust accuracy of various model architectures as training progresses. The left panel demonstrates that, if we share both batch statistics and scales/offsets (Shared BatchNorm, orange curves), the robust accuracy (orange dashed line) quickly drops, far from the one obtained by AdvProp (Dual BatchNorm, blue curve) which is above $34\\%$ . However, if we use a single set of batch statistics but specific scales and offsets for clean and adversarial images, we can observe on the right panel of Figure 2 that the robust accuracy (DualParams BatchNorm, orange dashed line) matches the one (blue dashed line) obtained by AdvProp. This demonstrates that it is possible to achieve nominal and robust classification results similar to those of AdvProp without separate batch statistics.  \n\nFurthermore, there exist normalization layers such as LayerNorm ( Ba et al. ,2016 ) or GroupNorm (Wu & He ,2018 ) which do not use batch statistics, as their normalization step is done per sample and not per batch. Hence, according to the hypothesis of Xie et al. (2019a ), these types of normalization layer should not suffer from performance degradation. Nevertheless, the left panel of Figure 2 shows that their robust accuracy (green and red dashed lines) does not match the robust accuracy of AdvProp (Dual BatchNorm), and is unstable over training steps. However, by making the scales and offsets of LayerNorm and GroupNorm specific to clean and adversarial images, their robust accuracy matches that obtained with dual BatchNorm layers, as shown in the right panel of Figure 2 . This suggests that a key element to make the co-training loss of Eq. 1 work for various normalization layers is to have trainable parameters which are specific to the clean and adversarial images.\n\n# 3.3 REVISITING ADAPTERS WITH ADVERSARIAL TRAINING\nThe last observation strongly relates this setting to the adapters literature where a single backbone architecture has some parameters, called adapters, which are specific to different domains while the rest of the parameters are shared among tasks. In our case, the clean images form one domain and the adversarial images constitute another domain. In this work, we go beyond having separate normalization layers for the clean and adversarial images and investigate other types of adapters.  \n\nFormally, the model parameters $\\pmb{\\theta}$ can be decomposed into parameters $\\psi$ which are shared among domains and parameters $\\phi$ which are specific to a domain. We call $\\phi_{\\mathrm{clean}}$ the parameters used when training on clean images and $\\phi_{\\mathrm{adv}}$ the parameters used when training on adversarial images. For example, in Section 3.2 , when we used dual LayerNorm layers, the scales and offsets of these normalization layers are contained in $\\phi_{\\mathrm{clean}}$ and $\\phi_{\\mathrm{adv}}$ whereas the rest of the model parameters are in $\\psi$ . Based on Eq. 1 , we optimize the following loss:  \n\n$$\n\\alpha L(f(\\pmb{x};\\psi\\cup\\phi_{\\mathrm{clean}}),y)+(1-\\alpha)\\operatorname*{max}_{\\pmb{\\delta\\in\\mathbb{S}}}L(f(\\pmb{x}+\\pmb{\\delta};\\psi\\cup\\phi_{\\mathrm{adv}}),y).\n$$  \n\nFinally, we introduce some notation for models with a s at inference time: we call $f(\\cdot;\\psi\\cup\\phi_{\\mathrm{clean}})$ the clean mode for prediction as we use the adapters $\\phi_{\\mathrm{clean}}$ trained on the clean data. Conversely, we call $f(\\cdot;\\psi\\cup\\phi_{\\mathrm{adv}})$ the robust mode when using the adapters $\\phi_{\\mathrm{adv}}$ trained on the perturbed data.  \n\nWortsman et al. (2022 ) propose model soups , which consist in averaging the weights of multiple models fine-tuned from the same pre-trained model. The resulting weight averaged model can benefit from the original models without incurring any extra compute and memory cost at inference time. Currently, in our setting the user would have to know at test time if the network should be in clean or robust mode . A model soup , by its ability to merge models, is a way to bypass this issue. We formulate the hypothesis that training with adapters enables model soups . With this in mind, we observe that training with adapters means that most of the model parameters are already shared, so model souping would simply consist in linearly interpolating the weights of the adapters for the two modes. We call adversarial model soups , the model soups with a model co-trained on clean and adversarial samples. We get the following parametrized model:  \n\n$$\nf(\\cdot;\\psi\\cup(\\beta\\phi_{\\mathrm{clean}}+(1-\\beta)\\phi_{\\mathrm{adv}}))\n$$  \n\nwhere $\\beta$ is the weighting factor when averaging the adapters. If $\\beta=1$ , the model soup boils down to the clean mode and conversely $\\beta=0$ corresponds to the robust mode . In Section 5.2 , we assess this hypothesis and show that forming model soups between independent nominal and robust models fails."}, {"ref_id": "454895453635358570", "chunk_id": "6", "score": 0.16796875, "text": "# 6.2 Implementation\nTo fairly evaluate our method against the baselines, we use the same set of hyperparameters for all the methods, for a given dataset. For details, see Appendix D. The code for Pyramid-BERT is made available as a supplementary material with the submission. The training and inference jobs are run separately on a NVIDIA Tesla V 100 GPU machine and a Intel Xeon Platinum 8000 series CPU machine respectively. All the accuracy and speedup scores are averaged over 20 trials.\n\n# 6.3 Results on GLUE benchmarks\nWe first examine the trade-off between accuracy and speedup. The accuracy results for $3X$ and $1.5X$ speedup are summarized in Table 1 and 2 respectively. The results for $3.5X$ and $2X$ speedup are given in the Table 11 and 13 in Appendix E.We observe that as the speedup increases the gap between our Coreset-select-opt and its competitors becomes large, where for $3X$ speedup, Coreset-select-opt outperforms the second best method Attention-select by $1\\%$ accuracy in average and beats the standard baselines by $2\\%$ or more. The Average-pool performs the worst in average across the GLUE benchmarks, specially on the COLA dataset. For detailed justification, see Appendix E. To better understand the performance of Coreset-select-opt with different values of $m$ ,an ablation study is shown in Section 7 . For mild speedup of $1.5X$ , we note that all methods (except Average-pool ) suffer only a small loss in accuracy and our method suffers no loss. A similar situation occurs when viewing the tradeoff between space complexity and accuracy, where we provide results for a memory reduction of $70\\%$ and $30\\%$ in the Tables 3 and 16 (in $\\S\\mathrm{~E~}$ ).\n\n# 6.4 Results on Long Range Arena\nWe show results on the following three datasets of LRA benchmark: (1) byte-level text classification using real-world data (IMDB), (2) Pathfinder task (long range spatial dependency problem), and (3) image classification on sequences of pixels converted from CIFAR-10.  \n\n<html><body><table><tr><td>Dataset</td><td>1st-I</td><td>1st</td><td>Rand</td><td>Pool</td><td>Att</td><td>CS-k-1</td><td>CS-opt</td><td>BERTBase</td></tr><tr><td>STS-B</td><td>86.4</td><td>86.4</td><td>86.8</td><td>81.6</td><td>87.0</td><td>87.0</td><td>87.0</td><td>87.9</td></tr><tr><td>MRPC</td><td>81.4</td><td>80.9</td><td>83.2</td><td>83.9</td><td>84.6</td><td>86.2</td><td>86.9</td><td>87.3</td></tr><tr><td>SST-2</td><td>83.8</td><td>84.4</td><td>85.6</td><td>85.2</td><td>86.0</td><td>87.3</td><td>89.6</td><td>92.4</td></tr><tr><td>QNLI</td><td>84.8</td><td>84.4</td><td>86.4</td><td>84.1</td><td>86.8</td><td>87.8</td><td>87.8</td><td>90.9</td></tr><tr><td>COLA</td><td>49.7</td><td>49.7</td><td>49.5</td><td>3.0</td><td>51.1</td><td>51.7</td><td>52.8</td><td>53.3</td></tr><tr><td>RTE</td><td>63.5</td><td>63.5</td><td>62.1</td><td>59.2</td><td>63.4</td><td>63.7</td><td>63.7</td><td>65.8</td></tr><tr><td>MNLI_M</td><td>77.8</td><td>76.7</td><td>81.4</td><td>75.4</td><td>82.5</td><td>82.4</td><td>82.5</td><td>84.0</td></tr><tr><td>MNLI_MM</td><td>75.9</td><td>75.6</td><td>78.7</td><td>76.7</td><td>82.7</td><td>82.6</td><td>82.7</td><td>84.6</td></tr><tr><td>QQP</td><td>80.8</td><td>80.4</td><td>87.0</td><td>79.4</td><td>87.3</td><td>87.3</td><td>87.3</td><td>87.5</td></tr><tr><td>Mean</td><td>76.0</td><td>76.1</td><td>77.9</td><td>69.6</td><td>79.0</td><td>79.6</td><td>80.0</td><td>81.5</td></tr></table></body></html>  \n\nTable 1: GLUE dev performance at $3X$ speedup. Here and everywhere else, F 1 scores are reported for QQP and MRPC, Spearman correlations are reported for STS-B, Matthew’s correlations are reported for COLA, and accuracy scores are reported for the other tasks. Each value is averaged over 20 trials. Larger values indicates better performance.   \nTable 2: GLUE dev performance at $1.5X$ speedup.   \n\n\n<html><body><table><tr><td>Dataset</td><td>1st-I</td><td>1st</td><td>Rand</td><td>Pool</td><td>Att</td><td>CS-k-1</td><td>CS-opt</td><td>BERTBase</td></tr><tr><td>STS-B</td><td>87.9</td><td>87.9</td><td>87.8</td><td>87.8</td><td>87.9</td><td>87.7</td><td>87.9</td><td>87.9</td></tr><tr><td>MRPC</td><td>86.8</td><td>86.4</td><td>87.2</td><td>87.0</td><td>87.1</td><td>86.9</td><td>87.3</td><td>87.3</td></tr><tr><td>SST-2</td><td>92.1</td><td>91.5</td><td>91.9</td><td>90.3</td><td>92.3</td><td>92.4</td><td>92.4</td><td>92.4</td></tr><tr><td>QNLI</td><td>90.8</td><td>90.8</td><td>90.8</td><td>90.2</td><td>90.7</td><td>90.9</td><td>90.9</td><td>90.9</td></tr><tr><td>COLA</td><td>53.0</td><td>52.7</td><td>53.1</td><td>25.6</td><td>53.2</td><td>53.3</td><td>53.3</td><td>53.3</td></tr><tr><td>RTE</td><td>65.6</td><td>65.2</td><td>65.7</td><td>61.5</td><td>65.7</td><td>65.4</td><td>65.6</td><td>65.8</td></tr><tr><td>MNLI_M</td><td>84.0</td><td>83.8</td><td>83.9</td><td>80.9</td><td>84.0</td><td>84.0</td><td>84.0</td><td>84.0</td></tr><tr><td>MNLI_MM</td><td>84.1</td><td>84.0</td><td>83.9</td><td>84.0</td><td>84.5</td><td>84.6</td><td>84.6</td><td>84.6</td></tr><tr><td>QQP</td><td>87.1</td><td>86.9</td><td>87.4</td><td>85.7</td><td>87.4</td><td>87.5</td><td>87.5</td><td>87.5</td></tr><tr><td>Mean</td><td>81.3</td><td>81.0</td><td>81.3</td><td>76.8</td><td>81.4</td><td>81.4</td><td>81.5</td><td>81.5</td></tr></table></body></html>  \n\nFor baselines, we include First$.k$ -select and Random-select methods, but fail to include Attention-select .Attention-select requires a full attention matrix for selecting tokens which is not available in Big Bird (Zaheer et al. ,2020 ) and Performers (Choromanski et al. ,2020 ). In addition, the Transformers including Big Bird and Performers in LRA have shallow architectures because of no pre-training: the default number of encoders for text classification, path finder, and image classifi- cation datasets are four, four, and one, respectively. Thus, for both baselines and our method, we only reduce sequence length in the input layer , which is before the first encoder. For the sequence-length configurations, see Appendix C.2 . For Averagepool , due to its worst performance on the GLUE benchmarks and the shallow architectures of the models in LRA, we exclude it from the baselines.  \n\nTable 3: GLUE dev performance at $70\\%$ space complexity reduction.   \n\n\n<html><body><table><tr><td>Dataset</td><td>1st-I</td><td>1st</td><td>Rand</td><td>Pool</td><td>Att</td><td>CS-k-1</td><td>CS-opt</td><td>BERTBase</td></tr><tr><td>STS-B</td><td>85.3</td><td>85.1</td><td>85.6</td><td>78.7</td><td>85.4</td><td>86.5</td><td>86.7</td><td>87.9</td></tr><tr><td>MRPC</td><td>81.3</td><td>81.5</td><td>83.3</td><td>83.1</td><td>84.3</td><td>86.0</td><td>86.6</td><td>87.3</td></tr><tr><td>SST-2</td><td>83.3</td><td>84.6</td><td>84.9</td><td>85.1</td><td>87.2</td><td>87.6</td><td>87.7</td><td>92.4</td></tr><tr><td>QNLI</td><td>84.6</td><td>84.3</td><td>85.1</td><td>84.0</td><td>86.4</td><td>86.6</td><td>86.5</td><td>90.9</td></tr><tr><td>COLA</td><td>49.0</td><td>49.0</td><td>48.4</td><td>0.0</td><td>50.9</td><td>51.0</td><td>52.3</td><td>53.3</td></tr><tr><td>RTE</td><td>62.1</td><td>62.0</td><td>61.8</td><td>59.8</td><td>62.7</td><td>63.6</td><td>63.6</td><td>65.8</td></tr><tr><td>MNLI_M</td><td>76.9</td><td>76.3</td><td>79.0</td><td>75.2</td><td>80.5</td><td>80.9</td><td>81.0</td><td>84.0</td></tr><tr><td>MNLI_MM</td><td>74.9</td><td>74.5</td><td>79.3</td><td>76.3</td><td>80.7</td><td>81.6</td><td>81.8</td><td>84.6</td></tr><tr><td>QQP</td><td>80.6</td><td>80.0</td><td>86.6</td><td>82.9</td><td>87.0</td><td>87.2</td><td>87.3</td><td>87.5</td></tr><tr><td>Mean</td><td>75.3</td><td>75.3</td><td>77.1</td><td>69.5</td><td>78.3</td><td>79.0</td><td>79.3</td><td>81.5</td></tr></table></body></html>  \n\nTable 4: LRA test set performances at $70\\%$ space complexity reduction for Big Bird (top) and Performers (bottom) as the backbone Transformer. Here and everywhere else, accuracy scores are reported for all three tasks. Each value is averaged over 20 trials. Larger values indicates better performance.   \n\n\n<html><body><table><tr><td colspan=\"6\">BigBird</td></tr><tr><td>Dataset</td><td>1st</td><td>Rand</td><td>CS-k-1</td><td>CS-opt</td><td>Trans.-no-prune</td></tr><tr><td>CIFAR-10</td><td>26.9</td><td>39.4</td><td>38.6</td><td>43.3</td><td>40.9</td></tr><tr><td>PATHFINDER-32</td><td>55.6</td><td>69.9</td><td>69.3</td><td>71.7</td><td>73.5</td></tr><tr><td>IMDB (BYTE-LEVEL)</td><td>57.9</td><td>59.6</td><td>59.1</td><td>61.4</td><td>63.8</td></tr><tr><td>Mean</td><td>46.8</td><td>56.3</td><td>55.7</td><td>58.8</td><td>59.4</td></tr><tr><td colspan=\"6\">Performers</td></tr><tr><td>CIFAR-10</td><td>26.9</td><td>41.5</td><td>39.8</td><td>45.5</td><td>42.9</td></tr><tr><td>PATHFINDER-32</td><td>52.4</td><td>58.2</td><td>61.5</td><td>67.7</td><td>66.2</td></tr><tr><td>IMDB (BYTE-LEVEL)</td><td>59.9</td><td>59.9</td><td>59.7</td><td>62.8</td><td>64.3</td></tr><tr><td>Mean</td><td>46.4</td><td>53.2</td><td>53.7</td><td>58.7</td><td>57.8</td></tr></table></body></html>  \n\nThe results of accuracy scores for space complexity reduction at $70\\%$ and $30\\%$ are presented in Table 4 and Table 18 (in Appendix E), respectively. The Coreset-select-opt here represents the Coreset-select with $m\\ =\\ 1$ because of its superior performance over other $m\\quad\\in$ ∈$\\{\\lceil0.1k\\rceil\\},\\lceil0.2k\\rceil,\\lceil0.3k\\rceil,\\lceil0.4k\\rceil\\}$ .  \n\nWe observe a similar pattern as discussed in GLUE benchmark evaluations: at high space complexity reduction $70\\%$ ,Coreset-select-opt significantly outperforms its competitors First$.k$ -select and Random-select by $12\\%$ and $2.5\\%$ in average for Big Bird $(12.3\\%$ and $5.5\\%$ in average for Performers ). Moreover, on CIFAR-10, our Coresetselect-opt is even better than the Big Bird and Performers without any sequence reduction with accuracy gain $2.4\\%$ and $2.6\\%$ , respectively (similarly for Performers on PATHFINDER-32). On the other hand, different from the GLUE evaluations, Coreset-select-k-1 does not show any significant advantages over the baseline methods. Our conjecture is that the input in the LRA datasets contain too many noisy or low level information which is not helpful for predicting the target. For an example, each pixel of an image (CIFAR-10) or a character in the byte-level text classification represents a token as the input. Our Coreset-select based strategy with $m=1$ does the most fine-grained token-level selection than its baselines and thus filter out the noisy information. Note, we do not include accuracy and speedup tables because of insignificant gains observed in speedup due to the shallow architectures of Transformers in LRA."}, {"ref_id": "454845533235189656", "chunk_id": "12", "score": 0.1552734375, "text": "# 4 Experiments\nWe now exhibit the results of our experiments, by showing the correlation between the feedback of our indicators, and the false sense of security given by badly-evaluated defenses.  \n\nExperimental setup. We run our attacks on an Intel ®Xeon ®CPU E5-2670 v3, with 48 cores, 126 GB of RAM, and equipped with an Nvidia Quadro M6000 with $24\\:\\mathrm{GB}$ of memory. All the attacks and models have been wrapped and run by using the SecML library [ 20 ]. We select four defenses that have been reported as failing, and we show that our indicators would have detected such evaluation errors. For each of them, we set the hyperparameters for the attack as done in the original evaluation, in order to collect similar results.  \n\n-Winners-Take-All (kWTA) , the defense proposed by Xiao et al. [ 31 ] uses only the top-k outputs from each layer, generating many discontinuities in the loss landscape, and hence resulting in the non-converging failure due to noisy gradients $(F_{2})$ . We use the implementation provided by Tramèr et al. [ 30 ], trained on CIFAR10, and we test its robustness by attacking it with $\\ell_{\\infty}$ -PGD [ 17 ] with a step size of $\\alpha=0.003$ , maximum perturbation $\\epsilon=8/255$ and 50 iterations, with 5 restarts for each attack, scoring a robust accuracy of $58\\%$ on 100 samples.  \n\nDistillation , the defense proposed by Papernot et al. [ 22 ], works by training a model to have zero gradients around the training points, leading gradient-based attacks towards bad local optimum $(F_{3})$ .We re-implemented such defense, by training a distilled classifier on the MNIST dataset to mimic the evaluation. Then, we apply $\\ell_{\\infty}$ -PGD [ 17 ], with step size $\\alpha=0.01$ , maximum perturbation $\\epsilon=0.3$ for 50 iterations on 100 samples, resulting in a robust accuracy of $94\\small{,}2\\%$ .  \n\nEnsemble diversity , the defense proposed by Pang et al. [ 21 ] is composed with different neural networks, trained with a regularizer that encourages diversity. We adopt the implementation provided by Tramèr et al. [ 30 ]. Then, following its original evaluation, we apply $\\ell_{\\infty}$ -PGD [ 17 ], with step size $\\alpha=0.001$ , maximum perturbation $\\epsilon=0.01$ for 10 iterations on 100 samples, resulting in a robust accuracy of $38\\%$ .  \n\nTurning a Weakness into a Strenght (TWS) , the defense proposed by Yu et al. [ 32 ], applies a mechanism for detecting the presence of adversarial examples on top of an undefended model, measuring how much the decision changes locally around a sample. Even if the authors also apply other rejection mechanisms, we take into account only the described one, as we wish to show that attacks optimized neglecting such term will trigger the non-adaptive attack failure $(F_{4})$ .  \n\nWe apply this defended on a WideResNet model trained on CIFAR10, provided by RobustBench [ 14 ]. We attack this model with $\\ell_{\\infty}$ -PGD [ 17 ], with step size $\\alpha\\,=\\,0.1$ , maximum perturbation $\\epsilon=0.3$ for 50 iterations on 100 samples, and then we query the defended model with all the computed adversarial examples. While the attacks works against the standard model, some of them are rejected by the defense, resulting in a robust accuracy of $35\\%$ ,highlighted by the trigger of the $I_{5}$ indicator. In this case, we consider an attack unsuccessful if the original sample is not misclassified and the adversarial point is either belonging to the same class, or it is labeled as rejected.  \n\nEach of these attacks have been executed with 5 random restarts. We also attack all these models with the version of AutoPGD (APGD) [ 13 ] that uses the difference of logit (DLR) as a loss to optimize. This strategy will take care to automatically tune its hyperparameters while optimizing, reducing possible errors that occur while deciding the values of step size, and iterations. Lastly, we compute attacks that take into account all the mitigations we prescribed, and they will be analyzed further on in the paper.  \n\nIdentifying failures. We want now to understand if our indicators are correlated with faults  \n\n  \nFigure 5: Robust accuracy vs. average value of the indicators. Incorrect evaluations (denoted with $\\overrightarrow{\\circ}$ )report high robust accuracy but also trigger most of the indicators. Better evaluations, performed by either mitigating the attack failures (denoted with $\\mathbf{\\Phi}^{\\bullet}\\times\\mathbf{\\Phi}^{\\bullet})$ , or using APGD (denoted with $\\mathbf{\\Phi}^{,}\\star\\mathbf{\\Phi}$ ), correctly report a lower robust accuracy along with a lower average value of our indicators.  \n\nof the security evaluations of defenses. We collect the results of all the attacks against the selected targets, and we compute our indicators, by listing their values in Table 1, along with their mean score. With a glance, it is possible to grasp that out hypothesis is right: the detection of a failure is linked with higher values for the robust accuracy, and also the opposite. Each original evaluation is characterized by high values of one or more indicator, while the opposite happens for stronger attacks. For instance, APGD automatically tunes its hyperparameter while optimizing, hence it is able to apply some mitigations directly during the attack. To gain a quantitative evaluation of out hypothesis, we compute both the p-value and the correlation between the average score of the indicators and the robust accuracy, depicting this result in Fig. 5. Both p-value and correlation suggest a strong connection between these analyzed quantities, confirming our initial belief.  \n\nTable 1: Values of the Indicators of Attack Failures, computed for all the attacks against all the evaluated models. We denote the attacks that apply also the mitigations as $\\mathrm{PGD^{\\star}}$ .  \n\n\n<html><body><table><tr><td>Model</td><td>Attack</td><td>I1</td><td>12</td><td>13</td><td>14</td><td>15</td><td>T</td><td>RA</td></tr><tr><td rowspan=\"3\">k-WTA [31]</td><td>PGD</td><td>0.33</td><td>0.43</td><td>0.77</td><td></td><td></td><td>0.306</td><td>58%</td></tr><tr><td>APGD</td><td>-</td><td>0.31</td><td>0.33</td><td></td><td></td><td>0.128</td><td>36%</td></tr><tr><td>PGD*</td><td>0.07</td><td>0.48</td><td>0.55</td><td></td><td></td><td>0.220</td><td>6%</td></tr><tr><td rowspan=\"3\">Distillation[22]</td><td>PGD</td><td></td><td>0.98</td><td></td><td>0.97</td><td></td><td>0.39</td><td>94%</td></tr><tr><td>APGD</td><td>-</td><td>0.40</td><td>0.21</td><td></td><td></td><td>0.122</td><td>0%</td></tr><tr><td>PGD*</td><td></td><td>0.04</td><td></td><td>-</td><td></td><td>0.008</td><td>0%</td></tr><tr><td rowspan=\"3\">Ensemble Div.[21]</td><td>PGD</td><td></td><td>0.76</td><td></td><td></td><td></td><td>0.152</td><td>38%</td></tr><tr><td>APGD</td><td></td><td>0.37</td><td>0.14</td><td></td><td></td><td>0.102</td><td>0%</td></tr><tr><td>PGD*</td><td>0.08</td><td>0.17</td><td>0.15</td><td>-</td><td></td><td>0.080</td><td>%6</td></tr><tr><td rowspan=\"3\">TWS [32]</td><td>PGD</td><td></td><td>0.49</td><td>0.07</td><td></td><td>0.37</td><td>0.186</td><td>35%</td></tr><tr><td>APGD</td><td>-</td><td>0.41</td><td>0.09</td><td></td><td>-</td><td>0.100</td><td>0%</td></tr><tr><td>PGD*</td><td>-</td><td>0.37</td><td>0.10</td><td>-</td><td></td><td>0.094</td><td>0%</td></tr></table></body></html>  \n\nMitigating failures. We can now use our indicators to improve the quality of the security evaluations, and we apply the following pipeline: (i) we test the defense with a set of points with the original attack strategy proposed by the author of the defense; (ii) we select the failure cases and inspect the feedback of our indicators per-sample ; (iii) for each cause of failure, we apply the specific remediation suggested by the metric; and (iv) we show that the attack now succeeds, thus reducing the robust accuracy of the target model, and also the values of the indicators.  \n\nWe report all the results of this process in Table 2, where each row shows the original robust accuracy, and how it is decreased, mitigation after mitigation. Also, all the individual values of each indicator computed on these patched attacks can be found in Table 1, marked as $\\mathrm{PGD^{\\star}}$ .  \n\nMitigating $k$ -WTA failures. For many failing attacks, the $I I$ indicator triggers, implying that the attack found an adversarial example inside the path. We then apply mitigation $M_{I}$ , and we lower accordingly the robust accuracy of the model to $36\\small{,}4\\%$ . We then analyze the feedback of the $I_{3}$ indicator, the one that detects the presence of noisy gradients. We apply mitigation $M_{3}$ , and we change the loss of the attack as described by Tramèr et al. [ 30 ]. This loss is computed by averaging the gradient of each single point of the attack path with the information of the surrounding ones. The resulting direction is then able to correctly descent toward a minimum. We run $\\ell_{\\infty}$ -PGD with the same parameters, but smoothing the gradients by averaging 100 neighboring points from a normal distribution ${\\mathcal N}(\\mu=\\pmb{x}_{i},\\sigma=0.0\\dot{3}1)$ , where $x_{i}$ is a point in the attack path. After such mitigation, the robust accuracy drops to $6,4\\%$ , and so follows the indicator (Fig. 6a).  \n\nMitigating Distillation failures. All the attacks fail because of the absence of gradient information, leading the attack to a bad local optimum $(F_{3})$ , and such is highlighted by the feedback of the $I_{3}$ indicator. We apply mitigation $M_{3}$ , and we change the loss optimized during the attack, following the strategy applied by Carlini et al. [ 9 ], that computes the loss of the attack on the logit of the model rather than the final softmax layer. We repeat the PGD attack with such fix, and the robust accuracy drops to $0\\%$ , along with the indicator $I_{3}$ (Fig. 6b).  \n\nMitigating Ensemble diversity failures. Firstly, the $I_{I}$ indicator highlighted the presence of $F_{I}$ ,implying that some failing attacks are due to the implementation itself. We apply mitigation $M_{I}$ , and the robust accuracy decreases to $36\\%$ . Also, $I_{2}$ indicator is active, implying that the loss of of failing attacks could be optimized more. For this reason, we apply mitigation $M_{2}$ , and we increase the step size to 0 .05 and the iterations to 50 . This patch is enough for lowering the robust accuracy to $9\\bar{\\%}$ .(Fig. 6c).  \n\nMitigating TWS failures. The detector is rejecting adversarial attacks successfully computed on the undefended model, triggering the $I_{5}$ indicator. Hence we apply mitigation $M_{5}$ , and we adapt the attack to consider also the rejection class. This version of PGD minimizes the usual loss function of the attacker, but it also minimizes the score of the rejection class when encountered, allowing it to evade the rejection. We run such attack, and we obtain a new robust accuracy of $0\\%$ (Fig. 6d).  \n\n<html><body><table><tr><td>Model</td><td>Initial</td><td>M1</td><td>M2</td><td>M3</td><td>M4</td><td>M5</td><td>Final</td></tr><tr><td>k-WTA [31]</td><td>58.2%</td><td>36.4%</td><td>36.4%</td><td>6.4%</td><td>6.4%</td><td>6.4%</td><td>6.4%</td></tr><tr><td>Distillation [22]</td><td>94.2%</td><td>94.2%</td><td>94.2%</td><td>0.4%</td><td>0.4%</td><td>0.4%</td><td>0.4%</td></tr><tr><td>Ensemble Diversity [21]</td><td>38.0%</td><td>38.0%</td><td>9.0%</td><td>9.0%</td><td>9.0%</td><td>9.0%</td><td>9.0%</td></tr><tr><td>TWS [32]</td><td>35.0%</td><td>35.0%</td><td>35.0%</td><td>35.0%</td><td>35.0%</td><td>0.0%</td><td>0.0%</td></tr></table></body></html>\n\nTable 2: Robust accuracies $\\overline{{(\\%)}}$ after patching the security evaluations with the prescribed mitigations.  \n\n  \nFigure 6: The values of our indicators and the success rate (SR) of the attack, before (semi-transparent colored area) and after (solid colored area) fixing the failures, computed for the analyzed models."}], "task_step_question_answer": "除了上述提到的方法和场景，在实时通信领域，算法的稳定性与容错性也至关重要。例如在视频会议系统中，网络状况可能随时发生变化，存在丢包、延迟等问题。此时，编解码算法需要具备良好的容错能力，以确保视频和音频的流畅播放。H.264/AVC 编码标准采用了多种容错技术，如灵活宏块排序（FMO）和数据分割。FMO 可以将图像划分为多个独立的区域，每个区域独立编码和传输，当某个区域的数据丢失时，其他区域的数据仍能提供一定的图像信息，减少图像质量的下降。数据分割则将视频数据分为不同的部分，重要的数据部分优先传输，即使部分数据丢失，也能保证基本的图像显示。\n\n在工业自动化领域，算法的稳定性直接关系到生产的安全和效率。例如在机器人控制算法中，需要实时处理传感器数据，控制机器人的运动。由于工业环境中存在各种干扰和不确定性，如振动、电磁干扰等，算法必须具备高度的稳定性和容错性。一些先进的机器人控制算法采用了模型预测控制（MPC）技术，通过预测系统的未来状态，提前调整控制策略，以应对外界干扰和不确定性。同时，为了提高算法的容错性，还会引入冗余传感器和故障诊断机制，当某个传感器出现故障时，能够及时切换到备用传感器，并对故障进行诊断和修复。", "ref_task_step_id": ""}, "__type__": "task_step_node"}, "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d": {"__data__": {"id_": "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d", "metadata": {}, "relationships": {}, "hash": "", "start_task_context": "大模型MLA技术细节", "aemo_representation_context": "### 1. 分析近几年研究领域的技术框架与方法论\n在计算机科学相关研究领域，Transformer、GAN、BERT 等框架成为众多论文采用的核心技术。这些框架在不同任务中展现出强大的适应性，其方法论围绕着如何有效处理数据特征、优化模型结构以提升性能。例如，Transformer 基于自注意力机制，打破了传统序列模型的局限性，在自然语言处理和计算机视觉等多领域广泛应用；GAN 通过生成器与判别器的对抗训练，在图像生成等任务上取得显著成果；BERT 则通过预训练方式，极大提升了自然语言处理任务的性能。\n\n### 2. 研究论文中采用的主要框架在不同任务中的应用与变体\n - **Transformer**：在自然语言处理任务中，如机器翻译、文本分类，Transformer 架构不断演变，出现了诸如 ViT（Vision Transformer）等变体应用于计算机视觉任务，将图像视为序列进行处理，展现出跨领域的应用潜力。\n - **GAN**：在图像生成任务中，DCGAN（Deep Convolutional GAN）等变体通过改进网络结构，生成更逼真的图像；在医学图像合成、视频生成等领域也有应用，通过调整损失函数和网络架构适应不同任务需求。\n - **BERT**：除了基础的自然语言理解任务，还在信息检索、情感分析等任务中得到广泛应用，通过微调预训练模型适应特定任务，同时出现了 RoBERTa 等改进版本，优化预训练策略提升性能。\n\n### 3. 评估学术界的技术进步与局限性\n - **技术进步**：模型性能在多个任务上取得显著提升，例如在图像识别准确率、自然语言处理任务的 F1 值等指标上不断刷新记录。新的模型架构和训练方法不断涌现，推动了技术的快速发展。\n - **局限性**：依然存在模型偏差和数据依赖问题。模型在某些特定数据集上表现良好，但在其他数据集或现实场景中泛化能力不足。部分模型对大规模标注数据依赖严重，数据质量和数量影响模型性能，且模型解释性差，难以理解其决策过程。\n\n### 4. 探讨计算模型在不同数据集与应用场景下的适用性与泛化能力\n - **适用性**：不同模型在特定数据集和应用场景下有各自优势。例如，基于深度学习的模型在大规模、高维数据的图像和语音识别任务中表现出色；传统机器学习模型在小数据、简单任务中仍有应用价值。\n - **泛化能力**：尽管部分模型在特定领域取得成功，但在多领域、多模态数据融合的现实应用中，泛化能力面临挑战。多模态数据的异质性和复杂性使得模型难以有效提取和融合特征，限制了其在复杂现实场景中的应用。\n\n### 5. 分析最新算法的稳定性与容错性\n - **稳定性优化**：一些算法针对稳定性进行了优化，例如采用正则化技术、对抗训练等方法提高模型在复杂环境下的稳定性。在动态环境中，部分算法通过在线学习、自适应调整参数等方式保持性能稳定。\n - **大规模数据适应性**：在大规模数据处理上，部分算法通过分布式训练、模型压缩等技术提高计算效率和适应性。但仍有算法在处理大规模数据时面临内存、计算资源等限制，导致性能下降。\n\n### 6. 评估论文中提出的未来研究方向与挑战\n - **新研究问题**：提出了如提升模型可解释性、解决模型偏差和数据依赖、增强多模态数据融合能力等新研究问题。\n - **研究切入点**：从改进模型架构、优化训练算法、探索新的数据增强方法等方面寻找新的研究切入点。这些挑战促使研究者不断探索新的技术和方法，推动后续研究朝着更高效、更智能、更具泛化能力的方向发展。\n\n### 研究成果、方法创新性与应用价值总结\n - **研究成果**：在模型性能提升、新架构和算法提出等方面取得显著成果，推动了计算机科学多个领域的发展。\n - **方法创新性**：通过引入新的技术框架、改进训练方法和优化模型结构等方式，展现出诸多创新点，如自注意力机制、对抗训练等。\n - **应用价值**：在图像、自然语言处理、语音等多个领域有广泛应用，为智能安防、智能医疗、智能交通等现实场景提供技术支持，具有巨大的商业和社会价值。  ", "task_step_name": "评估论文中提出的未来研究方向与挑战", "task_step_description": "- **新研究问题**：提出了如提升模型可解释性、解决模型偏差和数据依赖、增强多模态数据融合能力等新研究问题。 - **研究切入点**：从改进模型架构、优化训练算法、探索新的数据增强方法等方面寻找新的研究切入点。这些挑战促使研究者不断探索新的技术和方法，推动后续研究朝着更高效、更智能、更具泛化能力的方向发展。", "task_step_level": "5", "task_step_question": "在提升模型可解释性、解决模型偏差和数据依赖、增强多模态数据融合能力这些新研究问题下，从改进模型架构、优化训练算法、探索新的数据增强方法等研究切入点出发，有哪些已经取得一定进展的具体技术或方法实例？  ", "task_step_question_context": [{"ref_id": "454847062641060886", "chunk_id": "6", "score": 0.412109375, "text": "# 2 Related Work\nData Augmentation methods have showcased their capacity to improve DNNs’ performance by expanding and diversifying training data [Maharana et al. , 2022]. Explicit augmentation directly incorporates augmented data into the training process, albeit at the expense of reduced training efficiency [Cubuk et al. , 2020; Taylor and Nitschke, 2018; Xu and Zhao, 2023]. Recently, Wang et al. [2019] introduced an implicit semantic data augmentation approach, named ISDA, which transforms the deep features of samples within the semantic space of DNNs and boils down to the optimization of a robust loss. Subsequent studies [Li et al. , 2021; Chen et al. , 2022] in image classification tasks have extended this approach. However, these methods still struggle with effectively improving model performance when dealing with data biases that go beyond the category level.  \n\nAdversarial and Anti-Adversarial Perturbations transform samples in directions that respectively move towards and away from the decision boundary, thereby modifying samples’ learning difficulty [Lee et al. , 2023; Zhou et al. ,2023]. Consequently, models allocate varying levels of attention to samples subjected to their perturbations. Research has confirmed that incorporating adversarial and anti-adversarial samples during training assists models in achieving a better tradeoff between robustness and generalization [Zhou et al. ,2023; Zhu et al. , 2021]. However, existing adversarial training methods primarily focus on two specific types of perturbations that maximize and minimize losses [Xu et al. , 2021; Zhou et al. , 2023], posing limitations. Moreover, generating adversarial perturbations within the input space is timeconsuming [Madry et al. , 2018]. Different from prior studies, our approach randomly selects perturbation vectors from both adversarial and anti-adversarial perturbation distributions, enabling the generation of multiple distinct adversarial and antiadversarial samples. Furthermore, the perturbations are generated within the deep feature space, enhancing efficiency and ensuring universality across various data types.\n\n# 3 Implicit Adversarial Data Augmentation\nWe initially introduce a sample-wise adversarial data augmentation strategy to facilitate model training across various learning scenarios. By considering infinite augmentations, we then derive a surrogate loss for our augmentation strategy.\n\n# 3.1 Adversarial Data Augmentation\nConsider training a de $\\mathcal{F}$ weights $\\Phi$ on a training set, denoted as D$\\pmb{\\mathcal{D}}^{t r}=\\{(\\pmb{x}_{i},y_{i})\\}_{i=1}^{N}$ {, where Nrefers to the number of training resents the label of sample $\\pmb{x}_{i}$ . The deep feature (before logit) ples, and $\\bar{y_{i}}\\in\\{1,\\cdots,\\mathcal{C}\\}$ ∈{ · · · C} rep$\\mathcal{F}$ $\\pmb{x}_{i}$ is represented as a $\\mathcal{H}$ -dimensional vector $\\pmb{h}_{i}=\\mathcal{F}_{\\pmb{\\Phi}}(\\pmb{x}_{i})\\in\\mathbb{R}^{\\mathcal{H}}$ F∈.  \n\nOur augmentation strategy enhances samples within the deep feature space of DNNs. The perturbation vectors for the deep feature of each sample are randomly extracted from either its adversarial or anti-adversarial perturbation distributions. These distributions are modeled as multivariate normal distributions, $\\mathcal{N}(\\pmb{\\delta}_{i},\\pmb{\\Sigma}_{y_{i}})$ , where $\\delta_{i}$ refers to the sample perturbation, and $\\pmb{\\Sigma}_{y_{i}}$ represents the class-specific covariance matrix estimated from the features of all training samples in class $y_{i}$ . As samples undergo augmentation within the deep feature space, perturbations should also be generated within this space, facilitating semantic alterations for training samples. Consequently, the perturbation vector $\\delta_{i}$ for sample $\\pmb{x}_{i}$ is calculated as $\\epsilon_{i}{\\cdot}\\dot{s}i g n(\\dot{\\nabla}_{h_{i}}\\ell_{i}^{C E})$ , wh $s i g n(\\nabla_{h_{i}}\\ell_{i}^{C\\bar{E}})$ signifies the gradient sign of the CE loss $\\ell_{i}^{C E}$ with respect to $h_{i}$ .The parameter $\\epsilon_{i}$ plays a pivotal role in determining the perturbation strategy applied to $\\pmb{x}_{i}$ , encompassing both the perturbation direction and bound. Its positive or negative sign signifies adversarial or anti-adversarial perturbations, respecturbation bound. In practical applications, the value of tively. Furthermore, the absolute value $|\\epsilon_{i}|$ governs the ϵ$\\epsilon_{i}$ eris dynamically computed through a perturbation network based on the training characteristics of $\\pmb{x}_{i}$ , which will be elaborated in Section 4. Additionally, the class-specific covariance matrix $\\pmb{\\Sigma}_{y_{i}}$ within this distribution aids in preserving the covariance structure of each class. Its value is estimated in real-time by aggregating statistics from all mini-batches, as detailed in Section I of the Appendix. Regarding the augmentation strength quantified by the number of augmented instances $\\mathcal{M}_{i}$ and for $\\pi_{y_{i}}$ $\\pmb{x}_{i}$ represents the proportion of class , we define $\\mathcal{M}_{i}$ as $\\mathcal{M}/\\pi_{y_{i}}$ , wher $y_{i}$ $\\mathcal{M}$ in the training is a constant data. Accordingly, a smaller proportion results in a larger number of augmented instances, ensuring class balance.  \n\n  \nFigure 2: The overview of our method pipeline. We initiate with a sample-wise adversarial data augmentation strategy (Box 1), enriching the deep features of samples using perturbation vectors extracted from their adversarial and anti-adversarial perturbation distributions. Subsequently, by considering an infinite number of augmented instances, we derive a novel robust loss, termed IADA (Box 2). Regularization analysis reveals the efficacy of IADA in improving model generalization, robustness, and inter-class fairness. To facilitate optimization with IADA, we then establish a meta-learning-based framework called Meta-IADA (Box 3). Within it, a perturbation network is tasked with generating perturbation strategies for samples (denoted as $\\epsilon_{x}$ ) in the IADA loss, leveraging a set of ( $K\\!=\\!15)$ ) training characteristics as inputs.  \n\nTo compute the augmented features $\\tilde{\\pmb{h}}_{i}$ from $h_{i}$ , we transform $h_{i}$ along random directions sampled from $\\mathcal{N}(\\pmb{\\delta}_{i},\\pmb{\\Sigma}_{y_{i}})$ .This transform ion yields $\\tilde{\\pmb{h}}_{i}\\sim\\mathcal{N}(\\pmb{h}_{i}+\\pmb{\\delta}_{i},\\alpha\\pmb{\\Sigma}_{y_{i}})$ , where the parameter αcontrols the extent of dispersion for augmented samples. In summary, our adversarial data augmentation strategy offers the following advantages:  \n\n• Instead of augmenting samples within the original data space, our approach enhances them within their adversarial and anti-adversarial perturbation distributions. This method effectively adjusts the learning difficulty distribution of training samples, fostering improved generalization and robustness in DNNs. • Our sample-wise augmentation distribution customizes the mean vector based on the unique training characteristics of each sample. This personalized strategy significantly enhances models’ ability to address data biases, encompassing those beyond the category level."}, {"ref_id": "454846731731167836", "chunk_id": "9", "score": 0.341796875, "text": "# 2 Related Work\n\n# 2.1 Feature Weighting\nFeature weighting, vital for enhancing machine learning, includes several approaches [Chen and Guo, 2015; Chen and Hao, 2017b; Chowdhury et al. , 2023; Wang et al. , 2004; Yeung and Wang, 2002]. [Liu et al. , 2004], [Druck et al. ,2008], and [Raghavan et al. , 2006] explored feedback integration, model constraints, and active learning enhancement. [Wang et al. , 2013] proposed an active SVM method for image retrieval. Techniques like weighted bootstrapping [Barbe and Bertail, 1995], chi-squared tests, TabTransformer [Huang et al. , 2020], and cost-sensitive learning adjust weights through feature changes. These methods have limitations like overfitting or ignoring interactions. Our study focuses on adaptable weight distribution and improvement through feedback.\n\n# 2.2 Transformer\nThe Transformer architecture, introduced by [Vaswani et al. ,2017], has revolutionized many fields including natural language processing. Instead of relying on recurrence like its predecessors, it utilizes self-attention mechanisms to capture dependencies regardless of their distance in the input data. This innovation has led to several breakthroughs in various tasks. For instance, BERT model [Devlin et al. , 2018; Clark et al. , 2019], built upon the Transformer, set new records in multiple NLP benchmarks. Later, [Radford et al. ,2019] extended these ideas with GPT-2 and GPT-3 [Brown et al. , 2020], demonstrating impressive language generation capabilities. Concurrently, [Raffel et al. , 2020] proposed a unified text-to-text framework for NLP transfer learning, achieving state-of-the-art results across multiple tasks.\n\n# 3 Methodology\n\n# 3.1 Problem Formulation\n$\\{\\mathbf{F},\\mathbf{y}\\}$ {}nsider the problem be a dataset with $K$ ting of classif Nsamples tion. Let ${\\mathcal{D}}=$ define the feature matrix $\\textbf{F}=\\{\\mathbf{f}_{k}\\}_{k=1}^{K}$ {}.We use f${\\bf f}_{k}\\;\\;=\\;\\;$ $\\{f_{k}^{1},\\ldots,f_{k}^{i},\\ldots,f_{k}^{N}\\}^{\\top}$ }to denote the $k$ -th feature, $f_{k}^{i}$ is the value of i -th sample on the k-th feature. $\\textbf{y}=$ $[\\stackrel{\\cdot\\cdot}{y_{1}},\\dotsc,y_{N}]^{\\top}$ is the label vector. Without loss of generality, we assume the first $M$ features to be discrete, and the remaining $K-M$ features to be co  \n\nIn defining a weighting matrix W$\\textbf{W}\\in\\ \\mathbb{R}^{N\\times K}$ ∈, each of whose elements corresponds to the elements of the feature matrix $\\mathbf{F}$ .This weighting matrix $\\mathbf{W}$ is applied elementwisely $\\mathbf{F}$ to produce a weighted matrix $\\bar{\\mathbf{F}_{r e w}}=\\mathbf{W}\\odot\\mathbf{F}.$ ,problem, we aim to find an optimized where ⊙denotes the Hadamard prod WIn the , so that $\\mathbf{F}_{r e w}$ can ting improve the downstream tasks’ performance when substituting the original feature matrix $\\mathbf{F}$ in predicting y.\n\n# 3.2 Framework\nWe propose TFWT , a Tabular Feature Weighting with Transformer method for tabular data. We aim to improve downstream tasks’ performance by effectively incorporating the attention mechanism to capture the relations and interactions between features. To achieve this goal, we design a Transformer-based feature weighting pipeline with a finetuning strategy. As Figure 2 shows, our method consists of three components: In the Feature Alignment , we align different types of original features so that they are in the same space. In the Feature Weighting , we encode the feature matrix to get its embedding via Transformer encoders, and then decode the embedding into feature weights. In the Fine-Tuning ,we design a reinforcement learning strategy to fine-tune the feature weights based on feedback from downstream tasks.\n\n# 3.3 Feature Alignment\nTo effectively extract tabular data’s features while maintaining a streamlined computation, we convert both discrete and continuous features into numerical vectors.  \n\nDiscrete Feature Alignment. We first encode the discrete features into numerical values. The encoded numerical values are then passed to a dense embedding layer, transforming them into vectors for subsequent processes. For each discrete feature $\\mathbf{f}_{k}$ $(k=1,\\ldots,M)$ , the encoded vector is:  \n\n$$\n\\begin{array}{r}{\\mathbf{v}_{k}=\\mathrm{Dense}(\\mathbf{f}_{k}).}\\end{array}\n$$  \n\nContinuous Feature Alignment. We normalize all the continuous features with mean of 0 and variance of 1. We then design a linear layer to align their length with discrete features. For each continuous feature $\\mathbf{f}_{k}$ $(k=M+1,\\ldots,K)$ ,the encoded vector is:  \n\n$$\n\\mathbf{u}_{k}=\\mathrm{Linear}\\left(\\frac{\\mathbf{f}_{k}-\\mu_{k}}{\\sigma_{k}}\\right),\n$$  \n\nwhere $\\mu_{k}$ and $\\sigma_{k}$ are the mean and standard deviation of the $k$ -th feature, respectively. Then the aligned feature matrix $\\mathbf{F^{\\prime}}$ is formed by concatenating these vectors:  \n\n$$\n\\mathbf{F}^{\\prime}=[\\mathbf{v}_{1},\\ldots,\\mathbf{v}_{M},\\mathbf{u}_{M+1},\\ldots,\\mathbf{u}_{K}].\n$$\n\n# 3.4 Feature Weighting\nGiven aligned feature matrix $\\mathbf{F^{\\prime}}$ , we aim to explore the relationships between features and assign proper feature weights. Data Encoding. To enhance the model’s understanding and extract latent patterns and relations from the data, we put $\\mathbf{F^{\\prime}}$ into the encoders with a multi-head self-attention mechanism. This mechanism processes the embedded feature matrix $\\mathbf{F^{\\prime}}$ by projecting it into query (Q), key (K), and value (V) spaces.  \n\nThe encoder then applies the self-attention mechanism to capture varying feature relations in the feature matrix and assigns distinct attention weights to them. Assuming $d_{k}$ is the dimensionality of the key vectors, the attention mechanism is formulated as:  \n\n$$\n\\mathrm{Attention}(Q,K,V)=\\mathrm{softmax}\\left(\\frac{Q K^{T}}{\\sqrt{d_{k}}}\\right)V,\n$$  \n\nr$Q=W_{Q}\\cdot\\mathbf{F^{\\prime}}$ ,$K=W_{K}\\cdot\\mathbf{F}^{\\prime}$ , and $V=W_{V}\\cdot\\mathbf{F}^{\\prime},W_{\\mathbb{G}}$ ,$W_{K}$ ,$W_{V}$ are parameter matrices.  \n\nIn our method, we adopt the multi-head attention mechanism, where the results of each head are concatenated and linearly transformed. Assuming $W^{O}$ is an output projection matrix and $\\mathbf{Z}$ is the feature representation:  \n\n$$\n\\mathrm{{head}}_{i}=\\mathrm{{Attention}}(Q W_{i}^{Q},K W_{i}^{K},V W_{i}^{V}),\n$$  \n\n$$\n\\mathrm{MultiHead}(Q,K,V)=\\mathrm{Concat}(\\mathrm{head}_{1},...,\\mathrm{head}_{h})W^{O},\n$$  \n\n$$\n\\mathbf{Z}=\\operatorname{ResNet}(\\mathbf{MultiHead}(Q,K,V)),\n$$  \n\nwhere $W_{i}^{Q},\\;W_{i}^{K}$ , and $W_{i}^{V}$ are weights for query, key, and value. Through this process, we obtain the feature representation $\\mathbf{Z}$ that captures feature relationships. Specifically, $\\mathbf{Z}$ is obtained by passing the input feature matrix through multiple layers of the encoder, where each layer applies self-attention and residual connection-enhanced feedforward networks.  \n\nWeight Decoding. In this process, we aim to decode a weighting matrix Wfrom the embedding $\\mathbf{Z}$ . This decoding process iteratively updates Wuntil the downstream task’s performance is satisfied. We initialize the Wby setting all its elements as 1. This is to ensure all features receive equal importance at the beginning. In each decoding layer, we do cross-attention on $\\mathbf{W}$ and $\\mathbf{Z}$ by:  \n\n$$\n\\mathrm{CrossAtention}(Q_{W},K_{Z},V_{Z})=\\mathrm{softmax}\\left(\\frac{Q_{W}K_{Z}^{T}}{\\sqrt{d_{z}}}\\right)V_{Z},\n$$  \n\nr$Q_{w}\\,=\\,W_{Q}\\cdot\\mathbf{W}$ ,$K_{Z}\\,=\\,K_{K}\\cdot\\mathbf{Z}$ , and $V=W_{V}\\cdot\\mathbf{Z}$ ,$W_{Q}$ ,$W_{K}$ ,$W_{V}$ are parameter matrices.  \n\nBy adopting a cross-attention mechanism, we generate a contextual representation that captures various relationships and dependencies in the feature matrix. After several weight decoding layers, we get an updated weighting matrix $\\mathbf{W}$ :  \n\n$$\n{\\bf W}={\\bf R e s N e t}(\\mathrm{CrossAttention}(Q_{W},K_{Z},V_{Z})).\n$$  \n\n  \nFigure 2: The framework consists of three components. In the alignment we convert discrete ( $f_{1}$ to $f_{M},$ ) and continuous $(f_{M+1}$ to $f_{K})$ )features into uniform-length vectors. In the weighting we initialize and reassign weights according to feature relationships. The fine-tuning process employs reinforcement learning to refine the weighting model.  \n\nWe finally use the the weighting matrix Wto derive a weighted feature matrix $\\mathbf{F}_{\\mathrm{rew}}$ by its Hadamard product with the original feature matrix $\\mathbf{F}$ :$\\mathbf{\\bar{F}}_{\\mathrm{rew}}\\;=\\;\\mathbf{W}\\odot\\bar{\\mathbf{F}}$ . With this weighted feature matrix, we reorganize the feature space and make features optimized for the downstream task. $\\mathbf{F}_{\\mathrm{rew}}$ is then used to substitute $\\mathbf{F}$ in the downstream tasks."}, {"ref_id": "454849433600195034", "chunk_id": "1", "score": 0.32421875, "text": "# CFurther Discussions\nWe summarize some empirical observations as follows.  \n\n1) The CLIP with four training tricks yields about $4\\%$ improvement at Rank-1 in Table 1 of the main paper. It can inspire future works in which the model performance could be boosted by applying these training tricks.  \n\n2) Data augmentation and loss function are common technologies used in various methods. The investigation of more than 20 data augmentations and about 10 loss functions on performance in Tables 2-5 of the main paper provides valuable guidance on future works. Researchers can select proper and effective augmentations and losses into the model for improving performance.   \n3) We explore the internal properties and functionalities of the model for the first time. These results can light future works on model compression, so as to develop a more lightweight and effective TBPS method.   \n4) There are very little research on few-shot TBPS, while this paper makes a preliminary study on CLIP-based fewshot TBPS, providing valuable observation for future research direction."}], "task_step_question_answer": "在探讨未来研究方向时，还需关注模型在实际应用中的伦理和法律问题。例如，提升模型可解释性不仅有助于技术进步，还能在法律合规和用户信任方面发挥重要作用。某研究通过引入解释性模块，使模型决策过程透明化，成功应用于金融风险评估，显著提高了用户对AI系统的信任度。解决模型偏差和数据依赖问题，可以借鉴某研究在人脸识别任务中通过多样化数据集和公平性约束减少种族和性别偏差的实例，分析其对提升社会公平性的潜在影响。\n\n在细化研究切入点方面，改进模型架构的具体方法还可以包括引入元学习机制，使模型能够自适应不同任务需求。某研究通过元学习框架，实现了模型在多个图像分类任务中的快速适应，展示了其在多任务学习中的潜力。优化训练算法的具体方法可以包括集成强化学习，通过奖励机制引导模型优化方向，某研究在自动驾驶系统中应用此方法，显著提升了决策效率和安全性。\n\n增强对未来研究方向的预测性，还需关注AI技术在可持续发展领域的应用。预测未来几年内，AI在能源优化和环境监测方面的研究将成为热点。某研究通过AI优化电网调度，显著提高了能源利用效率，展示了其在节能减排中的巨大潜力。\n\n增加跨学科视角，可以探讨将神经科学中的脑机接口技术融入AI研究，提升人机交互的自然性和效率。某研究通过脑电信号分析，实现了高效的人机交互系统，展示了其在辅助残障人士方面的应用前景。\n\n强化实证支持，引用某研究在自然语言处理任务中通过大规模语料库验证模型性能的提升，提供详细的实验设置和结果分析，增强了论述的实证基础。\n", "ref_task_step_id": ""}, "__type__": "task_step_node"}, "3e9a2ad0-3314-47be-933a-c61134edc408": {"__data__": {"id_": "3e9a2ad0-3314-47be-933a-c61134edc408", "metadata": {}, "relationships": {}, "hash": "", "start_task_context": "大模型MLA技术细节", "aemo_representation_context": "### 1. 分析近几年研究领域的技术框架与方法论\n在计算机科学相关研究领域，Transformer、GAN、BERT 等框架成为众多论文采用的核心技术。这些框架在不同任务中展现出强大的适应性，其方法论围绕着如何有效处理数据特征、优化模型结构以提升性能。例如，Transformer 基于自注意力机制，打破了传统序列模型的局限性，在自然语言处理和计算机视觉等多领域广泛应用；GAN 通过生成器与判别器的对抗训练，在图像生成等任务上取得显著成果；BERT 则通过预训练方式，极大提升了自然语言处理任务的性能。\n\n### 2. 研究论文中采用的主要框架在不同任务中的应用与变体\n - **Transformer**：在自然语言处理任务中，如机器翻译、文本分类，Transformer 架构不断演变，出现了诸如 ViT（Vision Transformer）等变体应用于计算机视觉任务，将图像视为序列进行处理，展现出跨领域的应用潜力。\n - **GAN**：在图像生成任务中，DCGAN（Deep Convolutional GAN）等变体通过改进网络结构，生成更逼真的图像；在医学图像合成、视频生成等领域也有应用，通过调整损失函数和网络架构适应不同任务需求。\n - **BERT**：除了基础的自然语言理解任务，还在信息检索、情感分析等任务中得到广泛应用，通过微调预训练模型适应特定任务，同时出现了 RoBERTa 等改进版本，优化预训练策略提升性能。\n\n### 3. 评估学术界的技术进步与局限性\n - **技术进步**：模型性能在多个任务上取得显著提升，例如在图像识别准确率、自然语言处理任务的 F1 值等指标上不断刷新记录。新的模型架构和训练方法不断涌现，推动了技术的快速发展。\n - **局限性**：依然存在模型偏差和数据依赖问题。模型在某些特定数据集上表现良好，但在其他数据集或现实场景中泛化能力不足。部分模型对大规模标注数据依赖严重，数据质量和数量影响模型性能，且模型解释性差，难以理解其决策过程。\n\n### 4. 探讨计算模型在不同数据集与应用场景下的适用性与泛化能力\n - **适用性**：不同模型在特定数据集和应用场景下有各自优势。例如，基于深度学习的模型在大规模、高维数据的图像和语音识别任务中表现出色；传统机器学习模型在小数据、简单任务中仍有应用价值。\n - **泛化能力**：尽管部分模型在特定领域取得成功，但在多领域、多模态数据融合的现实应用中，泛化能力面临挑战。多模态数据的异质性和复杂性使得模型难以有效提取和融合特征，限制了其在复杂现实场景中的应用。\n\n### 5. 分析最新算法的稳定性与容错性\n - **稳定性优化**：一些算法针对稳定性进行了优化，例如采用正则化技术、对抗训练等方法提高模型在复杂环境下的稳定性。在动态环境中，部分算法通过在线学习、自适应调整参数等方式保持性能稳定。\n - **大规模数据适应性**：在大规模数据处理上，部分算法通过分布式训练、模型压缩等技术提高计算效率和适应性。但仍有算法在处理大规模数据时面临内存、计算资源等限制，导致性能下降。\n\n### 6. 评估论文中提出的未来研究方向与挑战\n - **新研究问题**：提出了如提升模型可解释性、解决模型偏差和数据依赖、增强多模态数据融合能力等新研究问题。\n - **研究切入点**：从改进模型架构、优化训练算法、探索新的数据增强方法等方面寻找新的研究切入点。这些挑战促使研究者不断探索新的技术和方法，推动后续研究朝着更高效、更智能、更具泛化能力的方向发展。\n\n### 研究成果、方法创新性与应用价值总结\n - **研究成果**：在模型性能提升、新架构和算法提出等方面取得显著成果，推动了计算机科学多个领域的发展。\n - **方法创新性**：通过引入新的技术框架、改进训练方法和优化模型结构等方式，展现出诸多创新点，如自注意力机制、对抗训练等。\n - **应用价值**：在图像、自然语言处理、语音等多个领域有广泛应用，为智能安防、智能医疗、智能交通等现实场景提供技术支持，具有巨大的商业和社会价值。  ", "task_step_name": "研究成果、方法创新性与应用价值总结", "task_step_description": "- **研究成果**：在模型性能提升、新架构和算法提出等方面取得显著成果，推动了计算机科学多个领域的发展。 - **方法创新性**：通过引入新的技术框架、改进训练方法和优化模型结构等方式，展现出诸多创新点，如自注意力机制、对抗训练等。 - **应用价值**：在图像、自然语言处理、语音等多个领域有广泛应用，为智能安防、智能医疗、智能交通等现实场景提供技术支持，具有巨大的商业和社会价值。", "task_step_level": "6", "task_step_question": "在模型性能提升、新架构和算法提出等研究成果方面，具体有哪些数据或实例可以进一步说明其对计算机科学多个领域发展的推动作用？ ", "task_step_question_context": [{"ref_id": "454847062641060886", "chunk_id": "6", "score": 0.3203125, "text": "# CFurther Discussions\nWe summarize some empirical observations as follows.  \n\n1) The CLIP with four training tricks yields about $4\\%$ improvement at Rank-1 in Table 1 of the main paper. It can inspire future works in which the model performance could be boosted by applying these training tricks.  \n\n2) Data augmentation and loss function are common technologies used in various methods. The investigation of more than 20 data augmentations and about 10 loss functions on performance in Tables 2-5 of the main paper provides valuable guidance on future works. Researchers can select proper and effective augmentations and losses into the model for improving performance.   \n3) We explore the internal properties and functionalities of the model for the first time. These results can light future works on model compression, so as to develop a more lightweight and effective TBPS method.   \n4) There are very little research on few-shot TBPS, while this paper makes a preliminary study on CLIP-based fewshot TBPS, providing valuable observation for future research direction."}, {"ref_id": "454848267426884226", "chunk_id": "6", "score": 0.2451171875, "text": "# Ethical Considerations\nOur experiments replicate prior work under comparable experimental conditions. For this reason, we do not expect our work to introduce any novel ethical issues, although our experiments may inherit a similar set of issues concerning PLM (especially large-scale ones), as outlined by various prior work ( Gehman et al. ,2020 ;Bender et al. ,2021 ;Rae et al. ,2021 ;Dinan et al. ,2021 ;Bommasani et al. ,2021 ;Kenton et al. ,2021 ;Weidinger et al. ,2021 ,inter alia ). We remark, however, that conducting these principled comparisons across different models — which requires a degree of hyper-parameter tuning for each model (both at pre-training and fine-tuning stages) in order to enable a fair comparison — requires a large number of computational resources, which may contribute to increased carbon emissions ( Strubell et al. ,2019 ;Patterson et al. ,2021 ).\n\n# Acknowledgement\nWe thank Chris Dyer, John T. Hale, and Laura Rimell at DeepMind, Noah A. Smith at the University of Washington & Allen Institute for Artificial Intelligence, and Qi Huang at Bloomberg for their valuable insights, feedback, and suggestions.\n\n\n\n# A Model Comparison\nIn Table 3 , we outline a summary of various aspects of some commonly-used PLMs that have been proposed to date, summarizing the size of the model, the training data and its size, the text pre-processing scheme, the pre-training objective, and some hyper-parameter details. This table reveals a large variation in the design choices of these PLMs, hence rendering it difficult to conduct apple-to-apple comparisons between different approaches. Common patterns include scaling the model while also using different (often larger) pretraining data, as well as using different training regimes altogether. Each design choice impacts model performance in different ways ( Sennrich and Zhang ,2019 ;Jiao et al. ,2019 ), emphasizing the importance of conducting thorough ablations and apple-to-apple comparisons.  \n\nmodel over the others. We summarize some key design choices in Table 4 .\n\n# B.1 Hyper-Paramaters for Fine-tuning\nWe refer to the original BERT’s hyper-parameters for fine-tuning, but experiment with more finetuning learning rates. In addition to that, we also use three different random seeds. The finetuning hyper-parameters that we used are as follows, which is partially based on prior work ( Joshi et al. ,2020 ):  \n\n•Batch sizes: {16, 32}   \n•Learning rates: {2e-4, 1e-4, 5e-5, 3e-5, 2e5, 1e-5, 5e-6}   \n•Epoch: 4   \n•Random seeds : {1, 41, 386}\n\n# BDetailed Hyper-Parameters\nWhen conducting experiments, we follow BERT’s architecture, training data, and overall hyperparameter choices ( Devlin et al. ,2019 ). One noticeable difference, however, is that we follow RoBERTa to train the model without using a nextsentence prediction loss ( Liu et al. ,2019 ), which has been shown to have a minimal impact on model performance. Each of the three models in our rerun not only has the exact same design choices in terms of training data, text processing, model architecture, etc., but is also implemented on the exact same codebase. Concretely, we use the BERT codebase as implemented on Huggingface, and conduct some slight modifications in terms of removing the next-sentence prediction loss as stated above. When implementing the other models, we take the BERT implementation, and simply change the masking function and pre-training objective in order to replicate the results of GPT-1 and ELMo under comparable conditions as our BERT model. This means that our reruns of the GPT-1 and ELMo models benefit from the exact same technical implementation details as our BERT model by virtue of using identical positional encoding, segment embeddings, etc. We tune the pre-training and fine-tuning learning rate of each model independently (hence the final learning rate for each model may be different), although we strive to dedicate the same amount of compute resources in tuning the hyper-parameters of each model, in order to avoid favoring one"}, {"ref_id": "454846731731167836", "chunk_id": "9", "score": 0.2412109375, "text": "# 4 Paying Off the Scientific Debt: Recommendations and Lessons Learnt\nWe proceed to outline several key recommendations and lessons learnt for encouraging, incentivizing, and accelerating progress in this line of work.  \n\nEstablish standard, publicly available pretraining corpora at multiple data scales. As seen in $\\S3$ , the size and quality of the pre-training data is an important driver behind model performance ( Liu et al. ,2019 ;Hoffmann et al. ,2022 ), which makes a rigorous comparison between different PLMs difficult. Hence, our first recommendation is to establish standard pre-training corpora that are publicly available. We further recommend releasing the pre-training corpora under multiple data scales, as approaches that work best under strict compute or data resource requirements may be different from the case where there is a large amount of compute and data available (§ 3 ,Clark et al. ,2020 ;Treviso et al. ,2022 ). Note that this does not mean that we are discouraging the use of non-standard or even-larger corpora than those that are publicly available. On the contrary, researchers should continue to push the boundaries of what is possible by training on more, better quality, and more recent data. In such cases, we recommend researchers to also release versions of their models that are trained on the standard pre-training corpora — above and beyond the version trained on proprietary & large-scale data that would presumably be necessary to achieve a new state-of-the-art — in order to facilitate a fair and principled comparison with prior work. We encourage the community to continually release new standardized pre-training datasets as time passes to avoid the effect of pre-training data staleness (Lazaridou et al. ,2021 ).  \n\n<html><body><table><tr><td>Model</td><td>CoLA</td><td>MNLI(-m)</td><td>MRPC</td><td>QNLI</td><td>QQP</td><td>RTE</td><td>SST-2</td><td>STS-B</td><td>Avg</td></tr><tr><td colspan=\"10\">Original published results</td></tr><tr><td>BERT</td><td>52.1</td><td>84.6</td><td>88.9</td><td>90.5</td><td>71.2</td><td>66.4</td><td>93.5</td><td>85.8</td><td>79.1</td></tr><tr><td>BERTLarge</td><td>60.5</td><td>86.7</td><td>89.3</td><td>92.7</td><td>72.1</td><td>70.1</td><td>94.9</td><td>86.5</td><td>81.6</td></tr><tr><td>GPT-1</td><td>45.4</td><td>82.1</td><td>82.3</td><td>87.4</td><td>70.3</td><td>56.0</td><td>91.3</td><td>80.0</td><td>74.4</td></tr><tr><td>BiLSTM+ELMo+Attn</td><td>36.0</td><td>76.4</td><td>84.9</td><td>79.8</td><td>64.8</td><td>56.8</td><td>90.4</td><td>73.3</td><td>70.3</td></tr><tr><td colspan=\"10\">Our replication with proper controls & comparable experimental conditions</td></tr><tr><td>BERTRerun</td><td>50.8</td><td>84.5</td><td>89.0</td><td>90.5</td><td>71.0</td><td>61.0</td><td>93.1</td><td>84.4</td><td>78.0</td></tr><tr><td>Comparable GPT-1 Rerun - L2R</td><td>41.6</td><td>87.4</td><td>84.7</td><td>86.6</td><td>68.8</td><td>62.9</td><td>91.8</td><td>79.3</td><td>75.4</td></tr><tr><td>Comparable GPT-1 Rerun -R2L</td><td>42.5</td><td>82.0</td><td>85.5</td><td>88.3</td><td>69.1</td><td>57.6</td><td>92.8</td><td>79.1</td><td>74.6</td></tr><tr><td>ComparableELMo-variantRerun</td><td>46.8</td><td>83.6</td><td>85.8</td><td>89.9</td><td>70.8</td><td>61.9</td><td>93.1</td><td>82.1</td><td>76.8</td></tr><tr><td>Ensemble of Comparable GPT-1: L2R + R2L</td><td>45.1</td><td>83.7</td><td>85.8</td><td>88.9</td><td>70.8</td><td>62.4</td><td>92.9</td><td>81.0</td><td>76.3</td></tr><tr><td>Ensemble of Comparable GPT-1: L2R + L2R</td><td>42.4</td><td>83.5</td><td>85.1</td><td>87.8</td><td>70.0</td><td>63.1</td><td>93.1</td><td>79.9</td><td>75.6</td></tr></table></body></html>  \n\nTable 1: GLUE test results. We use F1 scores for MRPC and QQP, Matthew’s Correlation for CoLA, SpearmanR for STS-B, and accuracy for the rest; all models are pre-trained with the same batch size & compute (1M steps).   \n\n\n<html><body><table><tr><td>Model</td><td>CoLA</td><td>MNLI(-m)</td><td>MRPC</td><td>QNLI</td><td>QQP</td><td>RTE</td><td>SST-2</td><td>STS-B</td><td>Avg</td></tr><tr><td>BERT Rerun</td><td>43.8</td><td>80.9</td><td>86.4</td><td>87.9</td><td>69.3</td><td>59.3</td><td>90.0</td><td>80.4</td><td>74.8</td></tr><tr><td>Comparable GPT-1 Rerun: L2R</td><td>43.5</td><td>80.3</td><td>84.1</td><td>86.3</td><td>68.4</td><td>63.0</td><td>91.0</td><td>77.8</td><td>74.3</td></tr><tr><td>Comparable GPT-1 Rerun: R2L</td><td>36.2</td><td>80.6</td><td>82.4</td><td>88.2</td><td>68.7</td><td>53.7</td><td>93.0</td><td>77.8</td><td>72.6</td></tr><tr><td>Ensemble of GPT-1 Rerun: L2R + R2L</td><td>45.1</td><td>82.6</td><td>84.4</td><td>88.3</td><td>70.8</td><td>62.9</td><td>93.5</td><td>79.9</td><td>75.9</td></tr></table></body></html>\n\nTable 2: GLUE test set results using the pre-trained model, after training for 200,000 steps followed by fine-tuning.  \n\nExplicitly delineate the different types of contributions behind each work, including both the key novelty and engineering contributions. We recommend that PLM research explicitly state the key novelty behind each work ( e.g., the bidirectional masked LM loss for BERT), delineate and explicitly state other contributions (including engineering ones) and design choices that can impact performance, and outline how these differ from prior work ( e.g., better model partitioning for training larger models on multiple devices, better filtering of the training data, more extensive hyperparameter tuning, etc.). Combined with strong baselines and extensive ablations (see below), this will enable us to better understand how much of the performance gains can be attributed to each factor, including the key novelty behind the approach.  \n\nInvest comparable effort into tuning both the baselines and the newly-proposed models. In practice, many of the contributions ( e.g., better hyper-parameters, better data, etc.) would also be applicable to the baselines. We recommend each PLM work to discern which of their design choices can also be applied to the baselines, and apply those techniques in order to create stronger baselines that may nevertheless rival the performance of more recent models (§ 3 ,Melis et al. ,2018 ;Lei ,More extensive ablation studies. When proposing multiple contributions at once (as many PLM papers do), we recommend conducting as many ablation studies as is feasible to isolate the impact of each component under comparable conditions. In light of recent trends where models — including open-sourced ones — are publicly released without technical reports or papers that outline technical details regarding model evaluation and benchmarking ( Taori et al. ,2023 ;Chiang et al. ,2023 ), we argue that our recommendation for conducting more thorough evaluations is even more critical.  \n\nBetter credit assignment is needed. As shown in Table 1 , the vast gap between BERT and ELMo can nearly be bridged by using (i) the same (larger) pre-training data, (ii) Transformer architectures, and (iii) whole model fine-tuning; all of which were already used and proposed by the GPT-1 model. As these techniques account for a more significant chunk of the performance difference than the bidirectional masked LM loss, disentangling each factor’s contribution thus provides an opportunity to conduct better credit assignment in the field.  \n\nStrike a balance between pushing the stateof-the-art and advancing our scientific understanding. In some sense, recent rapid progress is made possible by a strong emphasis on building the next state-of-the-art PLMs and foundation models, although it comes at a cost of understanding — from the scientific point of view — where the performance improvements are coming from, and which techniques work best under what circumstances. We argue that both lines of work — one that pushes the state-of-the-art at breakneck speed and through all available means, and another that aims to resolve the scientific and technical debt by disentangling the impact of multiple factors of model improvements (which we argue is still currently underrepresented in the field) — should be conducted, encouraged, and rewarded within the field. We outline two concrete recommendations for striking a better balance between the two lines of work. First, public release of PLMs or their downstream applications should be promptly accompanied by a technical description of the model, ideally in the form of a technical report or a scientific paper. This would enable the community to better understand the key component behind these models’ success, allow future work to replicate the results, and promptly disentangle the different components behind model improvements. Second, we as a community should not necessarily expect both types of contributions under the same paper. Just like how the cleaning up of technical debt happens after the initial code has been written, it is often the case that prior work that resolves the scientific debt through principled comparisons was only conducted after substantial progress in advancing the state-of-the-art (often through all available means for improving model performance) had been made. We should, however, encourage the community to conduct such understanding line of work promptly after major milestones or exciting results.  \n\nReward and encourage a line of work that focuses on understanding (not just those that chase a new state-of-the-art), even when they are imperfect. The current, rapid pace of the field provides an incentive to spend one’s (finite) computational resources and effort for building the next state-of-the-art, albeit at the expense of scientific rigour and principled comparisons. Given a fi- nite amount of compute, there is arguably more incentive in tuning one’s proposed approach through all possible means ( e.g., using larger datasets and larger models, training for longer, etc.), topping the leaderboards, and publishing the paper, even if this leaves no computational resources to tune the baselines and conduct rigorous ablations. Furthermore, the rapidly increasing cost of training ever-larger PLMs means that any principled comparisons are most likely imperfect (§ 7 ) — e.g., how do our findings in $\\S3$ change with models that are trained for longer, like RoBERTa? Or with encoder-decoder models like T5? Or in other languages? Indeed, our experiments in $\\S3$ are fairly narrow in scope, involving only three nonrecent models (BERT, ELMo, GPT-1) and a training dataset that is small by today’s standards. Yet due to the rigorous hyper-parameter tuning of all three models, conducting these principled comparisons required an enormous amount of compute resources — equivalent to training 10 BERTs from scratch. This cost would have been even higher with the inclusion more models, languages, and larger datasets. On this point, we remark that doing such principled comparisons — even when they are limited in scope and done on smaller models — still contributes towards paying off the scientific debt, better understanding where our current progress is coming from, and deriving valuable insights that can contribute to the development of next generation PLMs. We additionally call on those in our community who serve as reviewers to recognize and reward these types of research contributions, which are complementary (if perhaps equally important) to a parallel line of work that pushes the state-of-the-art in PLM research through all possible means.  \n\nWe need more comprehensive PLM scaling laws. Our experiments and recommendations still leave a major open question: How can we scale these kinds of investigations to much larger PLMs, which are much more computationally expensive? To that end, scaling laws (Kaplan et al. ,2020 ;Hoffmann et al. ,2022 ) provide an account of how PLM performance changes with respect to different factors, allowing us to accurately extrapolate that a PLM with X parameters and Y training steps should achieve a perplexity of Z. However, we argue that current scaling laws are still overly narrow in scope: Concretely, existing scaling laws often only apply to decoder-only / unidirectional PLMs, and only provide an account of how their performance changes with respect to (i) model size and (ii) the number of training tokens. We call on the community to develop more comprehensive scaling laws that take into account and characterize how other factors impact LM performance and downstream behavior, including how model performance and behavior change with respect to the choice of the objective function and model hyper-parameters, and the quality of the pretraining data. The existence of such scaling laws — which can happen by pooling community data on various PLM pre-training runs and their corresponding perplexity and downstream performance — would allow other researchers to accurately extrapolate how their findings would generalize to other PLM model sizes, objective functions, etc. Most importantly, comprehensive scaling laws can disentangle and quantify how these different factors contribute to determine the final model performance under various experimental conditions.  \n\nHow conducting rigorous experiments and ablation studies can lead to new state-of-the-art results. Lastly, we argue that conducting rigorous experiments and ablation studies for paying off the scientific debt should not necessarily come at the expense of achieving a new state-of-theart. In contrast, doing so can be a key ingredient for building the next state-of-the-art PLMs. In 2020, Kaplan et al. (2020 ) proposed a seminal scaling law that showed how larger PLMs are more sample-efficient, and that one should always increase model size when increasing the pre-training compute budget, leading the community to develop ever-larger PLMs in response ( Rae et al. ,2021 ;Smith et al. ,2022 ,inter alia ). Nevertheless, subsequent rigorous experiments from Hoffmann et al. (2022 ) demonstrated that the optimal pretraining compute allocation should, in fact, also be scaled in another dimension: The amount of pretraining data that the model is trained on. This insight was then used to build smaller, more efficient, and cheaper-to-run PLMs that, at the time of its release, achieved new state-of-the-art results that outperformed much larger PLMs that were undertrained in comparison. Going forward, we conjecture that rigorous experiments and ablation studies that look at factors above and beyond model size and data quantity, such as the quality of the pre-training data, the exact hyper-parameters, the pre-training objective, etc., will not only be useful to understand how these factors improve performance and thus pay off the scientific debt, but also form a key ingredient for building the next generation of better PLMs."}], "task_step_question_answer": "此外，在工业制造领域，利用计算机视觉技术和机器学习算法，可以实现对生产线上产品的质量检测和缺陷识别，大大提高了生产效率和产品质量。通过对生产数据的实时分析，还能优化生产流程，降低生产成本。在交通领域，研究成果为智能交通系统的发展提供了有力支持。例如，通过对交通流量数据的分析和预测，可以实现智能交通信号灯的优化控制，减少拥堵，提高道路通行能力。自动驾驶技术的不断进步，也有望提升交通安全和出行效率。", "ref_task_step_id": ""}, "__type__": "task_step_node"}}, "task_step_store/ref_task_step_info": {"": {"node_ids": ["8da2e2af-46ef-4ee5-8766-c77589af9874", "0b08a81b-65f3-4cf0-9626-683e37b4bdaa", "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa", "02c99ed3-dc6a-4b2d-bbff-109a51351344", "d04736cf-c340-414e-a4a7-79dcf60c22c3", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d", "3e9a2ad0-3314-47be-933a-c61134edc408", "3e9a2ad0-3314-47be-933a-c61134edc408", "8da2e2af-46ef-4ee5-8766-c77589af9874", "0b08a81b-65f3-4cf0-9626-683e37b4bdaa", "d04736cf-c340-414e-a4a7-79dcf60c22c3", "02c99ed3-dc6a-4b2d-bbff-109a51351344", "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d", "8da2e2af-46ef-4ee5-8766-c77589af9874", "02c99ed3-dc6a-4b2d-bbff-109a51351344", "d04736cf-c340-414e-a4a7-79dcf60c22c3", "0b08a81b-65f3-4cf0-9626-683e37b4bdaa", "3e9a2ad0-3314-47be-933a-c61134edc408", "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa", "8da2e2af-46ef-4ee5-8766-c77589af9874", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d", "02c99ed3-dc6a-4b2d-bbff-109a51351344", "d04736cf-c340-414e-a4a7-79dcf60c22c3", "0b08a81b-65f3-4cf0-9626-683e37b4bdaa", "3e9a2ad0-3314-47be-933a-c61134edc408", "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d", "8da2e2af-46ef-4ee5-8766-c77589af9874", "8da2e2af-46ef-4ee5-8766-c77589af9874", "8da2e2af-46ef-4ee5-8766-c77589af9874", "8da2e2af-46ef-4ee5-8766-c77589af9874", "02c99ed3-dc6a-4b2d-bbff-109a51351344", "02c99ed3-dc6a-4b2d-bbff-109a51351344", "0b08a81b-65f3-4cf0-9626-683e37b4bdaa", "0b08a81b-65f3-4cf0-9626-683e37b4bdaa", "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa", "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa", "8da2e2af-46ef-4ee5-8766-c77589af9874", "8da2e2af-46ef-4ee5-8766-c77589af9874", "d04736cf-c340-414e-a4a7-79dcf60c22c3", "d04736cf-c340-414e-a4a7-79dcf60c22c3", "3e9a2ad0-3314-47be-933a-c61134edc408", "3e9a2ad0-3314-47be-933a-c61134edc408", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d", "02c99ed3-dc6a-4b2d-bbff-109a51351344", "02c99ed3-dc6a-4b2d-bbff-109a51351344", "0b08a81b-65f3-4cf0-9626-683e37b4bdaa", "0b08a81b-65f3-4cf0-9626-683e37b4bdaa", "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa", "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d", "3e9a2ad0-3314-47be-933a-c61134edc408", "3e9a2ad0-3314-47be-933a-c61134edc408", "8da2e2af-46ef-4ee5-8766-c77589af9874", "8da2e2af-46ef-4ee5-8766-c77589af9874", "d04736cf-c340-414e-a4a7-79dcf60c22c3", "d04736cf-c340-414e-a4a7-79dcf60c22c3", "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa", "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa", "0b08a81b-65f3-4cf0-9626-683e37b4bdaa", "0b08a81b-65f3-4cf0-9626-683e37b4bdaa", "8da2e2af-46ef-4ee5-8766-c77589af9874", "8da2e2af-46ef-4ee5-8766-c77589af9874", "3e9a2ad0-3314-47be-933a-c61134edc408", "3e9a2ad0-3314-47be-933a-c61134edc408", "d04736cf-c340-414e-a4a7-79dcf60c22c3", "d04736cf-c340-414e-a4a7-79dcf60c22c3", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d", "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d", "02c99ed3-dc6a-4b2d-bbff-109a51351344"], "metadata": {}}}, "task_step_store/metadata": {"8da2e2af-46ef-4ee5-8766-c77589af9874": {"task_step_hash": "", "ref_task_step_id": ""}, "0b08a81b-65f3-4cf0-9626-683e37b4bdaa": {"task_step_hash": "", "ref_task_step_id": ""}, "fc9ce0a4-4b19-4d3e-a44a-994be0efc0fa": {"task_step_hash": "", "ref_task_step_id": ""}, "02c99ed3-dc6a-4b2d-bbff-109a51351344": {"task_step_hash": "", "ref_task_step_id": ""}, "d04736cf-c340-414e-a4a7-79dcf60c22c3": {"task_step_hash": "", "ref_task_step_id": ""}, "3ce7a6c2-7bf0-43d2-ab8f-ea242c24394d": {"task_step_hash": "", "ref_task_step_id": ""}, "3e9a2ad0-3314-47be-933a-c61134edc408": {"task_step_hash": "", "ref_task_step_id": ""}}}