{"analysis_store/data": {"12c1fd96-fa01-41ad-8a70-aad9607ee8d4": {"__data__": {"id_": "12c1fd96-fa01-41ad-8a70-aad9607ee8d4", "metadata": {}, "relationships": {}, "hash": "", "story_scenario_context": "### 第一步：提取关键信息\n1. **研究方向相关**：社交媒体中的爱情表现、卢曼爱情语义学在电视电影中的应用、深入研究卢曼理论及其在社会学研究中的潜在应用、探讨卢曼理论和社会学的交叉点。\n2. **关联关系相关**：研究与社会学研究情感因素密切相关、讨论与媒体语义信息有关、卢曼爱情语义学与社交媒体内容密切相联、卢曼理论与社交媒体爱情表现的接近度、卢曼爱情语义学与社会学观点相交、社交媒体爱情表现与卢曼理论存在重叠。\n\n### 第二步：总结突出特点\n1. **研究建议多元**：涵盖社交媒体爱情表现、影视应用以及理论深入研究等多个方向。\n2. **强调关联**：突出卢曼爱情语义学与社交媒体内容、社会学研究之间的紧密联系，以及研究与情感因素、媒体语义信息的相关性。 ", "scene_monologue_context": "今天我主要在研究算法相关的内容。先是深入分析最新算法的稳定性与容错性，思考在处理大规模数据时，那些因内存和计算资源限制导致性能下降的算法，能不能通过采用正则化技术、对抗训练等稳定性优化方法，来提升在大规模数据环境下的稳定性和适应性。  \n\n在研究过程中，我阅读了大量文献资料，像关于BatchNorm层在图像分类器中作用的内容，以及不同归一化层在协同训练中的表现。从相关研究里了解到，一些方法在特定情况下会出现性能下降的问题，比如Xie等人在2019年的研究表明，优化协同训练损失在某些条件下对干净图像的效果不如简单的常规训练。同时，通过对各种模型架构在训练过程中的干净准确率和鲁棒准确率的分析，发现了一些有趣的现象，例如使用单组批统计但针对干净和对抗图像设置特定的尺度和偏移参数，也能取得与使用两组批统计类似的分类效果。  \n\n另外，我还关注到将对抗训练与适配器结合的研究，这里把模型参数分解为不同域共享的参数和特定域的参数，并基于此优化损失函数。而且还探讨了模型融合的概念，提出了对抗模型融合的假设，认为通过适配器训练可能实现模型融合，不过后续的评估显示，在独立的常规模型和鲁棒模型之间进行模型融合是失败的。  \n\n在实验方面，我参与了对算法性能评估的实验。为了公平地将我们的方法与基线方法进行比较，在给定数据集上对所有方法使用相同的超参数集。在GLUE基准测试和Long Range Arena基准测试中，观察到随着加速比增加或空间复杂度降低，我们的Coreset-select-opt方法与竞争对手之间的差距逐渐增大，在一些情况下表现出明显优势。  \n\n同时，我还参与了关于攻击防御模型的实验。在特定的硬件环境下，使用SecML库对四种被报道为失败的防御方法进行攻击实验。针对不同的防御方法，设置相应的攻击超参数，收集类似结果。通过实验发现，我们提出的指标与防御的安全评估故障存在相关性，较高的鲁棒准确率往往与检测到的故障相关联。并且利用这些指标改进安全评估质量，通过一系列步骤，如按照原防御作者的攻击策略测试防御、选择失败案例并检查指标反馈、应用指标建议的补救措施等，成功降低了目标模型的鲁棒准确率和指标值。  ", "user_id": "此来访者", "scene_content": "角色    内容    分镜\n", "story_board_summary_context": "d04736cf-c340-414e-a4a7-79dcf60c22c3:「分析最新算法的稳定性与容错性」\nd04736cf-c340-414e-a4a7-79dcf60c22c3:「在处理大规模数据时，那些面临内存和计算资源限制导致性能下降的算法，是否可以借鉴采用正则化技术、对抗训练等稳定性优化方法来提升在大规模数据环境下的稳定性和适应性？ 」\nd04736cf-c340-414e-a4a7-79dcf60c22c3:「ref_ids: 454848769189392150, chunk_ids: 4, Score: 0.1855, Text: # 3.2 SEPARATING BATCH STATISTICS IS NOT NECESSARY\nBatchNorm is a widely used normalization layer shown to improve performance and training stability of image classifiers ( Ioffe & Szegedy ,2015 ). We recall that a BatchNorm layer, given a batch as input, first normalizes it by subtracting the mean and dividing by the standard deviation computed over the entire batch, then it applies an affine transformation, with learnable scale and offset parameters. During training, it accumulates these so-called batch statistics to use during test time, so that the output of the classifier for each image is independent of the other images in the batch. The batch statistics can be seen an approximation of the statistics over the image distribution.  \n\nXie et al. (2019a ) show that optimizing the co-training loss in Eq. 1 can yield worse results on clean images than simple nominal training. This is especially the case when the network has a low capacity or the attack (i.e., the inner maximization) is too strong (such as using a large perturbation radius $\\\\epsilon$ ). To solve this issue, they propose AdvProp, which consists in using distinct BatchNorm layers for clean and adversarial images. They argue that “maintaining one set of [BatchNorm] statistics results in incorrect statistics estimation” , which could be the reason for the performance degradation. We note that using two sets of BatchNorm layers for the clean and adversarial samples as in AdvProp creates two sets of batch statistics but also two sets of learnable scale and offset parameters. In the following we investigate whether having separate batch statistics is a necessary condition for successful co-training.  \n\n  \nFigure 2: Dual parameters are enough. We report the clean (solid lines) and robust accuracy (dashed lines) over training steps of R ES NET -50 trained on I MAGE NET with the co-training loss of Eq. 1 $(\\\\epsilon=4/255)$ : for models with dual layers. Clean accuracy refers to the clean mode and the robust accuracy to the robust mode .Left panel. We compare models with different normalization layers with no domain-specific parameters (Shared BatchNorm, Shared LayerNorm, Shared GroupNorm) to Dual BatchNorm as proposed by Xie et al. (2019a ): regardless of the type of normalization, the robustness of classifiers without dual layers drops to (almost) zero at the end of training. Right panel. We use domain-specific normalization layers (Dual BatchNorm, Dual LayerNorm, Dual GroupNorm) and a model with BatchNorm with shared batch statistics but domain-specific scale and offset (DualParams BatchNorm): all models achieve high clean and robust accuracy.  \n\nFigure 2 shows the clean and robust accuracy of various model architectures as training progresses. The left panel demonstrates that, if we share both batch statistics and scales/offsets (Shared BatchNorm, orange curves), the robust accuracy (orange dashed line) quickly drops, far from the one obtained by AdvProp (Dual BatchNorm, blue curve) which is above $34\\\\%$ . However, if we use a single set of batch statistics but specific scales and offsets for clean and adversarial images, we can observe on the right panel of Figure 2 that the robust accuracy (DualParams BatchNorm, orange dashed line) matches the one (blue dashed line) obtained by AdvProp. This demonstrates that it is possible to achieve nominal and robust classification results similar to those of AdvProp without separate batch statistics.  \n\nFurthermore, there exist normalization layers such as LayerNorm ( Ba et al. ,2016 ) or GroupNorm (Wu & He ,2018 ) which do not use batch statistics, as their normalization step is done per sample and not per batch. Hence, according to the hypothesis of Xie et al. (2019a ), these types of normalization layer should not suffer from performance degradation. Nevertheless, the left panel of Figure 2 shows that their robust accuracy (green and red dashed lines) does not match the robust accuracy of AdvProp (Dual BatchNorm), and is unstable over training steps. However, by making the scales and offsets of LayerNorm and GroupNorm specific to clean and adversarial images, their robust accuracy matches that obtained with dual BatchNorm layers, as shown in the right panel of Figure 2 . This suggests that a key element to make the co-training loss of Eq. 1 work for various normalization layers is to have trainable parameters which are specific to the clean and adversarial images.\n\n# 3.3 REVISITING ADAPTERS WITH ADVERSARIAL TRAINING\nThe last observation strongly relates this setting to the adapters literature where a single backbone architecture has some parameters, called adapters, which are specific to different domains while the rest of the parameters are shared among tasks. In our case, the clean images form one domain and the adversarial images constitute another domain. In this work, we go beyond having separate normalization layers for the clean and adversarial images and investigate other types of adapters.  \n\nFormally, the model parameters $\\\\pmb{\\\\theta}$ can be decomposed into parameters $\\\\psi$ which are shared among domains and parameters $\\\\phi$ which are specific to a domain. We call $\\\\phi_{\\\\mathrm{clean}}$ the parameters used when training on clean images and $\\\\phi_{\\\\mathrm{adv}}$ the parameters used when training on adversarial images. For example, in Section 3.2 , when we used dual LayerNorm layers, the scales and offsets of these normalization layers are contained in $\\\\phi_{\\\\mathrm{clean}}$ and $\\\\phi_{\\\\mathrm{adv}}$ whereas the rest of the model parameters are in $\\\\psi$ . Based on Eq. 1 , we optimize the following loss:  \n\n$$\n\\\\alpha L(f(\\\\pmb{x};\\\\psi\\\\cup\\\\phi_{\\\\mathrm{clean}}),y)+(1-\\\\alpha)\\\\operatorname*{max}_{\\\\pmb{\\\\delta\\\\in\\\\mathbb{S}}}L(f(\\\\pmb{x}+\\\\pmb{\\\\delta};\\\\psi\\\\cup\\\\phi_{\\\\mathrm{adv}}),y).\n$$  \n\nFinally, we introduce some notation for models with a s at inference time: we call $f(\\\\cdot;\\\\psi\\\\cup\\\\phi_{\\\\mathrm{clean}})$ the clean mode for prediction as we use the adapters $\\\\phi_{\\\\mathrm{clean}}$ trained on the clean data. Conversely, we call $f(\\\\cdot;\\\\psi\\\\cup\\\\phi_{\\\\mathrm{adv}})$ the robust mode when using the adapters $\\\\phi_{\\\\mathrm{adv}}$ trained on the perturbed data.  \n\nWortsman et al. (2022 ) propose model soups , which consist in averaging the weights of multiple models fine-tuned from the same pre-trained model. The resulting weight averaged model can benefit from the original models without incurring any extra compute and memory cost at inference time. Currently, in our setting the user would have to know at test time if the network should be in clean or robust mode . A model soup , by its ability to merge models, is a way to bypass this issue. We formulate the hypothesis that training with adapters enables model soups . With this in mind, we observe that training with adapters means that most of the model parameters are already shared, so model souping would simply consist in linearly interpolating the weights of the adapters for the two modes. We call adversarial model soups , the model soups with a model co-trained on clean and adversarial samples. We get the following parametrized model:  \n\n$$\nf(\\\\cdot;\\\\psi\\\\cup(\\\\beta\\\\phi_{\\\\mathrm{clean}}+(1-\\\\beta)\\\\phi_{\\\\mathrm{adv}}))\n$$  \n\nwhere $\\\\beta$ is the weighting factor when averaging the adapters. If $\\\\beta=1$ , the model soup boils down to the clean mode and conversely $\\\\beta=0$ corresponds to the robust mode . In Section 5.2 , we assess this hypothesis and show that forming model soups between independent nominal and robust models fails.」\nd04736cf-c340-414e-a4a7-79dcf60c22c3:「ref_ids: 454895453635358570, chunk_ids: 6, Score: 0.1680, Text: # 6.2 Implementation\nTo fairly evaluate our method against the baselines, we use the same set of hyperparameters for all the methods, for a given dataset. For details, see Appendix D. The code for Pyramid-BERT is made available as a supplementary material with the submission. The training and inference jobs are run separately on a NVIDIA Tesla V 100 GPU machine and a Intel Xeon Platinum 8000 series CPU machine respectively. All the accuracy and speedup scores are averaged over 20 trials.\n\n# 6.3 Results on GLUE benchmarks\nWe first examine the trade-off between accuracy and speedup. The accuracy results for $3X$ and $1.5X$ speedup are summarized in Table 1 and 2 respectively. The results for $3.5X$ and $2X$ speedup are given in the Table 11 and 13 in Appendix E.We observe that as the speedup increases the gap between our Coreset-select-opt and its competitors becomes large, where for $3X$ speedup, Coreset-select-opt outperforms the second best method Attention-select by $1\\\\%$ accuracy in average and beats the standard baselines by $2\\\\%$ or more. The Average-pool performs the worst in average across the GLUE benchmarks, specially on the COLA dataset. For detailed justification, see Appendix E. To better understand the performance of Coreset-select-opt with different values of $m$ ,an ablation study is shown in Section 7 . For mild speedup of $1.5X$ , we note that all methods (except Average-pool ) suffer only a small loss in accuracy and our method suffers no loss. A similar situation occurs when viewing the tradeoff between space complexity and accuracy, where we provide results for a memory reduction of $70\\\\%$ and $30\\\\%$ in the Tables 3 and 16 (in $\\\\S\\\\mathrm{~E~}$ ).\n\n# 6.4 Results on Long Range Arena\nWe show results on the following three datasets of LRA benchmark: (1) byte-level text classification using real-world data (IMDB), (2) Pathfinder task (long range spatial dependency problem), and (3) image classification on sequences of pixels converted from CIFAR-10.  \n\n<html><body><table><tr><td>Dataset</td><td>1st-I</td><td>1st</td><td>Rand</td><td>Pool</td><td>Att</td><td>CS-k-1</td><td>CS-opt</td><td>BERTBase</td></tr><tr><td>STS-B</td><td>86.4</td><td>86.4</td><td>86.8</td><td>81.6</td><td>87.0</td><td>87.0</td><td>87.0</td><td>87.9</td></tr><tr><td>MRPC</td><td>81.4</td><td>80.9</td><td>83.2</td><td>83.9</td><td>84.6</td><td>86.2</td><td>86.9</td><td>87.3</td></tr><tr><td>SST-2</td><td>83.8</td><td>84.4</td><td>85.6</td><td>85.2</td><td>86.0</td><td>87.3</td><td>89.6</td><td>92.4</td></tr><tr><td>QNLI</td><td>84.8</td><td>84.4</td><td>86.4</td><td>84.1</td><td>86.8</td><td>87.8</td><td>87.8</td><td>90.9</td></tr><tr><td>COLA</td><td>49.7</td><td>49.7</td><td>49.5</td><td>3.0</td><td>51.1</td><td>51.7</td><td>52.8</td><td>53.3</td></tr><tr><td>RTE</td><td>63.5</td><td>63.5</td><td>62.1</td><td>59.2</td><td>63.4</td><td>63.7</td><td>63.7</td><td>65.8</td></tr><tr><td>MNLI_M</td><td>77.8</td><td>76.7</td><td>81.4</td><td>75.4</td><td>82.5</td><td>82.4</td><td>82.5</td><td>84.0</td></tr><tr><td>MNLI_MM</td><td>75.9</td><td>75.6</td><td>78.7</td><td>76.7</td><td>82.7</td><td>82.6</td><td>82.7</td><td>84.6</td></tr><tr><td>QQP</td><td>80.8</td><td>80.4</td><td>87.0</td><td>79.4</td><td>87.3</td><td>87.3</td><td>87.3</td><td>87.5</td></tr><tr><td>Mean</td><td>76.0</td><td>76.1</td><td>77.9</td><td>69.6</td><td>79.0</td><td>79.6</td><td>80.0</td><td>81.5</td></tr></table></body></html>  \n\nTable 1: GLUE dev performance at $3X$ speedup. Here and everywhere else, F 1 scores are reported for QQP and MRPC, Spearman correlations are reported for STS-B, Matthew’s correlations are reported for COLA, and accuracy scores are reported for the other tasks. Each value is averaged over 20 trials. Larger values indicates better performance.   \nTable 2: GLUE dev performance at $1.5X$ speedup.   \n\n\n<html><body><table><tr><td>Dataset</td><td>1st-I</td><td>1st</td><td>Rand</td><td>Pool</td><td>Att</td><td>CS-k-1</td><td>CS-opt</td><td>BERTBase</td></tr><tr><td>STS-B</td><td>87.9</td><td>87.9</td><td>87.8</td><td>87.8</td><td>87.9</td><td>87.7</td><td>87.9</td><td>87.9</td></tr><tr><td>MRPC</td><td>86.8</td><td>86.4</td><td>87.2</td><td>87.0</td><td>87.1</td><td>86.9</td><td>87.3</td><td>87.3</td></tr><tr><td>SST-2</td><td>92.1</td><td>91.5</td><td>91.9</td><td>90.3</td><td>92.3</td><td>92.4</td><td>92.4</td><td>92.4</td></tr><tr><td>QNLI</td><td>90.8</td><td>90.8</td><td>90.8</td><td>90.2</td><td>90.7</td><td>90.9</td><td>90.9</td><td>90.9</td></tr><tr><td>COLA</td><td>53.0</td><td>52.7</td><td>53.1</td><td>25.6</td><td>53.2</td><td>53.3</td><td>53.3</td><td>53.3</td></tr><tr><td>RTE</td><td>65.6</td><td>65.2</td><td>65.7</td><td>61.5</td><td>65.7</td><td>65.4</td><td>65.6</td><td>65.8</td></tr><tr><td>MNLI_M</td><td>84.0</td><td>83.8</td><td>83.9</td><td>80.9</td><td>84.0</td><td>84.0</td><td>84.0</td><td>84.0</td></tr><tr><td>MNLI_MM</td><td>84.1</td><td>84.0</td><td>83.9</td><td>84.0</td><td>84.5</td><td>84.6</td><td>84.6</td><td>84.6</td></tr><tr><td>QQP</td><td>87.1</td><td>86.9</td><td>87.4</td><td>85.7</td><td>87.4</td><td>87.5</td><td>87.5</td><td>87.5</td></tr><tr><td>Mean</td><td>81.3</td><td>81.0</td><td>81.3</td><td>76.8</td><td>81.4</td><td>81.4</td><td>81.5</td><td>81.5</td></tr></table></body></html>  \n\nFor baselines, we include First$.k$ -select and Random-select methods, but fail to include Attention-select .Attention-select requires a full attention matrix for selecting tokens which is not available in Big Bird (Zaheer et al. ,2020 ) and Performers (Choromanski et al. ,2020 ). In addition, the Transformers including Big Bird and Performers in LRA have shallow architectures because of no pre-training: the default number of encoders for text classification, path finder, and image classifi- cation datasets are four, four, and one, respectively. Thus, for both baselines and our method, we only reduce sequence length in the input layer , which is before the first encoder. For the sequence-length configurations, see Appendix C.2 . For Averagepool , due to its worst performance on the GLUE benchmarks and the shallow architectures of the models in LRA, we exclude it from the baselines.  \n\nTable 3: GLUE dev performance at $70\\\\%$ space complexity reduction.   \n\n\n<html><body><table><tr><td>Dataset</td><td>1st-I</td><td>1st</td><td>Rand</td><td>Pool</td><td>Att</td><td>CS-k-1</td><td>CS-opt</td><td>BERTBase</td></tr><tr><td>STS-B</td><td>85.3</td><td>85.1</td><td>85.6</td><td>78.7</td><td>85.4</td><td>86.5</td><td>86.7</td><td>87.9</td></tr><tr><td>MRPC</td><td>81.3</td><td>81.5</td><td>83.3</td><td>83.1</td><td>84.3</td><td>86.0</td><td>86.6</td><td>87.3</td></tr><tr><td>SST-2</td><td>83.3</td><td>84.6</td><td>84.9</td><td>85.1</td><td>87.2</td><td>87.6</td><td>87.7</td><td>92.4</td></tr><tr><td>QNLI</td><td>84.6</td><td>84.3</td><td>85.1</td><td>84.0</td><td>86.4</td><td>86.6</td><td>86.5</td><td>90.9</td></tr><tr><td>COLA</td><td>49.0</td><td>49.0</td><td>48.4</td><td>0.0</td><td>50.9</td><td>51.0</td><td>52.3</td><td>53.3</td></tr><tr><td>RTE</td><td>62.1</td><td>62.0</td><td>61.8</td><td>59.8</td><td>62.7</td><td>63.6</td><td>63.6</td><td>65.8</td></tr><tr><td>MNLI_M</td><td>76.9</td><td>76.3</td><td>79.0</td><td>75.2</td><td>80.5</td><td>80.9</td><td>81.0</td><td>84.0</td></tr><tr><td>MNLI_MM</td><td>74.9</td><td>74.5</td><td>79.3</td><td>76.3</td><td>80.7</td><td>81.6</td><td>81.8</td><td>84.6</td></tr><tr><td>QQP</td><td>80.6</td><td>80.0</td><td>86.6</td><td>82.9</td><td>87.0</td><td>87.2</td><td>87.3</td><td>87.5</td></tr><tr><td>Mean</td><td>75.3</td><td>75.3</td><td>77.1</td><td>69.5</td><td>78.3</td><td>79.0</td><td>79.3</td><td>81.5</td></tr></table></body></html>  \n\nTable 4: LRA test set performances at $70\\\\%$ space complexity reduction for Big Bird (top) and Performers (bottom) as the backbone Transformer. Here and everywhere else, accuracy scores are reported for all three tasks. Each value is averaged over 20 trials. Larger values indicates better performance.   \n\n\n<html><body><table><tr><td colspan=\"6\">BigBird</td></tr><tr><td>Dataset</td><td>1st</td><td>Rand</td><td>CS-k-1</td><td>CS-opt</td><td>Trans.-no-prune</td></tr><tr><td>CIFAR-10</td><td>26.9</td><td>39.4</td><td>38.6</td><td>43.3</td><td>40.9</td></tr><tr><td>PATHFINDER-32</td><td>55.6</td><td>69.9</td><td>69.3</td><td>71.7</td><td>73.5</td></tr><tr><td>IMDB (BYTE-LEVEL)</td><td>57.9</td><td>59.6</td><td>59.1</td><td>61.4</td><td>63.8</td></tr><tr><td>Mean</td><td>46.8</td><td>56.3</td><td>55.7</td><td>58.8</td><td>59.4</td></tr><tr><td colspan=\"6\">Performers</td></tr><tr><td>CIFAR-10</td><td>26.9</td><td>41.5</td><td>39.8</td><td>45.5</td><td>42.9</td></tr><tr><td>PATHFINDER-32</td><td>52.4</td><td>58.2</td><td>61.5</td><td>67.7</td><td>66.2</td></tr><tr><td>IMDB (BYTE-LEVEL)</td><td>59.9</td><td>59.9</td><td>59.7</td><td>62.8</td><td>64.3</td></tr><tr><td>Mean</td><td>46.4</td><td>53.2</td><td>53.7</td><td>58.7</td><td>57.8</td></tr></table></body></html>  \n\nThe results of accuracy scores for space complexity reduction at $70\\\\%$ and $30\\\\%$ are presented in Table 4 and Table 18 (in Appendix E), respectively. The Coreset-select-opt here represents the Coreset-select with $m\\\\ =\\\\ 1$ because of its superior performance over other $m\\\\quad\\\\in$ ∈$\\\\{\\\\lceil0.1k\\\\rceil\\\\},\\\\lceil0.2k\\\\rceil,\\\\lceil0.3k\\\\rceil,\\\\lceil0.4k\\\\rceil\\\\}$ .  \n\nWe observe a similar pattern as discussed in GLUE benchmark evaluations: at high space complexity reduction $70\\\\%$ ,Coreset-select-opt significantly outperforms its competitors First$.k$ -select and Random-select by $12\\\\%$ and $2.5\\\\%$ in average for Big Bird $(12.3\\\\%$ and $5.5\\\\%$ in average for Performers ). Moreover, on CIFAR-10, our Coresetselect-opt is even better than the Big Bird and Performers without any sequence reduction with accuracy gain $2.4\\\\%$ and $2.6\\\\%$ , respectively (similarly for Performers on PATHFINDER-32). On the other hand, different from the GLUE evaluations, Coreset-select-k-1 does not show any significant advantages over the baseline methods. Our conjecture is that the input in the LRA datasets contain too many noisy or low level information which is not helpful for predicting the target. For an example, each pixel of an image (CIFAR-10) or a character in the byte-level text classification represents a token as the input. Our Coreset-select based strategy with $m=1$ does the most fine-grained token-level selection than its baselines and thus filter out the noisy information. Note, we do not include accuracy and speedup tables because of insignificant gains observed in speedup due to the shallow architectures of Transformers in LRA.」\nd04736cf-c340-414e-a4a7-79dcf60c22c3:「ref_ids: 454845533235189656, chunk_ids: 12, Score: 0.1553, Text: # 4 Experiments\nWe now exhibit the results of our experiments, by showing the correlation between the feedback of our indicators, and the false sense of security given by badly-evaluated defenses.  \n\nExperimental setup. We run our attacks on an Intel ®Xeon ®CPU E5-2670 v3, with 48 cores, 126 GB of RAM, and equipped with an Nvidia Quadro M6000 with $24\\\\:\\\\mathrm{GB}$ of memory. All the attacks and models have been wrapped and run by using the SecML library [ 20 ]. We select four defenses that have been reported as failing, and we show that our indicators would have detected such evaluation errors. For each of them, we set the hyperparameters for the attack as done in the original evaluation, in order to collect similar results.  \n\n-Winners-Take-All (kWTA) , the defense proposed by Xiao et al. [ 31 ] uses only the top-k outputs from each layer, generating many discontinuities in the loss landscape, and hence resulting in the non-converging failure due to noisy gradients $(F_{2})$ . We use the implementation provided by Tramèr et al. [ 30 ], trained on CIFAR10, and we test its robustness by attacking it with $\\\\ell_{\\\\infty}$ -PGD [ 17 ] with a step size of $\\\\alpha=0.003$ , maximum perturbation $\\\\epsilon=8/255$ and 50 iterations, with 5 restarts for each attack, scoring a robust accuracy of $58\\\\%$ on 100 samples.  \n\nDistillation , the defense proposed by Papernot et al. [ 22 ], works by training a model to have zero gradients around the training points, leading gradient-based attacks towards bad local optimum $(F_{3})$ .We re-implemented such defense, by training a distilled classifier on the MNIST dataset to mimic the evaluation. Then, we apply $\\\\ell_{\\\\infty}$ -PGD [ 17 ], with step size $\\\\alpha=0.01$ , maximum perturbation $\\\\epsilon=0.3$ for 50 iterations on 100 samples, resulting in a robust accuracy of $94\\\\small{,}2\\\\%$ .  \n\nEnsemble diversity , the defense proposed by Pang et al. [ 21 ] is composed with different neural networks, trained with a regularizer that encourages diversity. We adopt the implementation provided by Tramèr et al. [ 30 ]. Then, following its original evaluation, we apply $\\\\ell_{\\\\infty}$ -PGD [ 17 ], with step size $\\\\alpha=0.001$ , maximum perturbation $\\\\epsilon=0.01$ for 10 iterations on 100 samples, resulting in a robust accuracy of $38\\\\%$ .  \n\nTurning a Weakness into a Strenght (TWS) , the defense proposed by Yu et al. [ 32 ], applies a mechanism for detecting the presence of adversarial examples on top of an undefended model, measuring how much the decision changes locally around a sample. Even if the authors also apply other rejection mechanisms, we take into account only the described one, as we wish to show that attacks optimized neglecting such term will trigger the non-adaptive attack failure $(F_{4})$ .  \n\nWe apply this defended on a WideResNet model trained on CIFAR10, provided by RobustBench [ 14 ]. We attack this model with $\\\\ell_{\\\\infty}$ -PGD [ 17 ], with step size $\\\\alpha\\\\,=\\\\,0.1$ , maximum perturbation $\\\\epsilon=0.3$ for 50 iterations on 100 samples, and then we query the defended model with all the computed adversarial examples. While the attacks works against the standard model, some of them are rejected by the defense, resulting in a robust accuracy of $35\\\\%$ ,highlighted by the trigger of the $I_{5}$ indicator. In this case, we consider an attack unsuccessful if the original sample is not misclassified and the adversarial point is either belonging to the same class, or it is labeled as rejected.  \n\nEach of these attacks have been executed with 5 random restarts. We also attack all these models with the version of AutoPGD (APGD) [ 13 ] that uses the difference of logit (DLR) as a loss to optimize. This strategy will take care to automatically tune its hyperparameters while optimizing, reducing possible errors that occur while deciding the values of step size, and iterations. Lastly, we compute attacks that take into account all the mitigations we prescribed, and they will be analyzed further on in the paper.  \n\nIdentifying failures. We want now to understand if our indicators are correlated with faults  \n\n  \nFigure 5: Robust accuracy vs. average value of the indicators. Incorrect evaluations (denoted with $\\\\overrightarrow{\\\\circ}$ )report high robust accuracy but also trigger most of the indicators. Better evaluations, performed by either mitigating the attack failures (denoted with $\\\\mathbf{\\\\Phi}^{\\\\bullet}\\\\times\\\\mathbf{\\\\Phi}^{\\\\bullet})$ , or using APGD (denoted with $\\\\mathbf{\\\\Phi}^{,}\\\\star\\\\mathbf{\\\\Phi}$ ), correctly report a lower robust accuracy along with a lower average value of our indicators.  \n\nof the security evaluations of defenses. We collect the results of all the attacks against the selected targets, and we compute our indicators, by listing their values in Table 1, along with their mean score. With a glance, it is possible to grasp that out hypothesis is right: the detection of a failure is linked with higher values for the robust accuracy, and also the opposite. Each original evaluation is characterized by high values of one or more indicator, while the opposite happens for stronger attacks. For instance, APGD automatically tunes its hyperparameter while optimizing, hence it is able to apply some mitigations directly during the attack. To gain a quantitative evaluation of out hypothesis, we compute both the p-value and the correlation between the average score of the indicators and the robust accuracy, depicting this result in Fig. 5. Both p-value and correlation suggest a strong connection between these analyzed quantities, confirming our initial belief.  \n\nTable 1: Values of the Indicators of Attack Failures, computed for all the attacks against all the evaluated models. We denote the attacks that apply also the mitigations as $\\\\mathrm{PGD^{\\\\star}}$ .  \n\n\n<html><body><table><tr><td>Model</td><td>Attack</td><td>I1</td><td>12</td><td>13</td><td>14</td><td>15</td><td>T</td><td>RA</td></tr><tr><td rowspan=\"3\">k-WTA [31]</td><td>PGD</td><td>0.33</td><td>0.43</td><td>0.77</td><td></td><td></td><td>0.306</td><td>58%</td></tr><tr><td>APGD</td><td>-</td><td>0.31</td><td>0.33</td><td></td><td></td><td>0.128</td><td>36%</td></tr><tr><td>PGD*</td><td>0.07</td><td>0.48</td><td>0.55</td><td></td><td></td><td>0.220</td><td>6%</td></tr><tr><td rowspan=\"3\">Distillation[22]</td><td>PGD</td><td></td><td>0.98</td><td></td><td>0.97</td><td></td><td>0.39</td><td>94%</td></tr><tr><td>APGD</td><td>-</td><td>0.40</td><td>0.21</td><td></td><td></td><td>0.122</td><td>0%</td></tr><tr><td>PGD*</td><td></td><td>0.04</td><td></td><td>-</td><td></td><td>0.008</td><td>0%</td></tr><tr><td rowspan=\"3\">Ensemble Div.[21]</td><td>PGD</td><td></td><td>0.76</td><td></td><td></td><td></td><td>0.152</td><td>38%</td></tr><tr><td>APGD</td><td></td><td>0.37</td><td>0.14</td><td></td><td></td><td>0.102</td><td>0%</td></tr><tr><td>PGD*</td><td>0.08</td><td>0.17</td><td>0.15</td><td>-</td><td></td><td>0.080</td><td>%6</td></tr><tr><td rowspan=\"3\">TWS [32]</td><td>PGD</td><td></td><td>0.49</td><td>0.07</td><td></td><td>0.37</td><td>0.186</td><td>35%</td></tr><tr><td>APGD</td><td>-</td><td>0.41</td><td>0.09</td><td></td><td>-</td><td>0.100</td><td>0%</td></tr><tr><td>PGD*</td><td>-</td><td>0.37</td><td>0.10</td><td>-</td><td></td><td>0.094</td><td>0%</td></tr></table></body></html>  \n\nMitigating failures. We can now use our indicators to improve the quality of the security evaluations, and we apply the following pipeline: (i) we test the defense with a set of points with the original attack strategy proposed by the author of the defense; (ii) we select the failure cases and inspect the feedback of our indicators per-sample ; (iii) for each cause of failure, we apply the specific remediation suggested by the metric; and (iv) we show that the attack now succeeds, thus reducing the robust accuracy of the target model, and also the values of the indicators.  \n\nWe report all the results of this process in Table 2, where each row shows the original robust accuracy, and how it is decreased, mitigation after mitigation. Also, all the individual values of each indicator computed on these patched attacks can be found in Table 1, marked as $\\\\mathrm{PGD^{\\\\star}}$ .  \n\nMitigating $k$ -WTA failures. For many failing attacks, the $I I$ indicator triggers, implying that the attack found an adversarial example inside the path. We then apply mitigation $M_{I}$ , and we lower accordingly the robust accuracy of the model to $36\\\\small{,}4\\\\%$ . We then analyze the feedback of the $I_{3}$ indicator, the one that detects the presence of noisy gradients. We apply mitigation $M_{3}$ , and we change the loss of the attack as described by Tramèr et al. [ 30 ]. This loss is computed by averaging the gradient of each single point of the attack path with the information of the surrounding ones. The resulting direction is then able to correctly descent toward a minimum. We run $\\\\ell_{\\\\infty}$ -PGD with the same parameters, but smoothing the gradients by averaging 100 neighboring points from a normal distribution ${\\\\mathcal N}(\\\\mu=\\\\pmb{x}_{i},\\\\sigma=0.0\\\\dot{3}1)$ , where $x_{i}$ is a point in the attack path. After such mitigation, the robust accuracy drops to $6,4\\\\%$ , and so follows the indicator (Fig. 6a).  \n\nMitigating Distillation failures. All the attacks fail because of the absence of gradient information, leading the attack to a bad local optimum $(F_{3})$ , and such is highlighted by the feedback of the $I_{3}$ indicator. We apply mitigation $M_{3}$ , and we change the loss optimized during the attack, following the strategy applied by Carlini et al. [ 9 ], that computes the loss of the attack on the logit of the model rather than the final softmax layer. We repeat the PGD attack with such fix, and the robust accuracy drops to $0\\\\%$ , along with the indicator $I_{3}$ (Fig. 6b).  \n\nMitigating Ensemble diversity failures. Firstly, the $I_{I}$ indicator highlighted the presence of $F_{I}$ ,implying that some failing attacks are due to the implementation itself. We apply mitigation $M_{I}$ , and the robust accuracy decreases to $36\\\\%$ . Also, $I_{2}$ indicator is active, implying that the loss of of failing attacks could be optimized more. For this reason, we apply mitigation $M_{2}$ , and we increase the step size to 0 .05 and the iterations to 50 . This patch is enough for lowering the robust accuracy to $9\\\\bar{\\\\%}$ .(Fig. 6c).  \n\nMitigating TWS failures. The detector is rejecting adversarial attacks successfully computed on the undefended model, triggering the $I_{5}$ indicator. Hence we apply mitigation $M_{5}$ , and we adapt the attack to consider also the rejection class. This version of PGD minimizes the usual loss function of the attacker, but it also minimizes the score of the rejection class when encountered, allowing it to evade the rejection. We run such attack, and we obtain a new robust accuracy of $0\\\\%$ (Fig. 6d).  \n\n<html><body><table><tr><td>Model</td><td>Initial</td><td>M1</td><td>M2</td><td>M3</td><td>M4</td><td>M5</td><td>Final</td></tr><tr><td>k-WTA [31]</td><td>58.2%</td><td>36.4%</td><td>36.4%</td><td>6.4%</td><td>6.4%</td><td>6.4%</td><td>6.4%</td></tr><tr><td>Distillation [22]</td><td>94.2%</td><td>94.2%</td><td>94.2%</td><td>0.4%</td><td>0.4%</td><td>0.4%</td><td>0.4%</td></tr><tr><td>Ensemble Diversity [21]</td><td>38.0%</td><td>38.0%</td><td>9.0%</td><td>9.0%</td><td>9.0%</td><td>9.0%</td><td>9.0%</td></tr><tr><td>TWS [32]</td><td>35.0%</td><td>35.0%</td><td>35.0%</td><td>35.0%</td><td>35.0%</td><td>0.0%</td><td>0.0%</td></tr></table></body></html>\n\nTable 2: Robust accuracies $\\\\overline{{(\\\\%)}}$ after patching the security evaluations with the prescribed mitigations.  \n\n  \nFigure 6: The values of our indicators and the success rate (SR) of the attack, before (semi-transparent colored area) and after (solid colored area) fixing the failures, computed for the analyzed models.」\n", "dreams_guidance_context": "### Step 1: 确定研究的关键问题和目标\n - **关键问题**：\n    - 处理大规模数据时性能下降的算法，能否通过正则化技术、对抗训练等方法提升在大规模数据环境下的稳定性和适应性？\n    - 协同训练中，拥有独立的批统计是否是成功协同训练的必要条件？\n    - 适配器训练是否能实现模型融合（对抗模型融合）？\n    - 提出的指标与防御的安全评估故障之间是否存在相关性？\n - **研究目标**：\n    - 分析最新算法的稳定性与容错性。\n    - 探究不同归一化层在协同训练中的表现及影响因素。\n    - 验证对抗训练与适配器结合以及模型融合的可行性。\n    - 利用提出的指标改进防御模型安全评估的质量。\n\n### Step 2: 梳理算法和方法\n - **协同训练相关**：\n    - 回顾了BatchNorm层在图像分类器中的作用及原理，给定一批输入，先进行归一化（减去均值并除以标准差），再进行仿射变换，训练时积累批统计量用于测试。\n    - Xie等人（2019a）提出AdvProp，针对干净图像和对抗图像使用不同的BatchNorm层，以解决优化协同训练损失在某些情况下性能下降的问题。\n    - 本文研究不同归一化层（如Shared BatchNorm、Shared LayerNorm、Shared GroupNorm、Dual BatchNorm、Dual LayerNorm、Dual GroupNorm、DualParams BatchNorm）在协同训练中的表现，对比有无独立批统计和特定尺度偏移参数时模型的干净准确率和鲁棒准确率。\n - **适配器与模型融合相关**：\n    - 将模型参数分解为不同域共享的参数$\\psi$和特定域的参数$\\phi$（$\\phi_{clean}$用于干净图像训练，$\\phi_{adv}$用于对抗图像训练），基于此优化损失函数：$\\alpha L(f(\\pmb{x};\\psi\\cup\\phi_{clean}),y)+(1-\\alpha)\\operatorname*{max}_{\\pmb{\\delta\\in\\mathbb{S}}}L(f(\\pmb{x}+\\pmb{\\delta};\\psi\\cup\\phi_{adv}),y)$。\n    - 提出对抗模型融合（adversarial model soups）的概念，参数化模型为$f(\\cdot;\\psi\\cup(\\beta\\phi_{clean}+(1-\\beta)\\phi_{adv}))$，其中$\\beta$为平均适配器时的加权因子。\n - **算法性能评估相关**：\n    - 在GLUE基准测试和Long Range Arena基准测试中，使用相同超参数集对所有方法进行公平比较，评估Coreset-select-opt方法在不同加速比和空间复杂度下与其他基线方法（First$.k$-select、Random-select等）的性能差异。\n - **攻击防御模型相关**：\n    - 使用SecML库在特定硬件环境下对四种被报道为失败的防御方法（kWTA、Distillation、Ensemble diversity、TWS）进行攻击实验。\n    - 针对不同防御方法设置相应的攻击超参数（如不同的步长$\\alpha$、最大扰动$\\epsilon$、迭代次数等），使用$\\ell_{\\infty}$-PGD和APGD等攻击方法。\n    - 提出一些指标（$I_1$、$I_2$、$I_3$、$I_4$、$I_5$），通过计算这些指标值来分析与防御的安全评估故障之间的相关性，并利用这些指标改进安全评估质量，采取一系列步骤（测试防御、选择失败案例、检查指标反馈、应用补救措施）来降低目标模型的鲁棒准确率和指标值。\n\n### Step 3: 分析实验设计和结果\n - **协同训练实验**：\n    - **实验设计**：通过设置不同的归一化层配置，训练模型并记录训练过程中不同模型架构的干净准确率和鲁棒准确率。\n    - **实验结果**：\n        - 左图表明共享批统计和尺度/偏移（Shared BatchNorm）时，鲁棒准确率迅速下降；而使用AdvProp（Dual BatchNorm）时鲁棒准确率较高（超过34%）。\n        - 右图显示使用单组批统计但针对干净和对抗图像设置特定尺度和偏移参数（DualParams BatchNorm），鲁棒准确率与AdvProp相当，说明不使用独立批统计也能取得类似分类效果。\n        - 对于不使用批统计的归一化层（LayerNorm、GroupNorm），初始鲁棒准确率不稳定且不如AdvProp，但通过设置特定的尺度和偏移参数，其鲁棒准确率可与双BatchNorm层相当。\n - **算法性能评估实验**：\n    - **实验设计**：在GLUE基准测试和Long Range Arena基准测试中，对不同方法（包括Coreset-select-opt和各种基线方法）在不同加速比（如$3X$、$1.5X$等）和空间复杂度降低比例（如$70\\%$、$30\\%$）下进行测试，记录准确率。\n    - **实验结果**：\n        - 在GLUE基准测试中，随着加速比增加，Coreset-select-opt与竞争对手差距增大，$3X$加速比时平均比第二好的方法Attention-select准确率高$1\\%$，比标准基线高$2\\%$以上；$1.5X$加速比时所有方法（除Average-pool）准确率损失小，Coreset-select-opt无损失。\n        - 在Long Range Arena基准测试中，$70\\%$空间复杂度降低时，Coreset-select-opt比First$.k$-select和Random-select平均高$12\\%$和$2.5\\%$（Performers数据集上分别高$12.3\\%$和$5.5\\%$），在CIFAR-10数据集上比无序列减少的模型准确率有提升；Coreset-select-k-1未显示出明显优势，推测是LRA数据集输入含过多噪声或低层次信息，Coreset-select-opt基于$m = 1$的策略能进行更细粒度的标记选择，过滤噪声信息。\n - **攻击防御模型实验**：\n    - **实验设计**：在特定硬件环境下，使用SecML库对四种防御方法进行攻击实验，设置不同攻击超参数，每种攻击执行5次随机重启，收集攻击结果并计算指标值。\n    - **实验结果**：\n        - 发现提出的指标与防御的安全评估故障存在相关性，较高的鲁棒准确率往往与检测到的故障相关联，通过计算p值和指标平均值与鲁棒准确率的相关性进行验证。\n        - 利用指标改进安全评估质量，通过一系列步骤成功降低了目标模型的鲁棒准确率和指标值，如对kWTA防御方法，通过应用相应补救措施，鲁棒准确率从$58.2\\%$降至$6.4\\%$；对Distillation防御方法，鲁棒准确率从$94.2\\%$降至$0.4\\%$等。\n\n### Step 4: 评估研究的局限性和未来方向\n - **局限性**：\n    - 在模型融合实验中，在独立的常规模型和鲁棒模型之间进行模型融合失败，说明当前提出的对抗模型融合假设存在一定问题。\n    - 在Long Range Arena基准测试中，由于Transformer架构较浅，速度提升不明显，未包含准确性和加速比表格，可能限制了对算法在速度方面性能的全面评估。\n - **未来方向**：\n    - 进一步研究如何实现有效的模型融合，可能需要探索其他方法或改进当前基于适配器的模型融合策略。\n    - 针对在处理大规模数据时算法性能提升的研究，可以继续探索更有效的稳定性优化方法，以应对不同场景下的内存和计算资源限制问题。\n    - 在攻击防御模型方面，可以继续完善指标体系，提高对防御方法安全评估的准确性，并探索更多改进安全评估质量的方法和策略。  ", "evolutionary_step": "这段对话主要围绕算法相关研究展开，涉及算法稳定性、适应性优化以及相关实验结果分析，与计算机科学研究步骤中的算法研究部分相关，特别是“研究计算机算法的非理性表现与优化技术中的偶然性”以及“研究算法和数据结构的固定形式与预期结果的因果性，是否存在可拓展性和反向推理的潜力”。具体总结如下：\n1. **算法稳定性与容错性分析**：探讨最新算法的稳定性与容错性，考虑在大规模数据处理中，面对内存和计算资源限制导致性能下降的算法，能否借鉴正则化技术、对抗训练等稳定性优化方法提升在大规模数据环境下的稳定性和适应性 。\n2. **理论研究参考**：引用文献中关于算法的研究内容，如不同归一化层（BatchNorm、LayerNorm、GroupNorm等）在模型训练中的表现，分析单独的批统计是否是成功协同训练的必要条件，发现通过特定的可训练参数（针对干净图像和对抗图像）可以使协同训练损失对各种归一化层有效。还提及与适配器文献的关联，提出基于适配器训练的模型汤假设，并给出相应的参数化模型 。\n3. **实验实现与结果**\n    - **实现细节**：为公平评估方法与基线，使用相同超参数集，代码作为补充材料提供，训练和推理作业分别在特定GPU和CPU机器上运行，所有分数均在20次试验上取平均 。\n    - **GLUE基准测试结果**：分析了速度提升和空间复杂度降低与准确率之间的权衡关系。随着速度提升，Coreset-select-opt方法表现优于竞争对手；对于适度速度提升（1.5X），多数方法准确率损失小，该方法无损失。在空间复杂度降低方面，也呈现类似趋势，Coreset-select-opt在高空间复杂度降低（70%）时显著优于其他方法 。\n    - **Long Range Arena测试结果**：在LRA基准测试的三个数据集上展示结果，发现Coreset-select-opt在高空间复杂度降低（70%）时，平均比竞争对手First$.k$-select和Random-select分别高出12%和2.5%（Performers数据集上分别高出12.3%和5.5%），在CIFAR-10数据集上甚至比未进行序列缩减的模型准确率更高，但Coreset-select-k-1未显示出明显优势 。\n4. **攻击实验与指标分析**\n    - **实验设置**：在特定硬件上使用SecML库运行攻击，选择四种被报道失败的防御方法，按照原始评估设置攻击超参数，用不同攻击方法（如$\\\\ell_{\\\\infty}$-PGD、APGD）攻击模型，并计算攻击失败指标 。\n    - **识别失败**：收集攻击结果计算指标，发现检测到失败与较高的鲁棒准确率相关，反之亦然。通过计算p值和指标平均得分与鲁棒准确率的相关性，证实了这种联系 。\n    - **缓解失败**：利用指标改进安全评估质量，针对不同防御方法的失败原因，应用特定缓解措施，如调整损失函数、增加步长和迭代次数等，成功降低了目标模型的鲁棒准确率和指标值 。  ", "dreams_personality_context": "从这段内容可以推测出人物可能具有以下性格特点：\n1. **严谨细致**：\n    - 在研究过程中，为了公平评估方法与基线，使用相同超参数集，代码作为补充材料提供，训练和推理作业分别在特定GPU和CPU机器上运行，所有分数均在20次试验上取平均。这种对实验细节的严格把控，体现出人物对待研究认真严谨、注重细节的性格，确保研究结果的准确性和可靠性。\n2. **善于钻研**：\n    - 深入探讨算法的稳定性与容错性，研究在大规模数据处理中算法性能下降的问题，并思考借鉴多种优化技术提升其稳定性和适应性。同时，引用大量文献中关于算法的研究内容，如不同归一化层在模型训练中的表现等，并基于此提出自己的假设和模型。这表明人物具有强烈的钻研精神，对算法相关知识不断探索、深入研究。\n3. **理性客观**：\n    - 在实验结果分析中，无论是GLUE基准测试结果、Long Range Arena测试结果，还是攻击实验与指标分析，都能理性地分析数据和现象，如分析速度提升、空间复杂度降低与准确率之间的权衡关系，以及检测失败与鲁棒准确率的相关性等，不主观臆断，以客观的数据和事实为依据进行研究和判断。\n4. **勇于创新**：\n    - 在研究过程中，不局限于已有的研究成果，提出基于适配器训练的模型汤假设，并给出相应的参数化模型，尝试从新的角度和方法去研究算法，展现出勇于创新、敢于突破传统思维的性格特点。\n5. **坚韧执着**：\n    - 面对算法研究中的各种复杂问题，如算法在大规模数据处理中的性能问题、不同归一化层的研究、攻击实验中的各种情况等，没有轻易放弃，而是持续深入研究，通过各种方法去解决问题，体现出坚韧执着的性格，不轻易被困难打倒。  ", "ref_analysis_id": ""}, "__type__": "dreams_node"}}, "analysis_store/ref_analysis_info": {"": {"node_ids": ["12c1fd96-fa01-41ad-8a70-aad9607ee8d4"], "metadata": {}}}, "analysis_store/metadata": {"12c1fd96-fa01-41ad-8a70-aad9607ee8d4": {"analysis_hash": "", "ref_analysis_id": ""}}}