{"analysis_store/data": {"497f9c7c-4ab8-4ac6-bd59-4567d9485e83": {"__data__": {"id_": "497f9c7c-4ab8-4ac6-bd59-4567d9485e83", "metadata": {}, "relationships": {}, "hash": "", "story_scenario_context": "### Step by Step Decomposition\n\n#### Step 1: 理解任务背景\n- **任务背景**: 作为一个社会学研究学者，您已经查阅了《作为激情的爱情》卢曼编写的书籍，尝试通过参考文献中定义的爱情语义学，从文本中总结下方片段。\n- **目标**: 研究交流媒介领域的语义信息，研究激情的非理性与风雅情术的偶然性，研究自身的快感是否转移到社会行为上，研究语义信息的固定形式与预期落空因果性，是否存在可激发性拓展到否定物之中。\n\n#### Step 2: 分析文本内容\n- **文本内容**: 角色、内容、分镜。\n- **分析**: 文本内容较为简洁，仅包含角色、内容和分镜三个部分，没有具体描述。\n\n#### Step 3: 研究突出特点\n- **突出特点**: \n  1. 社交媒体中的爱情表现。\n  2. 卢曼的爱情语义学在电视和电影中的应用。\n  3. 卢曼的理论在社会学研究中的潜在应用。\n  4. 情感因素在社会学研究中的重要性。\n  5. 媒体中的语义信息。\n  6. 卢曼的爱情语义学与社交媒体内容的关联。\n  7. 卢曼理论与社会学研究的靠近度。\n  8. 卢曼理论如何接近社交媒体中的爱情表现。\n  9. 卢曼的爱情语义学及其在社会学中的附近研究领域。\n  10. 卢曼理论和社会学的交叉点。\n  11. 社交媒体中的爱情表现与卢曼理论的重叠。\n  12. 卢曼的爱情语义学与社会学观点的相交。\n\n#### Step 4: 总结研究建议\n- **研究建议**:\n  1. **社交媒体中的爱情表现**: 研究社交媒体中爱情的表现形式，分析其与卢曼爱情语义学的关联。\n  2. **卢曼的爱情语义学在电视和电影中的应用**: 探讨卢曼理论在影视作品中的体现，分析其对社会行为的影响。\n  3. **卢曼的理论在社会学研究中的潜在应用**: 深入研究卢曼理论，探讨其对社会学研究方法的贡献。\n  4. **情感因素在社会学研究中的重要性**: 分析情感因素在社会学研究中的作用，探讨其与卢曼理论的结合点。\n  5. **媒体中的语义信息**: 研究媒体中语义信息的传播方式，分析其对社会行为的影响。\n  6. **卢曼的爱情语义学与社交媒体内容的关联**: 探讨卢曼理论在社交媒体内容中的应用，分析其对社会行为的影响。\n  7. **卢曼理论与社会学研究的靠近度**: 分析卢曼理论与社会学研究的结合点，探讨其对社会学研究方法的贡献。\n  8. **卢曼理论如何接近社交媒体中的爱情表现**: 探讨卢曼理论在社交媒体中爱情表现的应用，分析其对社会行为的影响。\n  9. **卢曼的爱情语义学及其在社会学中的附近研究领域**: 分析卢曼理论在社会学中的研究领域，探讨其对社会学研究方法的贡献。\n  10. **卢曼理论和社会学的交叉点**: 探讨卢曼理论与社会学的结合点，分析其对社会学研究方法的贡献。\n  11. **社交媒体中的爱情表现与卢曼理论的重叠**: 分析社交媒体中爱情表现与卢曼理论的关联，探讨其对社会行为的影响。\n  12. **卢曼的爱情语义学与社会学观点的相交**: 探讨卢曼理论与社会学观点的结合点，分析其对社会学研究方法的贡献。\n\n#### Step 5: 最终总结\n- **最终总结**: 通过以上分析，可以得出以下研究建议：\n  1. 研究社交媒体中的爱情表现，分析其与卢曼爱情语义学的关联。\n  2. 探讨卢曼的爱情语义学在电视和电影中的应用，分析其对社会行为的影响。\n  3. 深入研究卢曼的理论，探讨其在社会学研究中的潜在应用。\n  4. 分析情感因素在社会学研究中的作用，探讨其与卢曼理论的结合点。\n  5. 研究媒体中语义信息的传播方式，分析其对社会行为的影响。\n  6. 探讨卢曼的爱情语义学与社交媒体内容的关联，分析其对社会行为的影响。\n  7. 分析卢曼理论与社会学研究的结合点，探讨其对社会学研究方法的贡献。\n  8. 探讨卢曼理论在社交媒体中爱情表现的应用，分析其对社会行为的影响。\n  9. 分析卢曼理论在社会学中的研究领域，探讨其对社会学研究方法的贡献。\n  10. 探讨卢曼理论与社会学的结合点，分析其对社会学研究方法的贡献。\n  11. 分析社交媒体中爱情表现与卢曼理论的关联，探讨其对社会行为的影响。\n  12. 探讨卢曼理论与社会学观点的结合点，分析其对社会学研究方法的贡献。\n\n这些研究建议将有助于深入理解卢曼的爱情语义学在社会学研究中的应用，以及其在社交媒体和媒体中的表现。", "scene_monologue_context": "**独白信息：**\n\n今天，我深入研究了深度学习框架中Transformer模型的归一化方法，特别是LayerNorm和RMSNorm的对比。我查阅了多篇相关文献，试图从计算复杂度、训练稳定性以及在不同任务中的效果等方面进行分析。首先，我注意到LayerNorm和RMSNorm在Transformer模型中的应用场景有所不同。LayerNorm通常在每个子模块（如自注意力或前馈网络）之后应用，而RMSNorm则被用于替代LayerNorm，以减少计算开销并提高训练稳定性。\n\n在阅读文献的过程中，我发现了一些有趣的实验和结果。例如，有研究通过将Transformer中的LayerNorm替换为RMSNorm，并结合PCA技术对模型进行切片，从而实现了模型的压缩和加速。这一方法在多个任务中表现出色，尤其是在自然语言处理领域。此外，我还了解到，PostNorm（在子模块之后应用LayerNorm）在零样本翻译任务中表现优于PreNorm（在子模块之前应用LayerNorm），尽管PreNorm在训练稳定性上更有优势。\n\n通过今天的阅读，我对LayerNorm和RMSNorm的优缺点有了更清晰的认识。RMSNorm在计算效率和模型压缩方面表现出色，而LayerNorm则在某些任务中仍然具有不可替代的优势。未来，我计划进一步探索如何结合这两种归一化方法的优点，以优化Transformer模型的性能。\n\n总的来说，今天的学习让我对深度学习框架中的归一化技术有了更深入的理解，也为我未来的研究提供了新的思路。", "user_id": "此来访者", "scene_content": "角色    内容    分镜\n", "story_board_summary_context": "f5dda6c2-b14a-44f3-873e-1c63177625a7:「技术框架」\nf5dda6c2-b14a-44f3-873e-1c63177625a7:「### 问题\n\n在深度学习框架中，Transformer模型广泛使用了LayerNorm和RMSNorm两种归一化方法。结合近年来深度学习技术框架的发展，特别是在Transformer及其变体（如BERT、RoBERTa等）中的应用，**LayerNorm和RMSNorm在Transformer模型中的具体表现和适用性有何不同？** 请从计算复杂度、训练稳定性以及在不同任务（如自然语言处理、图像处理等）中的效果等方面进行对比分析。」\nf5dda6c2-b14a-44f3-873e-1c63177625a7:「ref_ids: 454845744951617972, chunk_ids: 5, Score: 0.4609, Text: # 3.3 A TRANSFORMATION PER BLOCK\nNow that every LayerNorm in the transformer has been converted to RMSNorm, we can select any $\\\\mathbf{Q}$ to modify the model. Our initial plan was to collect signals from the model, construct an orthogonal matrix using those signals and to delete parts of the network. We quickly saw that the signals at different blocks of the network were not aligned, and that we would need to apply a different orthogonal matrix at each block, $\\\\mathbf{Q}_{\\\\ell}$ .  \n\nAllowing the orthogonal matrix used in each block to differ can be shown to leave the model unchanged using the same proof as Theorem 1 ,  \n\n  \nFigure 3: Converting a transformer network from LayerNorm to RMSNorm: the scale matrix diag $(\\\\alpha)$ is absorbed into the subsequent matrix $\\\\mathbf{W}_{\\\\mathrm{in}}$ . Figure shows the block in combined colors. We use $(\\\\alpha)$ for brevity. The mean-subtraction matrix $\\\\mathbf{M}$ is applied to each matrix $\\\\mathbf{W}_{\\\\mathrm{out}}$ . Layernorm becomes RMSNorm, up to a constant $\\\\bar{\\\\sqrt{D}}$ (not shown). Here, the scaling $(\\\\alpha^{\\\\prime})$ comes from the previous block.  \n\n  \nFigure 4: With the network converted to RMSNorm (see Figure 3 ), we apply the computational-invariance idea. The input weight matrices $\\\\mathrm{diag}(\\\\alpha)\\\\mathbf{W}_{\\\\mathrm{in}}$ are pre-multiplied by $\\\\mathbf{Q}^{\\\\top}$ . The output matrices $\\\\mathbf{W}_{\\\\mathrm{out}}\\\\mathbf{M}$ are post-multiplied by $\\\\mathbf{Q}$ . In the skip-connection, a new linear layer is added $\\\\mathbf{Q}_{\\\\ell}^{\\\\top}\\\\mathbf{Q}_{\\\\ell+1}$ . After these modifications, the matrices can be sliced (hatched areas).  \n\nwith the exception of line 5 of Algorithm 1 . Here we see that the residual connection and the output of the block must have the same rotation. To fix this, we modify the residual connection by applying the linear transformation applied to different blocks with the additional linear operation in the residual connection. Unlike the $\\\\mathbf{Q}_{\\\\ell-1}^{\\\\top}\\\\mathbf{Q}_{\\\\ell}$ −to the residual. Figure 4 shows how different rotations can be modifications to the weight matrices, these additional operations cannot be pre-computed and add a small $(D\\\\times D)$ overhead to the model. Nonetheless, they are needed to allow slicing the model (Section 3.4 ) and we see real speedup overall (Section 4 ).  \n\nTo compute the matrices $\\\\mathbf{Q}_{\\\\ell}$ , we use PCA. We select a calibration dataset from the training set, run it through the model (after converting LayerNorm operations into RMSNorm), and extract the orthogonal matrix of the layer. We use the output of the transformed network to calculate the orthogonal matrices of the next layers. More precisely, if $\\\\mathbf{X}_{\\\\ell,i}$ is the output of the $\\\\ell^{\\\\mathrm{th}}$ RMSNorm block for the $i^{\\\\mathrm{th}}$ sequence in the calibration dataset, we compute  \n\n$$\n\\\\mathbf{C}_{\\\\ell}=\\\\sum_{i}\\\\mathbf{X}_{\\\\ell,i}^{\\\\top}\\\\mathbf{X}_{\\\\ell,i}\n$$  \n\nand set $\\\\mathbf{Q}_{\\\\ell}$ to the be the eigenvectors of $\\\\mathbf{C}_{\\\\ell}$ , sorted by decreasing eigenvalues.\n\n# 3.4 SLICING\nThe goal of Principal Component Analysis is usually to take a data matrix $\\\\mathbf{X}$ and compute a lower dimensional representation $\\\\mathbf{Z}$ , and an approximate reconstruction $\\\\tilde{\\\\mathbf{X}}$ :  \n\n$$\n\\\\mathbf{Z}=\\\\mathbf{X}\\\\mathbf{Q}\\\\mathbf{D}\\\\,,\\\\qquad\\\\tilde{\\\\mathbf{X}}=\\\\mathbf{Z}\\\\mathbf{D}^{\\\\top}\\\\mathbf{Q}^{\\\\top}\\\\,.\n$$  \n\nwhere $\\\\mathbf{Q}$ is the ectors of ${\\\\bf X}^{\\\\top}{\\\\bf X}$ , and $\\\\mathbf{D}$ is a $D\\\\times D_{\\\\mathrm{small}}$ deletion matrix (containing $D_{\\\\mathrm{small}}$ The reconstruction is columns of the $D\\\\times D$ ×$L_{2}$ identity matrix), which removes some of the columns of the matrix to the left. optimal, in the sense that QD is a linear mapping that minimizes $\\\\lVert\\\\mathbf{X}-\\\\tilde{\\\\mathbf{X}}\\\\rVert^{2}$ .  \n\nWhen we apply PCA to the signal matrix $\\\\mathbf{X}$ bween blocks, we never materialize the $N\\\\times D$ signal matrix, but we apply the deletion matrix Dto the operations preceding and succeeding the construction of that matrix, which have already been multiplied by $\\\\mathbf{Q}$ in the above. We delete rows of $\\\\mathbf{W}_{\\\\mathrm{in}}$ that we have inserted into the residual connection (see Figure and columns of $\\\\mathbf{W}_{\\\\mathrm{out}}$ and $\\\\mathbf{W}_{\\\\mathrm{embd}}$ . We also delete both rows 4 ). and columns of the matrix $\\\\mathbf{Q}_{\\\\ell-1}^{\\\\top}\\\\mathbf{Q}_{\\\\ell}$ −\n\n# 4 EXPERIMENTAL VALIDATION\nSetup We use HuggingFace Transformers ( Wolf et al. ,2019 ) to implement our code with PyTorch (Paszke et al. ,2019 ). The computation of $\\\\mathbf{Q}$ is performed on a single H100 GPU with 80GB of memory, taking approximately 3.5 hours to complete for the L LAMA -2 70B model. During the PCA calculation, we use double precision for computing the eigenvectors of the covariance matrix. We find that using single precision for eigenvector calculations in PyTorch leads to a discrepancy in the final accuracy, as detailed in Appendix A.2 .  \n\nWe experiment with two different calibration sets: 1024 samples from the WikiText-2 training dataset ( Merity et al. ,2016 ) and 5000 samples from the Alpaca training dataset ( Taori et al. ,2023 ). Sequence lengths are chosen as the maximum of each language model. An ablation study on the calibration set size and sequence length is presented in Appendix A.3 .  \n\nModels, Tasks, and GPUs We evaluate all our experiments on OPT ( Zhang et al. ,2022 ), L LAMA -2 (Touvron et al. ,2023 ) model families, and additionally evaluate Phi-2 (in our zero-shot task) experiments. We exclude OPT 175B, as it is outperformed by smaller L LAMA -2 models. Nonetheless, we anticipate that this larger model will yield improved results, as larger models typically offer more promising opportunities for compression (see Section 4.1 ). We evaluate our scheme on both language generation as well as popular zero-shot tasks. To demonstrate the comprehensive speedup achieved by SliceGPT we use: Quadro RTX6000 GPUs with 24GB of memory as a representative example of consumer-level GPUs; 40GB A100s and 80GB H100s to provide datacenter-level benchmarks.  \n\nBaseline Setup We initially planned to compare our results against a scheme that pruned columns (or rows) with the smallest norm but found that this baseline was very poor, with the perplexity of the model soaring into the 1000s after pruning just a few columns. Instead, we compare SliceGPT against SparseGPT ( Frantar & Alistarh ,2023 ) employing a 2:4 sparsity ratio, as this is the only sparsity scheme which achieves speedup ( Mishra et al. ,2021 ).」\nf5dda6c2-b14a-44f3-873e-1c63177625a7:「ref_ids: 454847819065993190, chunk_ids: 1, Score: 0.4141, Text: # 3 Experiments and Results\nWe evaluate the performance of PreNorm and PostNorm for ZST on various datasets and language pairs. We then analyze the off-target rates and structural discrepancies between PreNorm and PostNorm to understand performance differences.  \n\n$$\n\\\\mathrm{LayerNorm}(\\\\mathbf{x})=\\\\frac{\\\\mathbf{x}-\\\\mathbf{E}(\\\\mathbf{x})}{\\\\sqrt{\\\\mathbf{V}(\\\\mathbf{x})}}\\\\cdot\\\\mathbf{g}+\\\\mathbf{b},\n$$  \n\nwhere $\\\\mathbf{g}$ and $\\\\mathbf{b}$ are trainable gain and bias. $\\\\mathbf{E}$ and $\\\\mathbf{V}$ indicate expectation and variance. LayerNorm is commonly used in two positions in the Transformer, as shown in Fig. 1 . PostNorm, which is the originally proposed setting of the Transformer ( Vaswani et al. ,2017 ), involves applying LayerNorm after each sub-module (i.e., selfattention or feed-forward network) and residual connections. PreNorm ( Baevski and Auli ,2019 ), on the other hand, involves applying LayerNorm directly before each sub-module and is known to stabilize Transformer training. While variants of Transformer LayerNorm like RMSNorm ( Zhang and Sennrich ,2019 ) have been proposed, the vanilla PreNorm and PostNorm are still the most widely adopted settings in current multilingual\n\n# 3.1 Experimental Settings\nDatasets We perform ZST experiments on three datasets: OPUS ( Zhang et al. ,2020 ), IWSLT ( Cettolo et al. ,2017 ), and Europarl ( Koehn ,2005 ). The statistics of the datasets are summarized in Table 1 .We include 7 ,4 , and 5 languages for each dataset. The training data consists of only English-centric sentence pairs, resulting in 30 ,6 , and 12 ZST directions for each dataset. The total number of parallel sentences for each dataset is 12 .00 M, 1 .38 M, and 15 .78 M, respectively. We apply BPE ( Sennrich et al. ,2016 ) with merge operations of 50 k, 40 k, and $50\\\\mathbf{k}$ to create a joint vocabulary for each dataset.  \n\nTraining We employ Transformer-base model for OPUS and IWSLT, and Transformer-big for Europarl, in accordance with the distinct sizes of training data. We consider the following settings: (1) PreNorm or PostNorm : PreNorm involves LayerNorm directly before each sub-module (i.e., self-attention or feed-forward network), while PostNorm applies LayerNorm after each sub-module and residual connections, as shown in Fig. 1 .(2) S-ENC-T-DEC or T-ENC : Source language tag on the encoder-side and target language tag on the decoder-side; or only target language tag on the encoder-side. Wu et al. (2021 ) showed that this setting impacts ZST for Transformer with PreNorm. (3) w/ or w/o Res. : With the residual connection for self-attention in the middle $(4^{t h})$ encoder layer or not. Liu et al. (2021 ) revealed that “w/o Res.” improves ZST for the model trained with PreNorm. We experiment this with different LayerNorm settings as this may reduce the potential of overfitting on supervised directions, then further impacts ZST, which aligns with our hypothesis.  \n\nTable 2: BLEU scores and off-target rates (shown in brackets) . We report the average score of three seeds; refer to Appendix Gfor BLEU score of each translation direction and seed. “Res.” indicates the residual connection of self-attention in the $4^{t h}$ encoder layer. We mark lower off-target rates and significantly higher BLEU scores ( Koehn ,2004 ) between PreNorm and PostNorm in bold for ZST.   \n\n\n<html><body><table><tr><td>#</td><td>Layer Norm</td><td>Language Tag</td><td>Res.</td><td></td><td>Zero-shot</td><td></td><td></td><td>Supervised</td><td></td></tr><tr><td>0</td><td></td><td>Pivot</td><td></td><td>OPUS 21.8</td><td>IWSLT 20.0</td><td>Europarl 29.5</td><td>OPUS</td><td>IWSLT</td><td>Europarl</td></tr><tr><td>1</td><td>PreNorm</td><td>S-ENC-T-DEC</td><td>w/</td><td>10.1 (42.19%)</td><td>4.9 (64.84%)</td><td>24.9 ( 7.73%)</td><td>33.7</td><td>31.5</td><td>34.3</td></tr><tr><td>2</td><td>PostNorm</td><td>S-ENC-T-DEC</td><td>w/</td><td>16.8 ( 8.59%)</td><td>12.4 (10.61%)</td><td>29.2( 0.34%)</td><td>33.9</td><td>31.5</td><td>34.5</td></tr><tr><td>3</td><td>PreNorm</td><td>T-ENC</td><td>w/</td><td>13.3 (22.99%)</td><td>13.7 ( 3.98%)</td><td>29.5( 0.23%)</td><td>33.7</td><td>31.6</td><td>34.4</td></tr><tr><td>4</td><td>PostNorm</td><td>T-ENC</td><td>w/</td><td>14.0 (22.86%)</td><td>15.5 ( 4.59%)</td><td>30.8 ( 0.11%)</td><td>34.1</td><td>31.5</td><td>34.5</td></tr><tr><td>5</td><td>PreNorm</td><td>S-ENC-T-DEC</td><td>w/o</td><td>14.3 (20.67%)</td><td>8.0 (50.16%)</td><td>16.7 (41.87%)</td><td>33.6</td><td>30.9</td><td>34.3</td></tr><tr><td>6</td><td>PostNorm</td><td>S-ENC-T-DEC</td><td>w/o</td><td>16.0 (15.27%)</td><td>17.4 (1.83%)</td><td>29.0 ( 0.41%)</td><td>33.8</td><td>30.7</td><td>34.4</td></tr><tr><td>7</td><td>PreNorm</td><td>T-ENC</td><td>w/o</td><td>13.4 (27.15%)</td><td>16.2 ( 1.54%)</td><td>29.9 ( 2.15%)</td><td>33.5</td><td>30.9</td><td>34.3</td></tr><tr><td>8</td><td>PostNorm</td><td>T-ENC</td><td>w/o</td><td>13.9 (26.68%)</td><td>17.8 (1.50%)</td><td>30.8 ( 0.13%)</td><td>33.9</td><td>30.6</td><td>34.4</td></tr></table></body></html>  \n\nThe settings above lead to eight different combinations, shown in Table 2 (#1 - #8). Additional training details are in Appendix A .\n\n# 3.2 Main Results\nWe evaluate ZST systems using SacreBLEU ( Post ,2018 ) and off-target rates. We report in Table 2 BLEU scores for both zero-shot and supervised directions. For ZST, we also present pivot-based translation results as a reference. Implementation details of evaluation can be found in Appendix B.Our findings are as follows:  \n\nPreNorm vs. PostNorm :We find that PostNorm consistently yields better BLEU scores than PreNorm for ZST across various language tag and residual connection settings, while their performance is comparable for supervised directions.  \n\nImpact of Language Tag and Residual Connection: We observe that using the “T-ENC” language tag and “w/ Res.” improves ZST performance for IWSLT, which aligns with the findings of $\\\\mathrm{Wu}$ et al. (2021 ) and Liu et al. (2021 ). Nevertheless, the best performance is achieved using “w/ Res.” for PostNorm with “S-ENC-T-DEC” and “T-ENC” tags for OPUS and Europarl, respectively (#2 and #4). Given that Wu et al. (2021 ) and Liu et al. (2021 )used PreNorm as the default setting (#2, #4, #6 and #8 are unreported results in their work), our results emphasize the need to consider PostNorm as the default setting for ZST, while the language tag and residual connection settings have less impact.  \n\nOff-target Rates : Off-target rates help understand the different BLEU score gaps between PreNorm and PostNorm, which ranges from 0 .5 to 12 .3 BLEU points. For PreNorm and PostNorm with the “T-ENC” language tag (#3, #4, #7, and #8), they have similar off-target rates, with a discrepancy ranging from $-0.61\\\\%$ to $2.02\\\\%$ , which results in narrow BLEU score gaps, ranging from 0 .5 to 1 .8 points. However, for PreNorm and PostNorm with the “S-ENC-T-DEC” language tag (#1, #2, #5, and #6), the off-target rates show a more considerable discrepancy, ranging from $5.40\\\\%$ to $54.23\\\\%$ , resulting in BLEU score gaps from 1 .7 to 12 .3 points. Further analysis of the nature of Transformer hidden states in the next section explores the reason for these different off-target rates in translations.」\nf5dda6c2-b14a-44f3-873e-1c63177625a7:「ref_ids: 454847315550000884, chunk_ids: 5, Score: 0.2812, Text: # DeepNet: Scaling Transformers to 1,000 Layers\nHongyu Wang ∗Shuming Ma ∗Li Dong Shaohan Huang Dongdong Zhang Furu Wei †Microsoft Research https://github.com/microsoft/unilm\n\n# Abstract\nIn this paper, we propose a simple yet effective method to stabilize extremely deep Transformers. Specifically, we introduce a new normalization function (D EEP NORM ) to modify the residual connection in Transformer, accompanying with theoretically derived initialization. In-depth theoretical analysis shows that model updates can be bounded in a stable way. The proposed method combines the best of two worlds, i.e., good performance of Post-LN and stable training of Pre-LN, making D EEP NORM a preferred alternative. We successfully scale Transformers up to 1,000 layers (i.e., 2,500 attention and feed-forward network sublayers) without difficulty, which is one order of magnitude deeper than previous deep Transformers. Remarkably, on a multilingual benchmark with 7,482 translation directions, our 200-layer model with 3.2B parameters significantly outperforms the 48-layer state-of-the-art model with 12B parameters by 5 BLEU points, which indicates a promising scaling direction.  \n\n  \nFigure 1: Trend of Transformer depths of state-of-the-art NLP models over time.\n\n# 1 Introduction\nRecent years have witnessed a trend towards large-scale Transformer (Vaswani et al., 2017) models. The capacity has substantially increased from millions of parameters (Devlin et al., 2019; Conneau et al., 2020) to billions (Radford et al., 2019; Brown et al., 2020; Huang et al., 2019; Raffel et al., 2020; Lepikhin et al., 2021; Rae et al., 2021; Lin et al., 2021; Smith et al., 2022), and even trillions (Du et al., 2021). Large-scale models yield state-of-the-art performance on a wide range of tasks, and show impressive abilities in few-shot and zero-shot learning. Despite an enormous number of parameters, their depths (as shown in Figure 1) are limited by the training instability of Transformers.  \n\nNguyen and Salazar (2019) find that pre-norm residual connections (Pre-LN) improve the stability of Transformers based on post-norm connections (Post-LN). However, the gradients of Pre-LN at bottom layers tend to be larger than at top layers (Shleifer et al., 2021), leading to a degradation in performance compared with Post-LN. In order to alleviate the above issue, there have been efforts on improving the optimization of deep Transformer by means of better initialization (Zhang et al., 2019a;b; Huang et al., 2020), or better architecture (Wang et al., 2019; Liu et al., 2020; Bachlechner et al., 2020; Shleifer et al., 2021). These approaches can stabilize a Transformer model with up to hundreds of layers. Yet, none of previous methods has been successfully scaled to 1,000 layers.  \n\nOur aim is to improve the training stability of Transformers and scale the model depth by orders of magnitude. To this end, we study the cause of unstable optimization, finding the exploding model update is responsible for the instability. Motivated by the above observation, we introduce a new normalization function (D EEP NORM ) at residual connections (He et al., 2016), which has theoretical justification of bounding the model update by a constant. The proposed method is simple yet effective, with just lines of code change. The approach improves the stability of Transformers so that we are able to scale model depth to more than 1,000 layers. Moreover, experimental results show that D EEP NORM combines the best of two worlds, i.e., good performance of Post-LN and stable training of Pre-LN. The proposed method can be a preferred alternative of Transformers, not only for extremely deep (such as ${>}1000$ layers) models, but also for existing large models. Notably, our 200-layer model with 3.2B parameters achieves 5 BLEU improvement on a massively multilingual machine translation benchmark compared to state-of-the-art model (Fan et al., 2021) with 48 layers and 12B model size.\n\n# 2 TL;DR for Practitioners\n<html><body><table><tr><td rowspan=\"2\" colspan=\"2\">def deepnorm(x): return</td><td rowspan=\"2\">Architectures</td><td colspan=\"2\">Encoder</td><td colspan=\"2\">Decoder</td></tr><tr><td></td><td>8</td><td></td><td>3</td></tr><tr><td rowspan=\"2\">def if</td><td>LayerNorm(x*Q +f(x)) deepnorm_init(w):</td><td>Encoder-only (e.g.,BERT)</td><td>(2N)</td><td>(8N)-</td><td></td><td></td></tr><tr><td>wis ffn v_proj out nn.init.xavier_normal_(w, gain=β)</td><td>t_proj']： Decoder-only (e.g.,GPT)</td><td></td><td></td><td>(2M)</td><td>(8M)-</td></tr><tr><td>elif Wis</td><td>['q-proj 'k_proj ： nn.init.xavier_normal_(w,gain=1)</td><td>Encoder-decoder (e.g.,NMT, T5)</td><td>0.81(N4M)6</td><td>0.87(N4M)-16</td><td>(3M)</td><td>(12M)-</td></tr></table></body></html>  \n\nFigure 2: (a) Pseudocode for D EEP NORM . We take Xavier initialization (Glorot and Bengio, 2010) as an example, and it can be replaced with other standard initialization. Notice that $\\\\alpha$ is a constant. (b) Parameters of D EEP NORM for different architectures ( $N$ -layer encoder, $M$ -layer decoder).  \n\nAs shown in Figure 2, it is simple to implement our method based on Transformers with PostLN. Compared to Post-LN, D EEP NORM up-scales the residual connection before performing layer normalization. Besides, we down-scale the parameters during initialization. Notably, we only scale the weights of feed-forward networks, as well as the value projection and the output projection of attention layers. Moreover, the scales of residual connection and initialization are dependent on the architecture (Figure 2). We provide more details in Section 4.3.\n\n# 3 Instability of Deep Transformer\nWe study the causes of the instability for deep Transformers. Our analysis begins with the observation: better initialization methods stabilize the training of Transformer. This has also been verified by previous work (Zhang et al., 2019a; Huang et al., 2020; Xu et al., 2021). Therefore, we study the  \n\n  \nFigure 3: (a) Gradient norm in the top layers of 18L-18L models. (b) Gradient norm in the last layer of the models with depths varying from 6L-6L to 24L-24L. (c) Validation loss curves of 18L-18L models.  \n\n  \nFigure 4: Visualization of the model update, the average input of LNs, and the gradients for the 18L-18L models at the early stage of training.  \n\ntraining process of Post-LN with or without proper initialization. With better initialization, we downscale the weights of $l$ -th layer by $k_{l}=N-l+1,l\\\\in[1,N]$ after performing Xavier initialization. For example, the output projection $W_{o}^{l}$ of FFN in l-th layer is initialized as:  \n\n$$\nW_{o}^{l}\\\\backsim\\\\mathcal{N}\\\\left(0,\\\\frac{1}{k_{l}^{2}d^{\\\\prime}}\\\\right),\n$$  \n\nwhere $d^{\\\\prime}$ is an average of input and output dimensions. We name this model Post-LN-init. Notice that different from the prior work (Zhang et al., 2019a), we narrow the scale of lower layers instead of the higher layers. We believe that it helps to separate the effect of the gradient scale from the model update. Besides, Post-LN-init has the same architecture as Post-LN, which eliminates the impact from the architecture.  \n\nWe train 18L-18L Post-LN and 18L-18L Post-LN-init on the IWSLT-14 De-En machine translation dataset. Figure 3 visualizes their gradients and validation loss curves. As shown in Figure 3(c), Post-LN-init converged while Post-LN did not. Post-LN-init has an even larger gradient norm in the last several layers, although its weights have been scaled down. Furthermore, we visualize the gradient norm of the last decoder layer with varying model depth from 6L-6L to 24L-24L. Figure 3 shows that the gradient norm of Post-LN-init in the last layer is still much larger than that of Post-LN, regardless of model depth. It concludes that the exploding gradients in deep layers should not be the root cause of instability of Post-LN, while the scale of model update tends to account for it.  \n\nThen we demonstrate that the instability of Post-LN comes from a chain of several issues, including gradient vanishing as well as too large model updates. As shown in Figure 4(a), we first visualize the norm of model update $||\\\\Delta F||$ at the early stage of training:  \n\n$$\n||\\\\Delta F||=||F(x,\\\\theta_{i})-F(x,\\\\theta_{0})||,\n$$  \n\nwhere $x$ and $\\\\theta_{i}$ denotes input, and model parameters after $i$ -th updates. Post-LN has an exploding update at the very beginning of training, and then nearly no update shortly. It indicates that the model has been stuck in a spurious local optima. Both warm-up and better initialization help alleviate this issue, enabling the model to update smoothly. When the update explodes, the inputs to LN become large (see Figure $4({\\\\mathsf{b}})$ and Figure 4(c)). According to the theoretical analysis from Xiong et al. (2020), the magnitude of gradient through LN is inversely proportional to the magnitude of its input:  \n\n$$\n||\\\\frac{\\\\partial L N(x)}{\\\\partial x}||=\\\\mathcal{O}(\\\\frac{\\\\sqrt{d}}{||x||}).\n$$  \n\nFigure 4(b) and Figure 4(c) show that $||x||$ is significantly larger than $\\\\sqrt{d}$ ($d=512)$ )without warm-up or proper initialization. This explains the gradient vanishing problem occurred in the training of Post-LN (see Figure 4(d)).  \n\nAbove all, the instability starts from the large model update at the beginning of training. It renders the model trapped in a bad local optima, which in turn increases the magnitude of inputs to each LN. As training continues, the gradient through LN becomes increasingly small, thus resulting in severe gradient vanishing. The vanishing gradients make it difficult to escape from the local optima, and further destabilize the optimization. On the contrary, Post-LN-init has relatively small updates, and the inputs to LN are stable. This relieves suffering from gradient vanishing, making optimization more stable.」\n", "dreams_guidance_context": "### Step by Step Decomposition\n\n#### Step 1: 确定研究的关键问题和目标\n- **关键问题**: LayerNorm和RMSNorm在Transformer模型中的具体表现和适用性有何不同？\n- **研究目标**: 从计算复杂度、训练稳定性以及在不同任务（如自然语言处理、图像处理等）中的效果等方面进行对比分析。\n\n#### Step 2: 梳理算法和方法\n- **算法和方法**: \n  - **LayerNorm**: 在每个子模块（如自注意力或前馈网络）之后应用，公式为：\n    $$\n    \\mathrm{LayerNorm}(\\mathbf{x})=\\frac{\\mathbf{x}-\\mathbf{E}(\\mathbf{x})}{\\sqrt{\\mathbf{V}(\\mathbf{x})}}\\cdot\\mathbf{g}+\\mathbf{b},\n    $$\n    其中$\\mathbf{g}$和$\\mathbf{b}$是可训练的增益和偏置。\n  - **RMSNorm**: 替代LayerNorm，减少计算开销并提高训练稳定性，公式为：\n    $$\n    \\mathrm{RMSNorm}(\\mathbf{x})=\\frac{\\mathbf{x}}{\\sqrt{\\mathbf{E}(\\mathbf{x}^2)}}\\cdot\\mathbf{g}.\n    $$\n  - **PCA技术**: 用于模型切片和压缩，通过计算正交矩阵$\\mathbf{Q}_{\\ell}$来实现。\n\n#### Step 3: 分析实验设计和结果\n- **实验设计**:\n  - **数据集**: 使用WikiText-2和Alpaca训练数据集进行校准。\n  - **模型**: 在OPT、LLAMA-2和Phi-2模型家族上进行实验。\n  - **任务**: 语言生成和零样本任务。\n  - **硬件**: 使用Quadro RTX6000、A100和H100 GPU进行实验。\n- **实验结果**:\n  - **LayerNorm vs. RMSNorm**: RMSNorm在计算效率和模型压缩方面表现出色，而LayerNorm在某些任务中仍然具有不可替代的优势。\n  - **PostNorm vs. PreNorm**: PostNorm在零样本翻译任务中表现优于PreNorm，尽管PreNorm在训练稳定性上更有优势。\n\n#### Step 4: 评估研究的局限性和未来方向\n- **局限性**:\n  - **计算开销**: RMSNorm虽然减少了计算开销，但在某些任务中可能不如LayerNorm有效。\n  - **实验数据**: 实验数据可能存在偶然性或不稳定性，需要进一步验证。\n- **未来方向**:\n  - **结合优点**: 探索如何结合LayerNorm和RMSNorm的优点，以优化Transformer模型的性能。\n  - **扩展任务**: 在更多任务和数据集上进行实验，验证归一化方法的普适性。\n  - **理论分析**: 深入理论分析，探讨归一化方法对模型训练和性能的影响机制。\n\n### 最终总结\n通过以上分析，可以得出以下结论：\n1. **LayerNorm和RMSNorm的适用性**: RMSNorm在计算效率和模型压缩方面表现出色，而LayerNorm在某些任务中仍然具有不可替代的优势。\n2. **PostNorm和PreNorm的表现**: PostNorm在零样本翻译任务中表现优于PreNorm，尽管PreNorm在训练稳定性上更有优势。\n3. **未来研究方向**: 结合LayerNorm和RMSNorm的优点，扩展实验任务和数据集，深入理论分析，以优化Transformer模型的性能。\n\n这些结论将有助于深入理解深度学习框架中的归一化技术，并为未来的研究提供新的思路。", "evolutionary_step": "### Step by Step Decomposition\n\n#### 1. **研究计算机网络与通信媒介中的语义信息**\n   - 对话中并未直接涉及计算机网络与通信媒介的语义信息。然而，Transformer模型及其变体（如BERT、RoBERTa）在自然语言处理任务中的应用，可以视为语义信息在深度学习框架中的一种表现形式。特别是LayerNorm和RMSNorm在Transformer中的应用，涉及到对输入数据的归一化处理，这可以看作是对语义信息的一种预处理步骤。\n\n#### 2. **研究计算机算法的非理性表现与优化技术中的偶然性**\n   - 对话中讨论了LayerNorm和RMSNorm在Transformer模型中的表现，特别是它们在计算复杂度、训练稳定性以及在不同任务中的效果。这些讨论涉及到算法在不同情境下的表现，以及如何通过优化技术（如PCA、正交矩阵的应用）来提升模型的性能。这些优化技术中的偶然性（如PCA在模型压缩中的应用）也是研究的一部分。\n\n#### 3. **研究人工智能系统中的反馈机制与实际应用的转化关系**\n   - 对话中提到了Transformer模型在训练过程中的稳定性问题，特别是PostNorm和PreNorm在训练中的表现差异。这些讨论涉及到模型训练中的反馈机制（如梯度消失、模型更新爆炸等）以及如何通过改进归一化方法（如DeepNorm）来稳定训练。这些改进方法在实际应用中的转化关系（如模型深度扩展到1000层）也是研究的重点。\n\n#### 4. **研究算法和数据结构的固定形式与预期结果的因果性，是否存在可拓展性和反向推理的潜力**\n   - 对话中详细讨论了LayerNorm和RMSNorm的固定形式及其在Transformer模型中的表现。通过实验验证，研究者分析了这些归一化方法在不同任务中的效果，并探讨了它们的可拓展性（如模型压缩、深度扩展）。此外，对话中还提到了反向推理的潜力，如通过PCA分析模型的信号矩阵，进而优化模型结构。\n\n### 总结\n对话主要围绕Transformer模型中的归一化方法（LayerNorm和RMSNorm）展开，讨论了它们在计算复杂度、训练稳定性以及不同任务中的表现。通过实验验证，研究者分析了这些方法的优缺点，并提出了改进方案（如DeepNorm）以提升模型的稳定性和性能。这些研究涉及到算法优化、反馈机制、模型扩展等多个方面，展示了计算机科学在深度学习领域的广泛应用和深入探索。", "dreams_personality_context": "### Step by Step Decomposition\n\n#### 1. **理解任务要求**\n   - 任务要求总结片段中人物的性格。然而，提供的片段主要涉及计算机科学领域的技术讨论，并未直接描述人物性格。因此，需要从对话内容中推断出人物的性格特征。\n\n#### 2. **分析对话内容**\n   - 对话内容主要围绕Transformer模型中的归一化方法（LayerNorm和RMSNorm）展开，讨论了它们在计算复杂度、训练稳定性以及不同任务中的表现。研究者通过实验验证，分析了这些方法的优缺点，并提出了改进方案（如DeepNorm）以提升模型的稳定性和性能。\n\n#### 3. **推断人物性格**\n   - **严谨性**：研究者详细讨论了LayerNorm和RMSNorm的固定形式及其在Transformer模型中的表现，并通过实验验证了这些方法的优缺点。这表明研究者具有严谨的科学态度。\n   - **创新性**：研究者提出了改进方案（如DeepNorm）以提升模型的稳定性和性能，展示了其创新思维。\n   - **批判性思维**：研究者分析了算法在不同情境下的表现，并探讨了优化技术中的偶然性，这表明其具有批判性思维。\n   - **合作精神**：对话中提到了通过PCA分析模型的信号矩阵，进而优化模型结构，这可能涉及到团队合作，展示了研究者的合作精神。\n\n### 总结\n根据对话内容，可以推断出研究者的性格特征包括严谨性、创新性、批判性思维和合作精神。这些特征在研究过程中得到了充分体现，展示了其在计算机科学领域的专业素养和团队合作能力。", "ref_analysis_id": ""}, "__type__": "dreams_node"}}, "analysis_store/ref_analysis_info": {"": {"node_ids": ["497f9c7c-4ab8-4ac6-bd59-4567d9485e83"], "metadata": {}}}, "analysis_store/metadata": {"497f9c7c-4ab8-4ac6-bd59-4567d9485e83": {"analysis_hash": "", "ref_analysis_id": ""}}}